{"1": {"review": "Great place to stop on and get some food. Sat down right away and placed my order. Good came out quick and full of flavor. Staff was very friendly too and attentive.", "time": "2 months ago", "rate": "Rated 4.0 out of 5,", "name": "Anthony Krupocin"}, "2": {"review": "The food was very good, and I had plenty of leftovers. The place was quiet and the staff was very friendly. The batter on the chicken was good, but for me it was not quite the taste I was expecting. Maybe I am too used to American-style sweet & sour chicken. I would definitely go back again.", "time": "4 months ago", "rate": "Rated 5.0 out of 5,", "name": "Joshua Washburn"}, "3": {"review": "Is there any way give them less then one star?\nService : poor, upto the point very first minute, serving plate throwing manner. Of course did not say sorry to me. \nFood:  what do you expect from them? I called them asked if this is how it supposed be? They said yes. Then, no expectations, just leave. No point to argue. \nI don't think they expect anyone as 2nd visits", "time": "a week ago", "rate": "Rated 1.0 out of 5,", "name": "ilsuk kwag"}, "4": {"review": "We really enjoyed our dinner here with friends. We had spicy seafood soup, chicken brocolli, noodle with brown sauce, fried dumplings and kimchi. - the food were generous and tasty. Service friendly and attentive. Overall, will definitely return.", "time": "2 weeks ago", "rate": "Rated 4.0 out of 5,", "name": "Neva Mccormick"}, "5": {"review": "Simply, don't go to this irritating place. Worst service, poor food quality and high price! You will definitely feel bad once you go there!", "time": "a week ago", "rate": "Rated 1.0 out of 5,", "name": "SY Shim"}, "6": {"review": "First of all, when I ordered my meal which was Pineapple fried rice with fried Tofu they charged me the regular price fifteen dollars then shortly returned to say I need to pay three dollars extra for tofu therefore bringing my lunch total up to eighteen dollars. I quickly said just add the shrimp...now when I got my meal the shrimp where baby shrimp nothing like the picture and the Pineapples where canned not fresh cut pineapples like all other Thai restaurants.  I asked for sweet and sour sauce they gave me duck sauce as if it were a Chinese restaurant...so annoyed a complete waste of fifteen dollars...never would I reccomend this place nor will I return!!", "time": "3 months ago", "rate": "Rated 1.0 out of 5,", "name": "Monique Moody"}, "7": {"review": "I, absolutely, do not recommend this restaurant. Service was mediocre and food was of poor quality and overly greasy. Plates were brought 10 minutes apart from each other and mine 30 minutes after everyone was done eating. The flavor was completely unacceptable, bland and sub par to any Korean restaurant. Never again!", "time": "3 weeks ago", "rate": "Rated 1.0 out of 5,", "name": "Ivan J. Zapata-Rivera"}, "8": {"review": "I like noodles and this place has noodles. You want Chinese Korean food then come here. It’s pricey compared to queens but we in the city and it’s city money so. But the food is okay for what it is. You want a review, it’s a 3 star place that offers food. If you want or need food you go get it. Noodles and the fried beef with sweet sauce. Chinese Korean food. Food came hot and well prepared. No dirty bowls and the eating place was well set up. 6:10:1", "time": "5 months ago", "rate": "Rated 3.0 out of 5,", "name": "Young ko"}, "9": {"review": "I have never been so disrespected and discriminated against in my life I walked in and was seated down with my table lady asked us what we wanted without giving us any menus then as we place our ordered while the restaurant was still empty we place a order of pad Thai the restaurant was flooded with about 20 people about 5min after we ordered we waited at the table for about 20 min everyone who walked in after us had food I tried to get up and just leave but one lady stopped me and said they are making the food but then another 12min go by with 8 plates of food coming out of the kitchen and 2 other tables getting served before us that’s when I had enough and got up and walked up by far worst experience I’ve had in NYC this place is terrible DONT come here if you want to feel comfortable eating your food", "time": "3 months ago", "rate": "Rated 1.0 out of 5,", "name": "marvin rodriguez"}, "10": {"review": "My boyfriend, myself, and my best friend with his children went to there for some thai food. We were super excited as it is close to our hotel and specifically waited to go there. When we got there, they sat us in this little corner and the lady came over and was like what do you want to order without even giving us menus. We asked for menus she came back over and we told them that the kids were gonna go next door but that we wanted to order. We all placed our order and about 10 plus minutes later a group of about 15 to 20 people came in. Every one of them was addressed and acknowledged prior to us. Then there was 2 tables next to us that came in after us and were treated and acknowledged and recieved their food prior to us. Another two more tables came in after us, ordered the all of their food was delivered while we were still waiting for our own! we questioned where it was and was just told it is coming. The party of about 20 people that came in also all received all of their food and appetizers and drinks still no food was brought out to our table for a party of only 3. When we asked again where everything was for the 2nd time  as we mentioned that we were getting ready to leave they kept saying it's gonna come, it's going to come. at that point we finally decided that this is not a place that we want to be at. we were being ignored and our food order was completely missing and there was no accountability! sadly we left went to another Thai restaurant which ended up being amazing!", "time": "3 months ago", "rate": "Rated 1.0 out of 5,", "name": "Adrienne Cochran"}, "11": {"review": "We just stopped in for a quick bite for the children. Our special request was for just a bowl of broth and a plate of noodles.", "time": "a month ago", "rate": "Rated 4.0 out of 5,", "name": "Seth Blanck"}, "12": {"review": "I came here to eat pho b/c it was conveniently across the street and they had a huge sign that they serve pho.  Against all of my intuition and my common sense I decided it was a good idea to try the pho out at a Korean restaurant.  I shouldn't really have to say how it went.  It's literally a bland bowl of MSG soup with salt that borderlines diabetic shock, a few pieces of paltry beef meat and mush noodles.  The accoutrements were a joke.  Whoever says this is a great place to eat pho has no concept of what pho really is.  I'd rather eat sandpaper out of a bowl of dog water than come back here.  GtFO with your \"We Serve Pho\" sign.  I got duped tho.  Well played.", "time": "2 months ago", "rate": "Rated 1.0 out of 5,", "name": "Godfrey Lee"}, "13": {"review": "I was craving black bean noodles when I visited because I love jjajangmyun. Theirs was delicious but the other foods weren't as good of quality compared to it; their tonkatsu was a bit tough and difficult to chew.", "time": "3 months ago", "rate": "Rated 4.0 out of 5,", "name": "Tiffany Lee"}, "14": {"review": "The noodles are actually really good. It was cool to be able to get a split bowl between jajangmyeon and jjampong. Fast service and casual setting—good for families.", "time": "5 months ago", "rate": "Rated 4.0 out of 5,", "name": "Michelle"}, "15": {"review": "This place is my secret vice. \n\nWhenever I find myself in the area, even if I have a lunch or dinner engagement close in time, I would pop in for a bowl of jamppong and maybe a side of their sweet and sour beef. \n\nPersonally, I like being left alone by servers unless I need something. Because of that, this place is great for me to enjoy my meal alone.", "time": "6 months ago", "rate": "Rated 5.0 out of 5,", "name": "Carmen Lau"}, "16": {"review": "The salt and pepper wings are amazing!   We have had many of the main dishes but my favorite has to be the kung pao scallops!  Delicious food with friendly service!!!", "time": "5 months ago", "rate": "Rated 4.0 out of 5,", "name": "Natosha Jacobs"}, "17": {"review": "I had jjajangmyeon and tangsuyuk combo. Really expensive from my point of view for that combo (I definitely paid over $15 for it), but I suppose I should take into consideration that it is NYC and cost in general is going to be crazy high, plus the fact that if I were to eat this in South Korea (Which is certainly quite cheaper), this would almost be non-issue. HOWEVER! I was really in a mood for the food, and I liked the taste. So four stars by me for hitting the spot.", "time": "7 months ago", "rate": "Rated 4.0 out of 5,", "name": "Grant Chun"}, "18": {"review": "There food is quality and have always had a great experience will\nContinue to order generals tsu chicken it's amazing.", "time": "5 months ago", "rate": "Rated 4.0 out of 5,", "name": "Leamarie Dawson"}, "19": {"review": "Pretty good food. Don't know if was the msg or what but i couldn't stop eating it. Place is nice and clean big tvs all over. But no peanuts in kung pow. That's odd.", "time": "5 months ago", "rate": "Rated 4.0 out of 5,", "name": "Daniel Ward"}, "20": {"review": "The shrimp pad thai is quite delicious. 15 small shrimps in a $15 pad thai. What I like BEST is the hot sauce and hot chilli powder (my favorite). I normally wouldn't go to an asian fusian restaurant when I'm in koreatown, I'd usually choose an authentic Korean restaurant.  But I am so glad I found this when I happened to be craving for pad thai. \n**Bonus points for having power outlets available just when we needed it most!!", "time": "4 months ago", "rate": "Rated 5.0 out of 5,", "name": "Kelly Chen"}, "21": {"review": "Wasn't all that impressed with the food and they really skimp on those flavorful side dishes that are generously offered at the other Korean restaurants in the area. Dining space is cramped with too many tables. Service was pleasant but not particularly speedy.", "time": "9 months ago", "rate": "Rated 2.0 out of 5,", "name": "G Aquino"}, "22": {"review": "This place is the best for giant bowls of spicy Korean noodles. My favorite is the Extra Seafood Spicy Noodle soup. Service is great and the dishes are delicious.", "time": "8 months ago", "rate": "Rated 5.0 out of 5,", "name": "daniel lam"}, "23": {"review": "Found by accident while in the area, but WOW that was good! Excellent service, and incredible food!", "time": "5 months ago", "rate": "Rated 5.0 out of 5,", "name": "Abby Langehennig"}, "24": {"review": "Outstanding place for korean food. Very tasty. Service is consistently great. It has a good atmosphere.", "time": "7 months ago", "rate": "Rated 5.0 out of 5,", "name": "jaden seymour"}, "25": {"review": "Excellent chinese korean food, good price. Basically a korean chinese neighborhood restaurant, not fancy not bad.", "time": "5 months ago", "rate": "Rated 4.0 out of 5,", "name": "Carlos A. Rivera-Jones"}, "26": {"review": "This is the worst  asian restaurant ever. Their fraud chicken is ridiculous. There was nearly no meat whatsoever. When I showed it to the server he literally accused me of not understanding in food and  asian cuisine. Absolutely ridiculous.  He came back and then  offered  to take it off the bill I said I will pay and then he insisted to take it off the bill then when I went to pay it was included!!!", "time": "5 months ago", "rate": "Rated 1.0 out of 5,", "name": "Kha- lË-daton"}, "27": {"review": "Authentic Korean Chinese food - reasonable price and huge amount of food!", "time": "5 months ago", "rate": "Rated 5.0 out of 5,", "name": "Jinwoong Hwang"}, "28": {"review": "Delicious food, kind.", "time": "2 weeks ago", "rate": "Rated 5.0 out of 5,", "name": "M Park"}, "29": {"review": "Terrific Korean-Chinese fushion place-the best in NY I have tried.  Ja Jiang noodles is terrific.  The soup base for thr Champ Bong is awesome.  Their noodles themselves are really good quality.  Other dishes, such as the fried dumplings, are very good as well.", "time": "5 months ago", "rate": "Rated 4.0 out of 5,", "name": "William Lu"}, "30": {"review": "Fast service and super delicious!! I'll be back.", "time": "7 months ago", "rate": "Rated 5.0 out of 5,", "name": "Lane Brettschneider"}, "31": {"review": "Casual place, stopped in to take advantage of the beer and fried chicken special but got upsold to the fried chicken and garlic pepper sauce with a bottle of soju for $23.  Very good recommendation I would say.   Topped off with the noodles with brown sauce as their specialty and it was an economically satisfying night.", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "David Chin"}, "32": {"review": "I go here far too often,  but the food is delicious. Definitely worth giving a try.", "time": "11 months ago", "rate": "Rated 5.0 out of 5,", "name": "I'adorher Robins"}, "33": {"review": "Food is excellent price is good", "time": "8 months ago", "rate": "Rated 4.0 out of 5,", "name": "Robert Cha"}, "34": {"review": "They force you to tip higher than you would like. Food is delicious", "time": "8 months ago", "rate": "Rated 3.0 out of 5,", "name": "Davin Kim"}, "35": {"review": "Very good Korean food, known for their jajameun... Never disappoints.. Probably the best I've ever had", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Chu Lin"}, "36": {"review": "Do not go there. Like street food. Taste bad. And they will ask you for tips.", "time": "10 months ago", "rate": "Rated 1.0 out of 5,", "name": "fedex never"}, "37": {"review": "Great and amazing food! We got seated at 7pm right away. Staff was very friendly and attentive and food portions are big! Highly recommend! Fills you up without you feeling bloated after!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Brandon Arp"}, "38": {"review": "If you’re in the mood for a good korean Chinese meal. Big portions and family style", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "graceeunjoo ."}, "39": {"review": "Solid 짜장면 but come for the 짬뽕 and get loads of seafood. You pay Manhattan prices but you get quality food.", "time": "5 months ago", "rate": "Rated 4.0 out of 5,", "name": "Brian Lee"}, "40": {"review": "awsome !!", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "IFTEKHARUL ALAM RUMMAN"}, "41": {"review": "Decent place to eat. Went with some friend who wanted to try it. I wasn’t blown away by the food. Our server was nice and help.\n\nWe had:\nFried Dumplings (Pretty good)\nGeneral Tso (mmm a lil bland)\nChicken Pineapple Fried Rice (good, but not flavorful) and \n2 Korean dishes that were popular. One was pork with noodles and the other was seafood with noodles in a red sauce.\n\nIn the table that we sat smelled old and had this old cat smell which was a turn off. I wouldn’t visit again but I do appreciate having good service.", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "Devonta White"}, "42": {"review": "Delicious Korean noodles~ portion is big too.   Love both the spicy seafood noodles and the mix noodles.   Spicy noodles are not too spicy.", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Grace Hung"}, "43": {"review": "This place is on the way from my work to the subway so I often come here to have dinner before I go back home.  Very reasonable priced and the service is nice.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Mark Lee"}, "44": {"review": "I came here from Michigan to try spicy seafood noodle soup. That does tell how good the food is. I tried several other locations located in other states as well, others cannot mimic the same taste, but this place knows the good taste is not from spices but from extremely fresh seafood which they prepare daily. This is a must stop whenever I visit NYC. \n\nFor Korean friends, this is the place you smooth your nostalgic craving on noodles", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "S Lee"}, "45": {"review": "Food took a long time to come out, the staff kept apologizing, a little expensive and food wasn't great.  Run of the mill lunch stop.", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "KP"}, "46": {"review": "Quality of food and service is too unreliable.  Not worth the chance.", "time": "a year ago", "rate": "Rated 1.0 out of 5,", "name": "Andy Park"}, "47": {"review": "Hyo Dong Gak has great tasting food, a large and diverse Asian menu, convenient operating hours, quick service, and friendly staff.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Jason Atkinson"}, "48": {"review": "Found mold in their chilli powder, it wasn't a big deal for them, very disappointing.... watch carefully.", "time": "a year ago", "rate": "Rated 1.0 out of 5,", "name": "Soo Chang"}, "49": {"review": "This is the place that I never want to visit again. The food tasted really bad and also the clerks were unkind.", "time": "11 months ago", "rate": "Rated 1.0 out of 5,", "name": "Minseo Chae"}, "50": {"review": "Great service and Chinese food was tasty!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "David V"}, "51": {"review": "Definitely not LGBTQ+ friendly. Heard some workers/owners whispering about “a girl who is dressed like a boy” there. Food is decent but pricy, and customer service was barely acceptable. Unfriendly. Go somewhere else.", "time": "a year ago", "rate": "Rated 2.0 out of 5,", "name": "Jae-won Jo"}, "52": {"review": "Good when you crave that", "time": "7 months ago", "rate": "Rated 3.0 out of 5,", "name": "Shaun K"}, "53": {"review": "I found a COCKROACH in Jjambong.               Seriously. So disgusting. I can imagine how clean their kitchen is. When i called them, the first word that she said was omg. Not even said sorry. And she wanted to give me some credits for future orders. Are you kidding me? Does she think that im gonna order again at this disgusting place? I was in shock. I asked them to refund the full amount. They hesitated and asked me to bring all dishes with the COCKROACH to the restaurant. WTH. I was soooo pissed. They dont know how to serve their customers. \n\nI wanna give them -5 stars. \n\nDO NOT ORDER ANY FOOD FROM THIS RESTAURANT if you dont wanna eat COCKROACH.", "time": "a year ago", "rate": "Rated 1.0 out of 5,", "name": "Irene Hwang"}, "54": {"review": "Ok. Steamed dumpling flavor was off, not cured by the soy sauce.  Dishes were gloppy.", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "Peter Wharton"}, "55": {"review": "Black sauce noodle is kind of expensive...", "time": "a year ago", "rate": "Rated 1.0 out of 5,", "name": "Shane Moon"}, "56": {"review": "This is an excellent place to eat pho. The restaurant is Korean but they have a small menu of Vietnamese and Thai dishes. For the price you cannot beat it. ", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Kristen Przybylski"}, "57": {"review": "Love the spicy and bean noodle with chicken combo", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "M K"}, "58": {"review": "It's decent but not the best of any specific Asian cuisine.", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "Dzung Nguyen"}, "59": {"review": "My friend recommended this place and he was right. Great jjampong and tangsooyuk. Would love to try again when I come back to New York", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Minsoon Choi"}, "60": {"review": "On the basis that I had used a Groupon this place was good.  Portion size of the noodles is huge and were decent in flavor.  Dumplings were okay, the skin was excellent however the filling was a bit tasteless.", "time": "2 years ago", "rate": "Rated 3.0 out of 5,", "name": "Hubert Eng"}, "61": {"review": "The workers are friendly", "time": "4 months ago", "rate": "Rated 5.0 out of 5,", "name": "mTimoF NL"}, "62": {"review": "I used to be a Shanghai-mong customer but since they've changed the management and the food started to taste like non-Korean chinese food, I stopped going and switched back to Hyo Dong Gak.  The food here is consistent and the price is reasonable.  I would visit there again.  They can improve the ambient a little, though.", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Thomas J. Lee"}, "63": {"review": "My absolute favorite! Spicy seafood noodle soup is a must!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "MIRJANA VICARI"}, "64": {"review": "Authentic Korean Chinese restaurant.", "time": "8 months ago", "rate": "Rated 5.0 out of 5,", "name": "WONGI SU"}, "65": {"review": "Food is okay and they deliver too.", "time": "10 months ago", "rate": "Rated 4.0 out of 5,", "name": "Kenny Park"}, "66": {"review": "It has awesome Jjampong, spicy seafood noodle soup, and also the portion is generous for its price. Also try their pho menu, which tastes pretty great.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "J S"}, "67": {"review": "I am giving it a 3 Star because I am not a big fan of Korean Chinese food. I think it is a cheap steal from authentic Chinese food but I guess when you have to wait over half an hour for Korean BBQ or Tofu stew in the nearby restaurants, this is the place to go if you have no patience or are dying of hunger. \n\nWe ordered one spicy seafood noodle soup, one jiajianmen, and one sweet and sour spicy chicken for three people. The spicy seafood noodle soup comes in a giant bowl with tons of chewy noodles and light but spicy broth. There are plenty of shrimp and squid in it. It is definitely enough for 3 or 4 people. The Jiajianmen is obviously the Korean interpretation and it is decent but not my cup of tea. \n\nMy favorite is their fried spicy sweet and sour chicken. It comes in a very generous portion again and is very delicious. Overall, the food is decent but honestly, I would prefer real Korean food rather than Korean Chinese food any day.", "time": "7 years ago", "rate": "Rated 4.0 out of 5,", "name": "Athena Chang"}, "68": {"review": "Their spicy noodle soup did not work for me with its high level of sodium. ", "time": "2 years ago", "rate": "Rated 3.0 out of 5,", "name": "jay kim"}, "69": {"review": "A quick meal and rather generic asian joint in the middle of the coorporate jungle. There's nothing too special about this place, but at the very least the portions are huge, definitely enough to split for two meals.", "time": "2 years ago", "rate": "Rated 3.0 out of 5,", "name": "An Z"}, "70": {"review": "we ordered take out and found it to be of good value.  good food at a good price...especially for New York.", "time": "9 years ago", "rate": "Rated 4.0 out of 5,", "name": "JP Benedict"}, "71": {"review": "Good Lunch Special but the service needs to improve. Also this place needs to work on their cleanliness.", "time": "2 years ago", "rate": "Rated 3.0 out of 5,", "name": "Felix"}, "72": {"review": "Korean-chinese restaurant ilon the outskirts of Ktown. I went there with my coworker for lunch during the week and it wasn't too crowded. There was enough people to reassure you that it's a decent place but not so much that you're waiting a long time to be seated and you don't have to shout to your friend to make yourself heard. \nI ordered the half and half JJA jjan myung and jjam bbong. I was so happy to see they have an option for that because anyone who goes to Korean/Chinese restaurant, they're familiar with the torn struggle between the two. You always want both. \nService and food was good. Price is really good for the portion they gave us.", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Annie Oh"}, "73": {"review": "My wife and I went here as it was next door to our hotel. The food was excellent. The breading on the General Tso's chicken was wonderful, and the shrimp lo mein was excellent as well. There were a LOT of Oriental people eating there and more that came in as we were eating, which to me is an indication that this is good, authentic cuisine. We thoroughly enjoyed the food and the price was very reasonable.", "time": "10 years ago", "rate": "Rated 5.0 out of 5,", "name": "Keith Murray"}, "74": {"review": "Nice Korean Food and reasonable price ", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Rodger Chuah"}, "75": {"review": "Very good corean food. The size is amazing and low price, very recommendable!!!", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Folka México"}, "76": {"review": "I enjoyed my rice and stew.", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "Dami Ajayi"}, "77": {"review": "Classic Chinese food 🍜", "time": "8 months ago", "rate": "Rated 5.0 out of 5,", "name": "Jennifer Dawson"}, "78": {"review": "Something changed badly. I enjoyed this restaurent once or twice a month. Recently the taste of the foods became very bad for me. It was the best Korean chinese food in NYC. Now the worst. Very disappointing this time.", "time": "3 years ago", "rate": "Rated 1.0 out of 5,", "name": "Mark Pak"}, "79": {"review": "Great food and service and location. Price is right too.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Gary Miliefsky"}, "80": {"review": "As a Korean, I have to divulge a secret about this place. It's Chinese-Korean cuisine. This is my go to place for 2 of the most popular dishes in Korea that few non-Koreans know about. They're jjajangmyeon and jjanpong.  You'll notice that when you walk in these two are primarily what Koreans order because that's what Koreans like to eat from Chinese-Korean cuisine.  I advise all my friends to order only these two dishes as the rest of the dishes are average at best.  I give it 5 stars because it is the only place in Manhattan that serves the two dishes I mentioned.  Otherwise you'll have to trek to Queens or cross the GW Bridge to get to Fort Lee/Palisades for this stuff.", "time": "5 years ago", "rate": "Rated 5.0 out of 5,", "name": "Zeno Lee"}, "81": {"review": "Two words: pad thai.\nThe pickles they give you before your meal add a nice touch, but this is apparently a Chinese \"fusion\" spot in the guise of of a Korean restaurant. If you're feeling korean bbq, don't bother. That said, they're willing to order it from the actual korean place next door and serve it to you in their place :p", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Cai Tomlinson"}, "82": {"review": "Worst jjajjangmyun ever including Korea I tried. Have it in-store but eww...", "time": "2 years ago", "rate": "Rated 1.0 out of 5,", "name": "Sung Hwan Joo"}, "83": {"review": "Chinese food. Nothing special", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "Laurent Masson"}, "84": {"review": "probably the best Chinese Korean restaurant in K-town area. ", "time": "4 years ago", "rate": "Rated 3.0 out of 5,", "name": "Seung Mun"}, "85": {"review": "Try Tangsooyook (Sweet & sour beef).", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Fano Yong"}, "86": {"review": "It's okay here but not too great", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "John Kim"}, "87": {"review": "Best Jjambbong in my life! I go there every week:)", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "YUNA LEE"}, "88": {"review": "Saturdays are for the Boys!", "time": "9 months ago", "rate": "Rated 5.0 out of 5,", "name": "Andrew Ahn"}, "89": {"review": "This is a Korean style Chinese! Don't rate it down for not having orange chicken! :(", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Ahyoung Kim"}, "90": {"review": "Despite the korean name, the food was chinese. Despite the menu being in chinese, the staff did not seem comfortable with me ordering in chinese and one dude ran away when I asked if they had green beans. Despite the myriad dishes on the menu, everything was uniformly covered in the same brown glop.\n\nFunny place.", "time": "7 years ago", "rate": "Rated 2.0 out of 5,", "name": "Eric Minikel"}, "91": {"review": "My nephews favorite restaurant. Sweet and spicy pork is a favorite.", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Richard Chun"}, "92": {"review": "Obsolete. Now that Dong Chun Hong is available.", "time": "2 years ago", "rate": "Rated 2.0 out of 5,", "name": "Douglas Park"}, "93": {"review": "Spicy seafood noodle soup extremely good", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Sebastiano Peluso"}, "94": {"review": "Best Korean style chinese food in nyc.", "time": "6 years ago", "rate": "Rated 4.0 out of 5,", "name": "Heigenberg HP"}, "95": {"review": "the Worst service, worst delivery and most terrible attitude toward customers.", "time": "4 years ago", "rate": "Rated 1.0 out of 5,", "name": "SC Shin"}, "96": {"review": "It's ok. ", "time": "2 years ago", "rate": "Rated 3.0 out of 5,", "name": "Jong Hoon Kim"}, "97": {"review": "Good noodles and soup ", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Alex Yakubov"}, "98": {"review": "Special set menu", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Fran Cha"}, "99": {"review": "(Translated by Google) Order and from where in 40 minutes.\nWe opened and sat down for the second time, so our order is missing. I don't come out until I eat out all the other tables.\nI was forced to tip because of the tip culture of American beggars.\n\nThe food Fine.I had it.\nI ate three samganjjangjang / samseon pepper champon / gun dumpling.\nI was a little jajangmyeon Singer wotgo gunmandu is eaten warm with fried liver it was delicious even in less than a mandupi.\nChampong was delicious as eolkeun.\n\n(Original)\n주문하고 40분 만에 나온 곳.\n저희가 오픈하고 두 번 째로 자리에 앉았는데 저희 오더가 누락되었나봐요. 다른 테이블들 다 먹고 나갈 때 까지 안나오다가 말하니까 이제서야 조리,,,\n미국의 거지같은 팁 문화때문에 어쩔 수 없이 팁 드렸네요.\n\n음식은 괜찮았어요.\n삼선간짜장/삼선고추짬뽕/군만두 이렇게 먹었어요.\n짜장면은 좀 싱거웠고 군만두는 만두피에 아예 간이 안되어있었는데 따뜻하게 튀겨진 맛으로 먹었어요.\n짬뽕은 얼큰하게 맛있었습니다.", "time": "a week ago", "rate": "Rated 3.0 out of 5,", "name": "SEOHUI KIM"}, "100": {"review": "(Translated by Google) The champon was a bit lukewarm, but it was good to eat\n\n(Original)\n짬뽕이 좀 미지근했지만 먹을만했고(겨울에갔을때 엄청 뜨끈하게 맛있게먹었었는데 여름이라 미지근하게 주신건가..) 탕수육이 참 쫄깃하니 맛있었당", "time": "a month ago", "rate": "Rated 4.0 out of 5,", "name": "Mini C"}, "101": {"review": "(Translated by Google) I ordered pork gas. The meat is low quality and fried to hide the weakness. The rice is crunchy, and the salad will tell you how long you are using the vegetables. But it's not much of a sheep. I still have a service job and I'm pushing the tip.\n\n(Original)\n제가 주문한건 돈가스인데요. 고기는 질이 낮고 튀김으로 빈약함을 감추려고합니다. 밥은 푸석하구요 샐러드는 얼마나 오래됀 채소를 쓰는지 쭈글쭈글합니다. 그렇다고 양이 많은것도아니에요. 그래도 서비스업한답시고 팁까지 강요하네요", "time": "2 months ago", "rate": "Rated 1.0 out of 5,", "name": "Jake Kang"}, "102": {"review": "(Translated by Google) Chanpon is delicious ~ I think I did not put a lot of seasoning, so it was nice to have a cheer after eating! I will be going again next time\n\n(Original)\n짬뽕 맛있어요~ 조미료를 많이 안 넣은것 같아 먹고나서도 속이 편해서 좋았어요! 다음에 또 갈 예정입니다", "time": "5 months ago", "rate": "Rated 5.0 out of 5,", "name": "IAN KIM"}, "103": {"review": "(Translated by Google) It tastes like Champon Jjajang. Gyoza is delicious.\n\n(Original)\n짬뽕 짜장 맛잇엇요. 군만두가 맛잇어요.", "time": "3 weeks ago", "rate": "Rated 5.0 out of 5,", "name": "eunah kim"}, "104": {"review": "(Translated by Google) Exactly\n\n(Original)\nExact ce trebuie", "time": "2 months ago", "rate": "Rated 5.0 out of 5,", "name": "stefan petrut"}, "105": {"review": "(Translated by Google) This house is by far the best in Korean cuisine in Manhattan.\nA delicious Chinese restaurant we think of, just like that.\nI am always worried about it, but after eating it, I enjoy it both ways and always get very satisfied. It is very pleasing to pounding before eating, because the flow of polish on the surface of the jelly. Champong is also very satisfied with the delicious taste compared to the view, pounding ground. Well, if you do not talk about the sweet and sour pork, you will pour the sauce and eat it as a side dish. Do not forget to sell it, and ask for the sauce separately. I do not eat fried rice in Chinese restaurant well, but when I see my friend emptying out, fried rice is delicious. Open your first drink and \"drink it.\" . Free delivery is also available for reference.\n\n(Original)\n맨해튼 내에서 한국식 중국요리는 이 집이 단연 으뜸.\n우리가 생각하는 맛있는 중국집, 딱 그런 집임.\n늘 고민하다가 짬짜면을 먹고 나오는데, 양쪽 다 맛있어서 늘 매우 만족하면서 나옴. 짜장면에 윤기가 좌르르 흐르는 것이, 먹기 전부터 매우 만족 땅땅땅. 짬뽕도 보기에 비해 맛있게 매워서 또 매우 만족 땅땅땅. 참참, 탕수육은 따로 말하지 않으면 소스를 부어서 부먹으로 먹게 되니 주의할 것. 찍먹파는 잊지 말고 소스를 따로 달라고 해야 함. 난 중국집에서 파는 볶음밥은 잘 안 먹는데, 내 친구는 싹싹 비우는걸 보면, 볶음밥도 맛있나봄. 첫 술 뜨고 \"마시써.\" 라고 함. 참고로 free delivery도 가능함.", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Courtney Kim"}, "106": {"review": "(Translated by Google) You need to know history.\n\n(Original)\n역사를 알아야 한다.", "time": "5 days ago", "rate": "Rated 5.0 out of 5,", "name": "방룡"}, "107": {"review": "(Translated by Google) It is a good place to eat when you miss the taste of Korea in America because of the taste of old mackerel. As most American restaurants have a lot of sheep, it is likely that you will be able to give it to those who visited in Korea. Since it is weekday low, the service of the staff of the hall hall was different than the existing evaluation and was above average.\n\n(Original)\n옛날 짜장면의 맛으로 미국에서 한국의 맛이 그리울때 먹으면 좋은 집. 대부분의 미국 레스토랑이 그러하듯 양이 많으니 한국에서 방문하신분들은 감안하여 시키시면 될 듯 합니다.  평일 낮이어서 그런지 홀 직원분들의 서비스는 기존 평가와는 다르게 평균이상이었습니다.", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Yong Ghil Baik"}, "108": {"review": "(Translated by Google) If you want to eat Chinese food in New York\n\n(Original)\n뉴욕에서 중국요리 먹고싶다면", "time": "a month ago", "rate": "Rated 3.0 out of 5,", "name": "송순석"}, "109": {"review": "(Translated by Google) It was hyodongkang that the Korean food was visited every time I ate the food that I felt. The sweet and sour pork was not as tasty as I thought, but the champon was delicious.\nIf you see a serving, you will have a corona beer on one side ... This is America!\n\n(Original)\n매번 느끼한 음식 먹다가 한식이 땡겨 방문한 효동각.. 탕수육은 생각보다 맛이 별로였지만 짬뽕은 맛있게 잘 먹었습니다. \n서빙보시는 분이 한쪽에서 코로나 맥주 드시고...뭐 여긴 아메리카니까요!!", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "CH Lee"}, "110": {"review": "(Translated by Google) Champon has a lot of quantity and taste.\n\n(Original)\n짬뽕이 양도 많고 맛나요.", "time": "7 months ago", "rate": "Rated 5.0 out of 5,", "name": "서기원"}, "111": {"review": "(Translated by Google) The worst service I have ever come across in America is at a Korean restaurant ... even the food is not so good. It is hard to have sweet and sour pork without taste. It was the first restaurant I did not like to tip.\n\n(Original)\n미국와서 먹어본 레스토랑중에 최악의 서비스를 한국식당에서 경험하다니... 심지어 음식도 별로에요. 탕수육이 맛없기는 참 힘든일인데.. 외국인 친구 데려갔으면 큰일날 뻔. 팁도 주기 싫은 식당은 처음이었네요.", "time": "11 months ago", "rate": "Rated 1.0 out of 5,", "name": "김소연"}, "112": {"review": "(Translated by Google) I came from Alaska because of my daughter 's wedding ceremony, and I ate jamjang noodles, chanpong, and dumplings and ate them in New York. I did not understand the fact that the potatoes came into my mouth, but if I hit it with a score of 100, I would have got 75 points of Champon 80 points. I had eaten mackerel and champon in Dongchun Hong the day before. I honestly did not feel shaved and tasted ... Champon had no taste. It was close to the taste of soup with broth. It is 40 points and 40 points. Frankly, I am doubtful about the skill of the chef.\n\n(Original)\n딸 결혼식 때문에 알라스카에서 와서 짜장면과 짬뽕 그리고 군만두를 시켜서 먹어봤는데 뉴욕에서 두군데 가본중에 그나마 맛있게 먹었다. 짜장면에 감자가 들어간게 조금 이해는 안갔지만...점수로 친다면 100점 만점에 짜장 75점 짬뽕80점  전날 동춘홍에서 짜장면과 짬뽕을 먹어봤는데 솔직히 면도 쫄깃하지 안았고 맛도 별로...짬뽕은 맛이 정말없었다. 짬뽕이 라고 하기에는 매운탕 국물 맛에 가까웠다. 짜장40점 짬뽕 35점 짜리다. 솔직히 주방장 실력이 의심스럽다.", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "david choi"}, "113": {"review": "(Translated by Google) Oh, I did not know when I was calculating this house. I ate two shochu, but I hit it with three bottles. Do not really go to a restaurant like this.\n\n(Original)\n아.. 일단 이집 계산 할땐 몰랐는데 소주두개먹었는데 3병으로 쳤네요 이런식으로 삥땅치는 식당 진짜 가지마세요", "time": "10 months ago", "rate": "Rated 1.0 out of 5,", "name": "Andrew Lee"}, "114": {"review": "(Translated by Google) When I miss Korean mackerel tastes in New York, here is ~~~ The price and taste is ok too.\n\n(Original)\n뉴욕에서한국의짜장면맛이그리울땐여기로~~~가격도맛도괜찮아요.", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "김민"}, "115": {"review": "(Translated by Google) Uh ...\n\nOnce I ordered, the food came a little over an hour and the cotton was all blown ...\n\nOnce you have come to the rice cake,\n\nEven some Yelp reviews have found cockroaches in champon ... Yuck.\n\nFour or five years ago, I ate once or twice, but then I got up.\n\nNow it's too much for me to have a Vietnamese Thai restaurant\n\nHere again do not eat ^ oh ^\n\n(Original)\n으으...\n\n일단 주문하고 한시간 조금 넘어서 음식이 와서 면이 다 불어있었음...\n\n일단 면이 떡이되서 왔는데 짜장도 간이 안맞음\n\n심지어 Yelp 리뷰중 짬뽕에 바퀴벌레 나왔다는 사람도 있고...  우웩\n\n4~5년전인가 한두번 와서 먹었는데 그때는 ㄱㅊ았음\n\n지금은 너무 무리해서 중식에 Vietnamese Thai 까지 다 하니까 식당이 개판인듯\n\n여기서 다시는 안먹음 ^오^", "time": "a year ago", "rate": "Rated 1.0 out of 5,", "name": "윤스"}, "116": {"review": "(Translated by Google) If you're tired of American food and give Korean people a little bit of champon and sweetness! So if it '\n\n(Original)\n미국 음식에 지친 한국 사람들에게 얼큰함을 주는 짬뽕과 달콤함을 주는 짜장면! 그래서 짬짜면!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Jaewoo Do"}, "117": {"review": "(Translated by Google) The best Chinese restaurant in the United States doesn't have a Korean taste. The noodles are chewy and delicious. The best menu is Champon. However, please be aware that delivery or takeout may be delayed.\n\n(Original)\n미국에 있는 웬만한 중국집은 한국의 맛이 나는 집이 잘 없는데 여기는 한국의 맛이 나서 좋음. 면이 쫄깃하고 맛도 좋음. 최고메뉴는 짬뽕. 그러나 배달이나 테이크아웃은 시간이 지체될수 있음을 아시길.", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Soonchan Park"}, "118": {"review": "(Translated by Google) Tasteless\n\n(Original)\n맛없음", "time": "5 months ago", "rate": "Rated 1.0 out of 5,", "name": "DAEHEE KIM"}, "119": {"review": "(Translated by Google) I do not want a very busy honestly say whether the order came and went beyond the call do more than 30 minutes. 40 minutes after arrival. Kenseol angry, crying ... bateuni to eat sweet and sour mustard ssoseu is not neunda Champong, chop suey ppuleo and no bad taste. ahkkawot money chest!\n\n(Original)\n아주싫었습니다 바쁘면 솔직히말하고오더한지40분넘어전화하니 갔다고하고 갔다한지30분넘게..화가나켄설하니..도착 울며겨자먹기로받으니..탕수육쏘스는없고 짬뽕,잡채는다뿔어 맛도형편없고..돈이아까웠슴!!", "time": "3 years ago", "rate": "Rated 1.0 out of 5,", "name": "Yeonsook Hong"}, "120": {"review": "(Translated by Google) Bob had a good feeling when calculating was not too outrageous. Calculated as the cards were deuryeotneunde tip thereafter for cash, then do try to go 'cause he did racking minutes revelations on the counter. Why settle for tips. We are certainly not while downed earlier When I talk to your grandparents in cash ttajisi teaching books Bring the bill. Turns out inde-looking two minutes communication in the division who gave the tip to get trails serving counter does not work well is one minute revelations to counter deogunyo you do not even apologize. Tip is not that the value of the services I received? It does not look as though it looks like hell to get siryeoneun, and look ttajineun said was wrong to guests, I apologize wrong is by opening a ahkkaul 1 degree. Review the information coming in continues to rise on the service looks peeping improvement.\n\n(Original)\n기분 좋게 밥 먹었다가 계산할 때 너무 어이가 없었습니다. 카드로 계산했고 그 이후에 팁을 현금으로 드렸는데, 가게를 나서려고 하니 카운터에 계시는 분이 팁을 왜 안주냐면서 따지셨어요. 저희는 분명히 아까 현금으로 드렸다고 했더니 아니라면서 계산서를 가져오시면서 가르치는 말투로 따지시더라고요. 알고 보니 팁을 가져가신 서빙해 주신 분과 카운터에 계시는 분의 소통이 제대로 이루어지지가 않아 생긴 일인데, 카운터에 계시는 분은 사과조차 하지 않으시더군요. 팁은 제가 받은 서비스에 대한 값 아닌가요? 그걸 그렇게 악착같이 받으시려는 모습, 그리고 손님에게 틀렸다며 따지는 모습, 본인이 잘못했음에도 사과하지 않는 모습은 별 1개도 아까울 정도입니다. 리뷰에도 서비스에 관한 내용이 계속 올라오는데 개선이 없나봅니다.", "time": "2 years ago", "rate": "Rated 1.0 out of 5,", "name": "Nayeon Kim"}, "121": {"review": "(Translated by Google) I visited in a long time I wanted to eat Chinese food, taste like friends came in above expectations also cut everybody happy! Next time you want to eat Chinese food is always going to visit!\n\n(Original)\n오랜만에 중국음식이 먹고싶어서 방문했는데, 기대 이상으로 맛있어서 같이 왔던 친구들도 다들 만족했네요! 다음번에도 중국음식 먹고 싶으면 항상 방문 할 생각입니다!", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Couldyou7"}, "122": {"review": "단체손님에 대한 서비스가 요구됨", "time": "11 months ago", "rate": "Rated 2.0 out of 5,", "name": "이정섭"}, "123": {"review": "(Translated by Google) I ate it often, but it was very unpleasant today.\nI ordered it at 7:08, but it's not even an hour and a half?\nI'm calling to pick you up. Instead of apologizing, just understand your situation.\nLater it sucks.\nService fireflies.\nI had been a customer of this restaurant for a several years.\nHowever, I had a terrible unpleasant experience today.\nI had ordered my food at 7:08 PM and waited for one and half hour although the estimate delivery time was 30 mins to 45 mins. So, I called the restaurant and complained about the delay, asked for a reasonable explanation. What they said was ridiculous; they never apologized and just forced me to be more patient, and later they actually got mad at me.\nWhat a horrible service !!\nI wish YOU would be another victim of this shitty service.\n\n(Original)\n자주 시켜 먹었는데 오늘 아주 불쾌한 일이 있었네요..\n주문을 7시 8분에 시켰는데 1시간 30분이 지나도 안오네?\n전화해서 따지니까 사과는 커녕 자기네 상황만 이해하라고만 하고\n나중엔 짜증까지 내더이다.\n서비스 개똥망.\nI had been a customer of this restaurant for a several years. \nHowever, I had a terrible unpleasant experience today.\nI had ordered my food at 7:08 PM and waited for one and half hour although the estimate delivery time was 30 mins to 45 mins. So, I called the restaurant and complained about the delay, asked for a reasonable explanation. What they said was ridiculous; they never apologized and just forced me to be more patient, and later they actually got mad at me.\nWhat a horrible service!!\nI wish YOU would be another victim of this shitty service.", "time": "4 years ago", "rate": "Rated 1.0 out of 5,", "name": "H Choi"}, "124": {"review": "(Translated by Google) When I first put the schedule into the schedule, I felt a sense of discomfort.\n\nBut after eating a bite, I went through a miracle.\nThe eyes of both eyes were lifted and the caretaker rose.\n\nSamseon Champong was tasteless in Korea\n\n(Original)\n처음 효동각을 스케줄에 넣었을땐 자괴감이 들었스무니다 뉴욕까지가서 중국집을 가다니\n\n하지만 한입 먹고 나서 기적을 겪었습니다\n두눈이 떠지고 앉은뱅이가 일어섰습니다\n\n삼선짬뽕은 한국에서도 먹기 힘든 맛이었습니다", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "James Jun"}, "125": {"review": "(Translated by Google) Just an ordinary neighborhood Chinese level. The taste and quantity are not good for the price. In particular, sweet and sour pork.\n\n(Original)\n그냥 평범한 동네 중국집 수준. 가격대비 맛과 양이 살짝 못 미친다. 특히, 탕수육.", "time": "3 years ago", "rate": "Rated 3.0 out of 5,", "name": "Sanghee Lee"}, "126": {"review": "(Translated by Google) Decent Chinese restaurant\n\n(Original)\n괜찮은 중식당", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "이상헌"}, "127": {"review": "(Translated by Google) I'm tasty and my chanpon is okay.\n\n(Original)\n짜장면은 맛없고 짬뽕은 괜찮", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "김다정"}, "128": {"review": "(Translated by Google) Not good\n\n(Original)\n좋지않음", "time": "2 years ago", "rate": "Rated 2.0 out of 5,", "name": "양희수"}, "129": {"review": "(Translated by Google) Well ..... Champong hit ㅋㅋㅋ\n\n(Original)\n짬뽕 맞았음.....ㅋㅋㅋ", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "박용근"}, "130": {"review": "(Translated by Google) it's delicious\n\n(Original)\n맛있어요", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "홍준식"}, "131": {"review": "", "time": "a month ago", "rate": "Rated 4.0 out of 5,", "name": "Heejin Ohn"}, "132": {"review": "", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "JEONG LEE"}, "133": {"review": "", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Kris Kim"}, "134": {"review": "", "time": "3 months ago", "rate": "Rated 2.0 out of 5,", "name": "junsung park"}, "135": {"review": "", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Wonjung Ro"}, "136": {"review": "", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "Andy Kang"}, "137": {"review": "", "time": "5 months ago", "rate": "Rated 5.0 out of 5,", "name": "emelin amariliz macario pacheco"}, "138": {"review": "", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Ionut Dogaru"}, "139": {"review": "", "time": "a year ago", "rate": "Rated 2.0 out of 5,", "name": "SEOK KIM"}, "140": {"review": "", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Toebz Lindq"}, "141": {"review": "", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "김수민"}, "142": {"review": "", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Tai Y Lee"}, "143": {"review": "", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Hyeoksu shin"}, "144": {"review": "", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Hyesun Kim"}, "145": {"review": "", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "김영민"}, "146": {"review": "", "time": "2 months ago", "rate": "Rated 1.0 out of 5,", "name": "Haris Sumitro"}, "147": {"review": "", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Anand Thangaraju"}, "148": {"review": "", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Raymond Yeung"}, "149": {"review": "", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Bogdan Gross"}, "150": {"review": "", "time": "9 months ago", "rate": "Rated 5.0 out of 5,", "name": "Domingo"}, "151": {"review": "", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Sorock Kim"}, "152": {"review": "", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "Narongthorn Musikul"}, "153": {"review": "", "time": "2 weeks ago", "rate": "Rated 4.0 out of 5,", "name": "Sue Ham"}, "154": {"review": "", "time": "2 weeks ago", "rate": "Rated 5.0 out of 5,", "name": "Phillippa Reay"}, "155": {"review": "", "time": "2 years ago", "rate": "Rated 3.0 out of 5,", "name": "Franchesca Gore"}, "156": {"review": "", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Won Gu Kang"}, "157": {"review": "", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Leo Yi"}, "158": {"review": "", "time": "5 months ago", "rate": "Rated 4.0 out of 5,", "name": "Rita Chang"}, "159": {"review": "", "time": "9 months ago", "rate": "Rated 5.0 out of 5,", "name": "Starlyn Garner"}, "160": {"review": "", "time": "a month ago", "rate": "Rated 4.0 out of 5,", "name": "Luke K"}, "161": {"review": "", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "Gabriel Chun"}, "162": {"review": "", "time": "10 months ago", "rate": "Rated 2.0 out of 5,", "name": "Ted Moon"}, "163": {"review": "", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Paula Norström"}, "164": {"review": "", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Young J"}, "165": {"review": "", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "jinu E"}, "166": {"review": "", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Chris Cannon"}, "167": {"review": "", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "jb tabili"}, "168": {"review": "", "time": "2 years ago", "rate": "Rated 2.0 out of 5,", "name": "Phil Merrick"}, "169": {"review": "", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Sol P"}, "170": {"review": "", "time": "2 weeks ago", "rate": "Rated 4.0 out of 5,", "name": "Young Na"}, "171": {"review": "", "time": "6 months ago", "rate": "Rated 5.0 out of 5,", "name": "S Pak"}, "172": {"review": "", "time": "a year ago", "rate": "Rated 1.0 out of 5,", "name": "Rothavy Khin"}, "173": {"review": "", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Younggul Kang"}, "174": {"review": "", "time": "7 months ago", "rate": "Rated 4.0 out of 5,", "name": "Brian Kim"}, "175": {"review": "", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "hae kyoung kim"}, "176": {"review": "", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Jeesun Hunting"}, "177": {"review": "", "time": "a month ago", "rate": "Rated 4.0 out of 5,", "name": "Castro CheckX"}, "178": {"review": "", "time": "4 years ago", "rate": "Rated 5.0 out of 5,", "name": "Maricarmen Algarra Cedeño"}, "179": {"review": "", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Jackie Hong"}, "180": {"review": "", "time": "a month ago", "rate": "Rated 3.0 out of 5,", "name": "Bo Young Choi"}, "181": {"review": "", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Daniel Han"}, "182": {"review": "", "time": "2 months ago", "rate": "Rated 4.0 out of 5,", "name": "Su Young Kim"}, "183": {"review": "", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "boudia linda"}, "184": {"review": "", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "KwanWoo Lee"}, "185": {"review": "", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Min Chen"}, "186": {"review": "", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Aubrey Crouch"}, "187": {"review": "", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "RuoQiong Lin"}, "188": {"review": "", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Ri Keitaro"}, "189": {"review": "", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "ERICK JAEWOO OH"}, "190": {"review": "", "time": "3 years ago", "rate": "Rated 1.0 out of 5,", "name": "David Jeong"}, "191": {"review": "", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "E Mong"}, "192": {"review": "", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Julia Genao-Modesto"}, "193": {"review": "", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Nir Efrat"}, "194": {"review": "", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Kevin Kim"}, "195": {"review": "", "time": "2 years ago", "rate": "Rated 3.0 out of 5,", "name": "Dongin C"}, "196": {"review": "", "time": "3 months ago", "rate": "Rated 4.0 out of 5,", "name": "Saundarya Ejanthkar"}, "197": {"review": "", "time": "2 months ago", "rate": "Rated 5.0 out of 5,", "name": "Danny Maiuri"}, "198": {"review": "", "time": "11 months ago", "rate": "Rated 4.0 out of 5,", "name": "Shizuko Iwaya"}, "199": {"review": "", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "Robert Kang"}, "200": {"review": "", "time": "a year ago", "rate": "Rated 2.0 out of 5,", "name": "Matte Han"}, "201": {"review": "", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "Joo Kim"}, "202": {"review": "", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Haeseung Lee"}, "203": {"review": "", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Mi Ryoung Park"}, "204": {"review": "", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "이나래"}, "205": {"review": "", "time": "5 days ago", "rate": "Rated 5.0 out of 5,", "name": "이선중"}, "206": {"review": "", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Moon Kwon"}, "207": {"review": "", "time": "2 years ago", "rate": "Rated 3.0 out of 5,", "name": "Billy Pak"}, "208": {"review": "", "time": "a month ago", "rate": "Rated 3.0 out of 5,", "name": "Ableman"}, "209": {"review": "", "time": "7 months ago", "rate": "Rated 5.0 out of 5,", "name": "Mike Mun"}, "210": {"review": "", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "스케치"}, "211": {"review": "", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Fred Heitjan"}, "212": {"review": "", "time": "3 years ago", "rate": "Rated 1.0 out of 5,", "name": "SKW"}, "213": {"review": "", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "hosoon lee"}, "214": {"review": "", "time": "5 months ago", "rate": "Rated 3.0 out of 5,", "name": "전승연"}, "215": {"review": "", "time": "4 weeks ago", "rate": "Rated 1.0 out of 5,", "name": "Tom Kim"}, "216": {"review": "", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Eduardo Pajaro"}, "217": {"review": "", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Melissa Thames"}, "218": {"review": "", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Jin Choul Chai"}, "219": {"review": "", "time": "2 months ago", "rate": "Rated 4.0 out of 5,", "name": "Amanda Rivera"}, "220": {"review": "", "time": "7 months ago", "rate": "Rated 5.0 out of 5,", "name": "Ranjana Sawhny"}, "221": {"review": "", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Minkuk kim"}, "222": {"review": "", "time": "a week ago", "rate": "Rated 3.0 out of 5,", "name": "Ming Cheung"}, "223": {"review": "", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "소형석"}, "224": {"review": "", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Max Wolf"}, "225": {"review": "", "time": "5 months ago", "rate": "Rated 3.0 out of 5,", "name": "MINJONG KIM"}, "226": {"review": "", "time": "9 months ago", "rate": "Rated 4.0 out of 5,", "name": "The Scene Mill"}, "227": {"review": "", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Lakshman Singh"}, "228": {"review": "", "time": "11 months ago", "rate": "Rated 4.0 out of 5,", "name": "Scott Shaw"}, "229": {"review": "", "time": "a year ago", "rate": "Rated 2.0 out of 5,", "name": "Kei Kei"}, "230": {"review": "", "time": "7 months ago", "rate": "Rated 4.0 out of 5,", "name": "Di Hong"}, "231": {"review": "", "time": "3 months ago", "rate": "Rated 3.0 out of 5,", "name": "Henry Tseng"}, "232": {"review": "", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Yueui Christina Kim"}, "233": {"review": "", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Tae Won Lim"}, "234": {"review": "", "time": "2 weeks ago", "rate": "Rated 4.0 out of 5,", "name": "Luna Shin"}}