{"1": {"review": "One of the consistent options in Hell's Kitchen. The appetizers are delicious. I've tried the chicken satay and the calamari salad. Great flavors and fresh ingredients. At first, it does seem slightly pricey for the portion, but the quality is definitely there.\n\nI tried the Pad Thai for the main, which was tasty and a good-sized portion, but it was on the sweeter side (it didn't bother me, but just comparatively to other Thai restaurants). \n\nWe also had the pumpkin sticky rice which is delicious. I still prefer mango, but this one felt less sweet and more custard-y. \n\nI've eaten in once and the place gets packed during lunch time, but the delivery is efficient as well.", "time": "a week ago", "rate": "Rated 5.0 out of 5,", "name": "Rebecca Lian"}, "2": {"review": "Small restaurant but with very delicious food. The atmosphere is great. The customer service is on point. I didn't try a lot of different meals so I will be back. Thanks to Teddy's guide for recommending me this lovely restaurant.", "time": "a week ago", "rate": "Rated 5.0 out of 5,", "name": "Peter Stones"}, "3": {"review": "Our group (6 people) unanimously decided on this restaurant seeing the great reviews. We had a mixed experience. Pad Thai (both chicken and shrimp) and bowls were very good. Thai ice tea was delicious. Vegetarian dishes were bland and dry.\nServers were very friendly and ambience was homely. Definitely worth visiting again.", "time": "a month ago", "rate": "Rated 4.0 out of 5,", "name": "Nishant Kumar"}, "4": {"review": "Amazing! One of the highlights of our NYC visit. I heard the pork and crab dry noodles were their specialty and it didn't disappoint. My wife is vegan and loved the vegetable steamed dumplings. She also ordered the pad woo sen and enjoyed it as well. The place was clean and the service was excellent. Prices were reasonable ($40 for 2 noodle dishes and appetizer) and good portion sizes. There was a 45 minute wait at 9 pm on a Monday, but totally worth it!", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Brian Fox"}, "5": {"review": "I visit this lovely place  a lot! This is my favorite spot to to have a good dinner.  I visit this place at least once a month. The cooking is great, the crew is friendly and the price is reasonable. I enjoy being in this place for a good supper.", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Abram Avery"}, "6": {"review": "I love this small cozy Thai restaurant. It was the first time to eat Thai food, so I asked recommendation to the waitress. She nicely helped us with smile, showing food photos to understand me! The dried noodle with hot soup was really authentic. I love its vibe either. You should stop and try the tasty Thai food :)", "time": "2 months ago", "rate": "Rated 5.0 out of 5,", "name": "Jimin Park"}, "7": {"review": "A gem among a million Thai restaurants in Hell’s Kitchen. It is probably one of the pricier/priciest Thai restaurants in the area but also one of the best. You can’t go wrong with any of the dishes on the menu as they are all good from my experience. \n\nThere are almost always a line except for maybe before lunch rush on the weekdays. Plates are relatively small but quality is top notch. The egg noodles with the pork and crab is phenomenal. Adding pork rind to almost anything you order will add a good crunch and extra delicious kick to any dish.", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Canh Tran"}, "8": {"review": "Authentic, delicious dishes only equalled by the seamless service. Great looking place and noise level conducive for chatting (although your nearby neighbors may here!) Loved my meal here.", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Anthony J. Avallone"}, "9": {"review": "So good! This was one of the best restaurants we went to while in NYC. Our group tried a variety of appetizers, drinks, and entrees. Everything was excellent. The chicken curry puffs were my favorite of the appetizers. The Thai coffee is great, and I had the Pad Kee Mao (Drunken Noodle) which was spicy and delicious. Definitely would go back.", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Blakely Johnson"}, "10": {"review": "Amazing! Food was so fresh and delicious. Staff were lovely and friendly. Would definitely go again", "time": "a week ago", "rate": "Rated 5.0 out of 5,", "name": "Fleur De Lune"}, "11": {"review": "One of the best Thai food in the city! Great food, real authentic Thai master cooked. Speedy response, affordable price. Waitress were very nice. I love the spicy fried rice and the meat soup.", "time": "2 months ago", "rate": "Rated 5.0 out of 5,", "name": "Vivian Fung"}, "12": {"review": "This place is an authentic Thai restaurant. The venue is pretty small and cute. We didn't have to make reservations and where seated right away. I ordered their infamous ratchaburi crab & pork dry noodles and it definitely lived up to expectations.It's expensive here, and even with smaller portion sizes, you're still paying a lot for what you get. Lots of meat dishes for the meat folk. The staff is excellent as well! I highly recommend this place.", "time": "a month ago", "rate": "Rated 4.0 out of 5,", "name": "Romeo Santos"}, "13": {"review": "AMAZING. Small seating area so we had to wait about fifteen minutes (not bad!) but excellent service; fastest I have ever witnessed! Within less than ten minutes of ordering, everyone in my party of four had their entrees. Food was very flavorful, and portion sizes were absolutely perfect. Food was very well priced for the portion.", "time": "3 months ago", "rate": "Rated 5.0 out of 5,", "name": "Jacquelyn Chase"}, "14": {"review": "We visited on 9/10/19 and our experience was great.  We waited for about 20 minutes for a table.    The food was great and the staff was great.  They went out of their way to talk to our 3 year old.", "time": "a week ago", "rate": "Rated 5.0 out of 5,", "name": "Bennie Crowder"}, "15": {"review": "The absolute best Thai in the city for it's price point! Expect to wait for a table pretty much any time you go, but it's definitely worth it. Service is quick and efficient, but entirely impersonal, but it doesn't matter. It's that good!", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "A Thomas"}, "16": {"review": "Small intimate space with Thai music playing creates a fun atmosphere. I don't typically like small spaces, but was perfectly comfortable. Pad Thai was cooked nicely with delicious flavors. Reasonably priced.", "time": "3 months ago", "rate": "Rated 4.0 out of 5,", "name": "Jonathan Olsen"}, "17": {"review": "Whenever I'm in town, this is my go to for Asian cravings. It's simply one of the best Thai food I've had. It might even be better then what Thailand has to offer. \n\nIf you're in the area I would recommend checking it out , but do reserve your tables as it's usually packed with people.\n\nOrder anything. They hardly mess up. :)", "time": "3 months ago", "rate": "Rated 5.0 out of 5,", "name": "Toy Lim"}, "18": {"review": "A-m-a-z-i-n-g!\nAuthentic atmosphere, super friendly and nice staff and even customers! \nYou feel like you came to another world, where’s everyone super friendly and relax.\nFood options make you want to come back again, because it’s hard to chose, you want to try everything.\nPlum sake is delish and must try.\n$8 glass of sake ($36 bottle)\n$9 wine\n$4.50-5 beer\n$9-$12 meal\nThey have 3 levels of spice: medium, mild & hot\nWe had \n- Wok Basil with Chicken (mild) - super tasty and spicy but not to the crying point;\n- Pad Thai with Shrimp (mild) - wasn’t spicy at all, would order hot next time.\n- Vegetable dumplings with spinach inside is delicious (4pcs appetizer)", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Ekaterina Spiridonova"}, "19": {"review": "Great Thai, small selection, got there about 9.45pm, short wait as packed, but worth waiting for.  Only comment is spicy could be a bit spicier, but there is chilli you can add.", "time": "5 days ago", "rate": "Rated 5.0 out of 5,", "name": "Robert Brouwer"}, "20": {"review": "The beef pad see ew was good!  The wait wasn't nearly 20 min like they estimated (it was much shorter).  However, they did rush us out towards the end...", "time": "5 days ago", "rate": "Rated 4.0 out of 5,", "name": "Vivian Lu"}, "21": {"review": "The wait for this place is really long! The place is tiny and it's really cramped; typical Manhattan but not very comfortable. Anyway, I got the Thai iced tea and the roast pork and crab homemade egg noodle. The Thai iced tea was a tad too sweet for me but it was creamy and had pretty good Thai tea flavor. The noodles had really good flavors too. The noodles were perfectly chewy and the pork was really tender. Everything was flavorful too, including the noodles, the roast pork, and the sauce in general. Portions are average, not too big. Prices are high though; my noodles were $16 pre-tax. Service was alright, nothing too out of the ordinary.", "time": "4 months ago", "rate": "Rated 4.0 out of 5,", "name": "Andrea Wu"}, "22": {"review": "Not so cheap, in my opinion as a thai food lover food is a little bit commercial and not authentic, maybe cause is in Manhattan but i think u can find definitely a better and authentic Thai restaurant in NYC.\nWaited one hour for nothing..", "time": "a day ago", "rate": "Rated 3.0 out of 5,", "name": "Jacopo Lofyo"}, "23": {"review": "When we arrived there was quite a line, but we had to try this place out.  It was worth the wait!  The place is pretty small, but the atmosphere was fun and inviting.  We ended up sitting at the large round table in front and sharing with another couple, which was totally fine.  The curry puffs were perfectly crisp and had an amazing potato filling.  The pad se ew and dry noodles were so spectacular.  All the food was fresh and piping hot!  All was topped off with some cold sake.  Great place--we can't wait to come back!", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Karl Lindsay"}, "24": {"review": "I had the shrimp stir fry and it was perfect. Seasoning, taste. Just very crowded.", "time": "6 days ago", "rate": "Rated 5.0 out of 5,", "name": "Paulina Ryabko"}, "25": {"review": "Delicious thai cuisine at reasonable prices for NY standards. Fast, friendly service and the staff were great at recommending dishes. The food had unique, interesting flavors. My personal favourite was the baby back ribs!  The restaurant also has a cozy ambience and is situated in a good location. Definitely worth a visit!", "time": "5 months ago", "rate": "Rated 5.0 out of 5,", "name": "Raja Johnpulle"}, "26": {"review": "Awesome Thai food. We tried two curry dishes, basal and pad Thai tofu and all were really really tasty. Seasoning is perfect although next time we will most likely try a spicier curry but still extremely well prepared and the pineapple pineapple pen fried rice is a must also.", "time": "3 months ago", "rate": "Rated 4.0 out of 5,", "name": "Fayenan Pratt"}, "27": {"review": "Very authentic Thai place. Probably the best in Hell’s Kitchen. Love Thai basil chicken, pad see ew, sukhotai pork, calamari salad and so much more!", "time": "2 weeks ago", "rate": "Rated 5.0 out of 5,", "name": "Daniyar"}, "28": {"review": "Small, cozy, and decently prized. I'm usually not a fan of dry noodles but this was the place that convinced it could still be delicious. Like coming here every so often.", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Elizabeth Sun"}, "29": {"review": "The environment here feels very homey. It made me feel relaxed and at home. The smells of the restaurant will starve you while you wait for your food.\n\nThey could definitely change the waiting area because its right beneath the coat hangers.\n\nThe food here is well priced. None of it comes too spicy. Instead you can over spice it yourself! Wouldn't recommend going with a large party. Groups of 4 would do well but any larger and the wait will be long.", "time": "6 months ago", "rate": "Rated 5.0 out of 5,", "name": "William Guo"}, "30": {"review": "Great food! Long wait but always worth it.", "time": "2 weeks ago", "rate": "Rated 5.0 out of 5,", "name": "Thitawan Tong Chaiwong"}, "31": {"review": "I eat a lot of Thai food, and this place is without a doubt the best Thai restaurant I've been to in Manhattan, and I've been to quite a few. It's a hole in the wall but the interior is actually quite lovely, with rustic decor, and smells that delight even before you taste the food.", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Mark Philip Lichtenstein"}, "32": {"review": "I eat here fairly often. The service is excellent and the food is delicious. The chicken satay appetizer is very good. I recommend trying the curries, my personal favorite is the green curry, level 7. I have tried a few of the other dishes (pad Thai, etc) but they didn't dazzle, not bad just average. If you are looking for curry though this is the first place I would recommend.", "time": "6 months ago", "rate": "Rated 3.0 out of 5,", "name": "Angela Ross"}, "33": {"review": "Excellent food. Pure Thai is a very small place with limited seating; be prepared to wait. There have been numerous times I would instead, order for takeout and schlep back to my place in Gramercy Park. It's a distance, but I always play mind games with myself, telling myself I've already burned the calories I'm about to consume. The chicken curry puffs are so good! Even though I always tell them not to include the cucumber salad (I hate vinegar stuff), they always add it...oh well...the curry puffs are so good...I usually toss the cucumber stuff in the trash on my way home...don't want it leaking. The spicy basil chicken is probably my favorite entree. The chicken satay is delicious! I've always experienced good service the times I've dined-in and ordered take-out.", "time": "3 months ago", "rate": "Rated 5.0 out of 5,", "name": "Steve C 032"}, "34": {"review": "Very nice thai restaurant. Careful with the spices it can be very hit even for one or 2 stars.", "time": "a week ago", "rate": "Rated 5.0 out of 5,", "name": "Mark Maizonnasse"}, "35": {"review": "Great place for Thai in NYC!  It’s small, but between how fast they serve, how good the food is, and how well they turn the tables - stay! Wait in line!  Grab a Singha and read the menu.  You’ll regret walking out and getting one of the other Thai joints down the street.", "time": "2 months ago", "rate": "Rated 5.0 out of 5,", "name": "Brian C"}, "36": {"review": "Great place !\nDelicious food with fresh ingredients that you can see at the entrance. \nPad Thai Tofu is a perfect choice for vegetarians.", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "David Fernando Guajardo"}, "37": {"review": "This place was a on the whim decision. The food was very tasty and the servers were super nice. Will come back again when I am in town.", "time": "a month ago", "rate": "Rated 4.0 out of 5,", "name": "Dylan Fraser"}, "38": {"review": "On a rainy Saturday afternoon, we were wanting something warm and spicy and this place delivered.  \nWhile there are limited vegetarian options,  our server was able to suggest really good options.  The menu is simple and well marked in terms of what options there are for vegans.  \nI had the spicy noodles with tofu and vegetables and they delivered.  The flavors were amazing. \nService is spectacular, the decor is authentic and the dining experience was very pleasurable. \nI would happily dine here again.", "time": "7 months ago", "rate": "Rated 5.0 out of 5,", "name": "N Maharaj"}, "39": {"review": "Fantastic flavors in a small space\n\nPros: Every dish is delish, delivery is great\n\nCons: Space is tight", "time": "a week ago", "rate": "Rated 5.0 out of 5,", "name": "Josh S"}, "40": {"review": "Lovely atmosphere, and friendly service. I found our starters (satay and chicken curry puffs) to be more flavoursome than the main course of wok ginger curry with calamari - the sauce was a bit bland and had no heat or much aromatic stuff going on. However, it was still tasty and all the ingredients were succulent and fresh.", "time": "4 months ago", "rate": "Rated 4.0 out of 5,", "name": "Steve Jones"}, "41": {"review": "Was looking for good quality food and not a tourist trap and I definitely found it! It felt a bit like a tiny restaurant/hole in the wall and it made the vibe ever better. Prompt service, food came pretty fast, and was totally delicious! It felt so tasty and authentic! The food also wasn’t oily which is always my biggest concern for noodles and stir fry. I highly recommend! My whole group just loved all the tastes and smells!", "time": "6 months ago", "rate": "Rated 5.0 out of 5,", "name": "Hiba Al-Bahrani"}, "42": {"review": "Outstanding, some of the best Thai we've had in the city. Husband loved the crispy crab!", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Zoe Samuel"}, "43": {"review": "Great lunch meal I had pad Thai and my wife had a curry dish. Both were tasty (not the best we have had but very good) great small location with friendly staff.", "time": "a month ago", "rate": "Rated 4.0 out of 5,", "name": "Matt Taylor"}, "44": {"review": "This should be the best Thai restaurant in the US. I am a kind of person who orders a favorate food over and over again, but here I really want to try everything on the menu. Authentic with good amount of spices and more importantly no funny twist. Can't wait til my next trip to NYC.", "time": "4 months ago", "rate": "Rated 5.0 out of 5,", "name": "Kenneth Park"}, "45": {"review": "Excellent Jungle Curry!\n\nI visited here a few years ago and then came back yesterday for lunch with my wife since we were back in town. I have a gluten allergy so the waiter pointed out the Pad Thai, Jungle Curry, and a couple of other options.  It wasn't an extensive selection of gluten-free options but enough. I wasn't excited about any of them really but went with the Jungle Curry and it was Excellent. It was a large portion and I was sad when it was gone. \n\nMy wife went with the Turmeric Chicken and was very pleased with it as well. Both dishes had the perfect amount of spice for us (spicy but edible) and the service was great. The only drawback of the place is it's super small so we felt a bit cramped but I'd go back anytime I was in the area and wanting Thai without hesitation.", "time": "7 months ago", "rate": "Rated 5.0 out of 5,", "name": "Dustin Sutton"}, "46": {"review": "I was in New York for a week and was looking for a great Vietnamese shop. This pho place fit the bill! It was efficient, delicious and had great service. We ordered several entrees which tasted authentic and were appropriately priced. I would certainly come back here in the future!", "time": "4 months ago", "rate": "Rated 3.0 out of 5,", "name": "Carlos Palmer"}, "47": {"review": "Great place to get Thai food, but be prepared to wait due to its small area. They have an online waiting list, so you can leave and come back when it's nearly done. The food itself was pretty good, and the spice level is not as bad as how they made it seem. While dining, the restaurant plays classic 80s style Thai music for a more \"authentic\" experience.", "time": "6 months ago", "rate": "Rated 5.0 out of 5,", "name": "Henry Kim"}, "48": {"review": "really yummy thai place! the pad see yew has a very unique flavor. it’s sweet and savory at the same time. great portion sizes. we went on a friday at 6pm and got a table in about 20 minutes (were told the wait would be 30). unfortunately the crab fried rice was a little bland so had to add chili sauce—still VERY yummy and good quality. just as not flavor popping as the pad see yew. ambiance is fun. quite loud and cramped, and only stools, but it’s hoppin’.", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Autumn P"}, "49": {"review": "Very delicious, authentic Thai flavours. Good balance of the four key flavours.. sweet salty sour spice. But their noodle dishes have the punchier flavour!! Definitely check this spot out. AMAZING baby back ribs appy.", "time": "5 months ago", "rate": "Rated 5.0 out of 5,", "name": "Ryan Resmer"}, "50": {"review": "Consistency is key... after multiple visits, I've only ever had 5/5 wonderful customer service to report.  Thank you, Pho Basil, for offering such a reliable, delicious,r and warm respite from Boston weather.", "time": "4 months ago", "rate": "Rated 4.0 out of 5,", "name": "Lois Patterson"}, "51": {"review": "Great Thai spot. Our drinks were delicious! Will be coming back!", "time": "a month ago", "rate": "Rated 4.0 out of 5,", "name": "kate dubitski"}, "52": {"review": "Excellent food and service. I felt like I was in Thailand again.", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "MS RS"}, "53": {"review": "Very good Thai food, I get the feeling it's hard to find Thai food in NYC and it isn't as popular as it is in Australia. But this small restaurant does a good job of it, very clean and very authentic Thai", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Simone Famularo"}, "54": {"review": "I'm giving 2 starts for the hospitality! But the food was tasteless! I was expecting it to be the best but unfortunately it wasn't good at all! Food was really terrible!", "time": "a month ago", "rate": "Rated 2.0 out of 5,", "name": "Gayathri Sriram"}, "55": {"review": "Delicious food, and very accommodating even though they were very busy. Great restaurant!", "time": "2 months ago", "rate": "Rated 5.0 out of 5,", "name": "Temple Duke"}, "56": {"review": "Lovely delicious food, rustic cozy environment with friendly staff", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Akshay Patel"}, "57": {"review": "Compare to all other Thai restaurants with lower stars around this area, Pure Thai is overrated and overpriced. We had Paa Kee Mao and curry fried rice, both of them were mediocre.", "time": "6 days ago", "rate": "Rated 2.0 out of 5,", "name": "Innuan Org"}, "58": {"review": "It’s a small place but serves delicious foods.", "time": "a week ago", "rate": "Rated 5.0 out of 5,", "name": "saki yamamuro"}, "59": {"review": "Oh man the roast pork and crab noodles are to die for. Found this place while looking for lunch (thanks google reviews! /shameless plug) and I ordered the Thai roast pork and crab noodles mainly from the pictures on their google review page. It did not disappoint. Great texture to the noodles and the sauce was a light tangy sweet sauce that Thailand is known for. On top of that we had the green papaya salad and the pad Thai which were all delish, but for me the star was the roast pork and crab noodles. So good I had to go back the next day!", "time": "7 months ago", "rate": "Rated 5.0 out of 5,", "name": "Sheldon Tay"}, "60": {"review": "Food is great, wait can be long, service is alright", "time": "a week ago", "rate": "Rated 3.0 out of 5,", "name": "Kate Xin"}, "61": {"review": "Espectacular!!! Very little space at 9th , between 51-52th, 1 hour waiting, it worth it, Pad Thai, noodles with pork and crab, excelente The price acurate I want to come back soon", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Karen Peer"}, "62": {"review": "Closest thing to Thailand on this side of world. The dry noodles with pork had generous piece of fresh crab. The fried chicken wings were nice and crisp with a side of sweet chilli sauce. The only thing I wasn't too crazy about were the ribs. It wasn't bad at all, but the flavor got tiring after eating so many of them. Over all this place is authentic and delicious. Would definitely come back.", "time": "5 months ago", "rate": "Rated 5.0 out of 5,", "name": "sunny kim"}, "63": {"review": "Best pad see ew I've had in NYC. Also, spring rolls are the perfect texture.", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Erika Finnimore"}, "64": {"review": "Great Thai food, fresh vegetables, lots of flavor. It's a small place with lots of tables. They move quickly so wait for a table if they are full. Our dinner was at our table in less than five minutes.", "time": "4 months ago", "rate": "Rated 4.0 out of 5,", "name": "Jennifer Barrett"}, "65": {"review": "So easy to miss from the sidewalk. But glad I finally found it. Very tasty noodles. Quick service. But not alot of space.", "time": "3 months ago", "rate": "Rated 4.0 out of 5,", "name": "Lisa Schnettler"}, "66": {"review": "I got the Chicken Pad Thai and it was out of this world. I wasn’t impressed with the chicken wings. Great portion size and very reasonable prices!", "time": "4 months ago", "rate": "Rated 5.0 out of 5,", "name": "Brandi Garbutt"}, "67": {"review": "I ordered lunch takeout with the pork and crab ratchaburi Dry noodles, pad Thai with chicken and Thai iced tea. The dishes seemed alittle disappointing and wished the dry noodles had more sauce. The pad Thai was basic. Also, the Thai iced tea seemed too sweet. Maybe sit-down meals are better there...sadly they had no lunch special prices/deals.", "time": "3 months ago", "rate": "Rated 3.0 out of 5,", "name": "Jennifer Lee"}, "68": {"review": "Small and busy place but worth a 20 minute wait. The food is delicious!!", "time": "2 months ago", "rate": "Rated 5.0 out of 5,", "name": "Emily S"}, "69": {"review": "It was my first time trying thai food! The server recommended very good foods. She was very friendly ! I enjoyed all of them! Its kinda high price range but I highly recommended this place.", "time": "6 months ago", "rate": "Rated 5.0 out of 5,", "name": "lisa kim"}, "70": {"review": "Had a craving for thai food so checked out this spot on Geary.  Customer service was excellent! The soup was perfect during this rainy San Francisco weather.  Their pad thai is also delicious!  Highly recommend this place!!  Definitely want to try their brunch!", "time": "3 months ago", "rate": "Rated 4.0 out of 5,", "name": "Toby Patterson"}, "71": {"review": "Absolutely loved the quality of the food, we ordered the wings, dumplings, pad see ew with beef, and duck noodle soup. Simply delicious, each appetizer is about $10 and each entree is about $15. Cozy/tight seating. We would definitely go back.", "time": "6 months ago", "rate": "Rated 5.0 out of 5,", "name": "Marie Rosario"}, "72": {"review": "This place had amazing food. I came here for a quick meeting that turned into a long lunch with a great friend of mine and we had a blast. Super authentic food super authentic location in typical New York city type of dining with international cuisine.\n\nDefinitely would recommend definitely would say park around the corner because this place is worth it\n\nMake sure to try out a few different dishes and the chicken wings, they were fantastic and in excellent excellent excellent appetizer\n\nThey were quick to seat us quick to serve and we had an excellent time. Thank you very much", "time": "9 months ago", "rate": "Rated 5.0 out of 5,", "name": "Matt Ortolani"}, "73": {"review": "Great food and great atmosphere", "time": "2 weeks ago", "rate": "Rated 5.0 out of 5,", "name": "John Lewins"}, "74": {"review": "A great secret, little hole in the wall. Perfect sized portions and fast service.", "time": "a month ago", "rate": "Rated 4.0 out of 5,", "name": "Melissa Taylor"}, "75": {"review": "I’ve been to Pure Thai Cookhouse a few times now and every experience has been exceptional.  The ambiance is cozy and cool, the food is absolutely incredible, and the service is lightning fast.  It’s a tiny space, so there’s generally a bit of a wait for a table, but it’s completely worth it.", "time": "7 months ago", "rate": "Rated 5.0 out of 5,", "name": "Shaina Higgins"}, "76": {"review": "I went to Thai cookhouse with 2 friends for lunch and we enjoyed our food even though it wasn’t so tasty. The menu doesn’t offer a large variety of dishes (they don’t have masaman nor any curry dishes).\nThe place is cool and cozy and the staff is nice.\n\nI’d like to try more dishes to have a better idea!", "time": "8 months ago", "rate": "Rated 4.0 out of 5,", "name": "Kiara Di Paola"}, "77": {"review": "Very good food. Nice atmosphere.", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Byron harrel"}, "78": {"review": "So my girlfriend and I went to see a show. We were in the theater area, so we were searching for a good spot to eat before the show. Neither one of us goes to many plays, so we were completely unaware of our options. Somebody on the street actually recommended this Pure Thai Cookhouse to us, and we didn't regret it. I've always been greeted fast and in a friendly way when I go to Thai restaurants, and this place was no exception. We got to a table pretty fast, and ordered within a few minutes. I had the best vegetable dumplings I have ever tried. They were so well-cooked, with a little crisp on the outside, and gooey on the inside. My girlfriend had some sticky rice and noodles, and was impressed with the quality of the grain and rice that they used. All in all, the meal cost us about 30 dollars for two diners, and we were full for our night in the theater. The waitstaff was really quick and efficient, and that stands out in my mind when I think back to my experience there. They were very fast and organized, but not in a way that felt pushy. I wholeheartedly recommend Pure Thai Cookhouse if you are going to a show or if you are just in the Hell's Kitchen neighborhood.", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Matthew Hudson"}, "79": {"review": "So in love with the pad see ew at the spot. The best I ever had. Their that boat is good too with tons of flavor.", "time": "5 months ago", "rate": "Rated 4.0 out of 5,", "name": "Amanda Cox"}, "80": {"review": "Great service and atmosphere and the food was definitely tasty. I like how there are loads of pescatarian options. It will get crowded at the place so definitely recommend that you make a reservation prior to heading there .", "time": "5 months ago", "rate": "Rated 4.0 out of 5,", "name": "Xiao-fang Ruan"}, "81": {"review": "That's good experience. Be care.... spicy.", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Frédéric Laurent"}, "82": {"review": "Very small restaurant that can get crowded but worth it for the fun atmosphere and good food. Pad Thai tasted really sweet, I loved it", "time": "3 months ago", "rate": "Rated 5.0 out of 5,", "name": "Katie Carl"}, "83": {"review": "This is definitely one of the best Thai restaurants in the neighbourhood.", "time": "3 weeks ago", "rate": "Rated 5.0 out of 5,", "name": "Uzair Haq"}, "84": {"review": "One of the best Thai restaurants in the city. If you love Thai food and noodles, this is a must. My husband is so in love with one of the noodle dishes, he just ordered two portions of it. It’s that good. A must try if you are in the neighborhood.\n\nThe only downside is that this is no longer a hidden gem so the wait can be very long...I think it’s time for an expansion Thai Pure Cookhouse!", "time": "10 months ago", "rate": "Rated 5.0 out of 5,", "name": "Tran Nguyen Duc"}, "85": {"review": "Just two blocks from the theatre district - this little Thai restaurant is great.", "time": "2 months ago", "rate": "Rated 5.0 out of 5,", "name": "Kate Ensell"}, "86": {"review": "Pretty good, just the pad Thai was tasty and the chicken curry puffs were good. Would have given it higher if the Thai ice tea was more. Honestly $4 and it was almost literally half ice. You guys should have given more ice tea, this just feels like a rip off.", "time": "6 months ago", "rate": "Rated 3.0 out of 5,", "name": "Tom Lu"}, "87": {"review": "Best Thai Restaurant! Taste so much like foods in Bangkok. I love their stir-fry flavor and spices and my friend loves their soup noodles esp flat noodles,  so silky !", "time": "6 months ago", "rate": "Rated 5.0 out of 5,", "name": "Kate wu"}, "88": {"review": "Food is excellent. The service very friendly and there is a good atmosphere. I don't give 5 stars  only because of the....chairs!", "time": "7 months ago", "rate": "Rated 4.0 out of 5,", "name": "Flavia M."}, "89": {"review": "Delicious tipycal food! Totally recommended.", "time": "2 months ago", "rate": "Rated 5.0 out of 5,", "name": "Andreas Bergold"}, "90": {"review": "It is really good! My boyfriend never eats vegetable! It’s been such a headache for me! But, he ate the jungle curry fried rice, and gladly ate all of the vegetables in the plate( except the super spicy chili pepper and the lime), even the cucumbers! Thank you pure Thai cookhouse!", "time": "7 months ago", "rate": "Rated 5.0 out of 5,", "name": "Leah Cheng"}, "91": {"review": "This place is a must if you ever find yourself in Hells Kitchen.  I had the Moa with squid and it was  delicious!", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Gary Atkins"}, "92": {"review": "big food, cant have a once lol", "time": "3 weeks ago", "rate": "Rated 4.0 out of 5,", "name": "냥KW"}, "93": {"review": "Small place with very nice food moderate prices,  5 vegan items on the menu", "time": "4 months ago", "rate": "Rated 5.0 out of 5,", "name": "Upmanu Lall"}, "94": {"review": "Small friendly cosy atmosphere.  The food is to die for. Very tasty and delicious.", "time": "4 months ago", "rate": "Rated 5.0 out of 5,", "name": "Marjorie Bibbons"}, "95": {"review": "The best Thai food you will find outside Thailand. Everything on the menu is delicious and the service is awesome.", "time": "4 months ago", "rate": "Rated 5.0 out of 5,", "name": "Jake S"}, "96": {"review": "Very good Thai restaurant! Try the Thai iced tea, with condensed milk. I also particularly enjoyed the wok curry calamari.", "time": "5 months ago", "rate": "Rated 5.0 out of 5,", "name": "Alejandra Estanislao"}, "97": {"review": "Hands down the best and most authentic Thai food I have had since Thailand. Wow wow wow. The ramen is more of a Thai soup than a ramen, because you basically pick a curry base. I had the panang curry and it was one of the best I've ever had. Great for vegetarians and vegans.", "time": "4 months ago", "rate": "Rated 4.0 out of 5,", "name": "William Hall"}, "98": {"review": "Stellar food all around. Long wait both times I've tried to come here, so recommend planning for between 30-45 minute wait.\n\nGreat items:\n- Wok Curry paste (substituted chicken instead of pork)\n- Crispy tofu\n- Papaya salad with crab (amazing raw crab)\n- Chicken Satay with peanut sauce\n- Thai iced tea & coffee", "time": "8 months ago", "rate": "Rated 5.0 out of 5,", "name": "Robert Fertig"}, "99": {"review": "Great Thai spot in Hell’s Kitchen with many unique dishes not found in typical Thai restaurant menus. They have fantastic daily specials too. There’s almost always a wait because of their popularity. Many things are spicy but you can for most of them request a spicy level. However when we last went there, the dish that was level 3 (highest) spicy was milder than the one that we requested level 1 (mildest) and I couldn’t feel my mouth for a while after", "time": "11 months ago", "rate": "Rated 4.0 out of 5,", "name": "W Y"}, "100": {"review": "Delicious food, cosy vibe and attentive servers.", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Niv Pai"}, "101": {"review": "Have stopped in a few times over the years for lunch and never disappointed.  Everything on the menu is good, just pick the flavors to your taste.", "time": "6 months ago", "rate": "Rated 5.0 out of 5,", "name": "Devin Mell"}, "102": {"review": "Very tasty papaya salad!  Nice spice. Worth a stop if you’re in the neighbourhood.", "time": "5 months ago", "rate": "Rated 4.0 out of 5,", "name": "Andrew Millar"}, "103": {"review": "Awesome thai noodle quiet fast and very nice service! The only negative thing is the restaurant is small and tables are very close to each other, but if you are fine with it, it's absolutely a worthy.", "time": "5 months ago", "rate": "Rated 4.0 out of 5,", "name": "MI SEON Kim"}, "104": {"review": "Seemed totally authentic.  Very small restaurant with backless stools at most tables.  Crowded and loud.  The food however was excellent.", "time": "6 months ago", "rate": "Rated 4.0 out of 5,", "name": "Jeffrey Macklis"}, "105": {"review": "Got the steamed beef buns. They were decadent! Highly recommend appetizer for two.\nHad the pork and peanut dish, got medium done, and it was plenty spicy for my palette.\nFood is as good as the service.", "time": "8 months ago", "rate": "Rated 5.0 out of 5,", "name": "Brett Bernier"}, "106": {"review": "Really good Indian food......\n\nJust picked up a few random dishes for a work party and it was a hit!!!!!", "time": "3 months ago", "rate": "Rated 4.0 out of 5,", "name": "Virginia Nunez"}, "107": {"review": "Really enjoyed the Goi salad, the one with cabbage and other vegetables. We had it with tofu, which was super soft and crispy on the outside. I had the Khao Soi, the northern style curry noodle dish with fried chicken. Tremendous!", "time": "4 months ago", "rate": "Rated 4.0 out of 5,", "name": "Emilio Clarke"}, "108": {"review": "My favorite thai restaurant, maybe my favorite restaurant period. If you can handle the spice, the jungle curry fried rice is out of this world. \n\nNo matter what you order, the service is the fastest I've ever experienced outside fast casual. \n\nPure Thai gets 10/10 & 100/100", "time": "7 months ago", "rate": "Rated 5.0 out of 5,", "name": "Joseph Rubino"}, "109": {"review": "After all of these years, still the best.", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Joel Leventhal"}, "110": {"review": "Excellent food. The staff was very friendly and helpful! Setting and atmosphere are very nice too :)", "time": "7 months ago", "rate": "Rated 5.0 out of 5,", "name": "Loïc Nyffenegger"}, "111": {"review": "My friends and I were in the mood for Thai before our show. The staff were very friendly and efficient. I loved the music and the overall vibe of the place. I had pad Thai with shrimp because I was hesitant to eat very spicy food before my show, but it was the best I’ve ever had. We also split spring rolls which were very tasty. I’d recommend this place to anyone and would love to go back. This restaurant was unbelievable. The food was delicious, the service was friendly and quick and the prices were unbelievably good value! The seasonal soft shell crab was the best I’ve ever had. We then feasted on a variety of other appetisers which were equally good. For mains, I loved the pad Thai, but my friend had the roast pork and crab egg noodles and said they were fantastic. Would definitely recommend this for couples or families.", "time": "11 months ago", "rate": "Rated 5.0 out of 5,", "name": "Simon Vozovski"}, "112": {"review": "The best Thai food in New York, hands down! The spring rolls are delicious and their Thai Tea is perfect! However, The red curry is the best I've had from any where in there U.S...no lie!Great prices and awesome service!", "time": "8 months ago", "rate": "Rated 4.0 out of 5,", "name": "Penny Steele"}, "113": {"review": "Best Thai Beef salad I ever ate! Thank you for a nice meal on our last day in NYC", "time": "5 months ago", "rate": "Rated 5.0 out of 5,", "name": "zzizahacallar"}, "114": {"review": "Excellent food served by very nice and polite staff. We were a group of 4 and had a great time tasting each other's delicious plates.", "time": "5 months ago", "rate": "Rated 5.0 out of 5,", "name": "Massimo Strino"}, "115": {"review": "Delicious meal in a small place with great prices!", "time": "3 months ago", "rate": "Rated 5.0 out of 5,", "name": "George G. Ortiz-Mejias"}, "116": {"review": "Pure Thai has the best Thai food in all of Manhattan!!! Fair price (for New York) and they give you very generous portions! Highly recommend the Pad Thai (can't go wrong) or Pad Kee Moa!", "time": "5 months ago", "rate": "Rated 5.0 out of 5,", "name": "Donny Ta"}, "117": {"review": "I visited on Monday evening for dinner with another friend. There was a wait of 20 minutes. Inside is very small like a size of hallway, so it feels a bit squeezed and could be loud. They did have small waiting area at the entrance. \n.\nI had Ratchaburi Crab and Pork Dry Noodles. The pork tasted amazing and went along well with the crab meat. I think it had some fish sauce which gave light sweetness. \n.\nWe shared chicken curry puffs and crispy tofu. They were also good but chicken curry puffs were not as crispy as other places.", "time": "9 months ago", "rate": "Rated 5.0 out of 5,", "name": "Chan Woo Park"}, "118": {"review": "Love thus place, you have to be patien if you want to get a table for dinner but it is very worth it", "time": "5 months ago", "rate": "Rated 5.0 out of 5,", "name": "Norma Gallardo"}, "119": {"review": "Definitely one of the best thai food I've had in my life. The dishes are very tasty, and I would highly recommend taking a dessert as well. The staff is like, super nice.", "time": "7 months ago", "rate": "Rated 5.0 out of 5,", "name": "Colin Castori"}, "120": {"review": "Totally legit food. Full of flavor, authenticity, and energetic vibe.", "time": "3 months ago", "rate": "Rated 5.0 out of 5,", "name": "Jason Jeong"}, "121": {"review": "Pure Thai is awesome, authentic Thai food. The long wait times are the only bummer.", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Mark Seward"}, "122": {"review": "Small place but food was incredibly delicious, we would like to visit again n again", "time": "4 months ago", "rate": "Rated 5.0 out of 5,", "name": "Snehal Desavle"}, "123": {"review": "I had the fried chicken, pad see ew, and the coconut juice. Everything was amazing, the Thai food was authentic and delicious! The space is small and sometimes you have to share a table! Worth the trip and the wait!", "time": "8 months ago", "rate": "Rated 5.0 out of 5,", "name": "Paula Chau"}, "124": {"review": "Food is pretty good,the taste like I ate in Thailand. but service is just soso.not good.not bad,but they do things like you should go,bcs they are busy.", "time": "4 months ago", "rate": "Rated 3.0 out of 5,", "name": "纽约霹雳狗"}, "125": {"review": "I came here 4 times ordering different food. They surprised me every time, the food is super amazing. The service is excellent, and don't forget the thai tea!", "time": "7 months ago", "rate": "Rated 4.0 out of 5,", "name": "Monica Caron"}, "126": {"review": "Whenever I eat somewhere else I wonder why I didn't eat here. Krabi for the win.", "time": "4 months ago", "rate": "Rated 5.0 out of 5,", "name": "Aslan Crawley"}, "127": {"review": "We walked 2 miles only to discover this placed is closed by the health commission! July 19th.", "time": "2 months ago", "rate": "Rated 1.0 out of 5,", "name": "Chris Kirkwood"}, "128": {"review": "Excellent Thai food! The chicken pad kee mao was clearly a notch up from your typical Thai restaurant (also spicier).  The pork noodle soup though was incredible. The broth was savory with hints of sweetness and it just tasted so good. Also the waitress was super nice and friendly.", "time": "7 months ago", "rate": "Rated 5.0 out of 5,", "name": "Kelvin Niu"}, "129": {"review": "A great little find near the Hell's Kitchen area of NYC. The restaurant is quite small, I would recommend making reservations in advance. I only needed a table for 1 during my visit, so I was able to grab a seat at the bar. I ordered the pork buns and the pad thai. Both were quite delicious and were served in sizable portions. After finishing my meal, I ordered a Thai iced tea to go so I could enjoy it as I continued to tour the city.\n\nThis is definitely a great hidden gem and worth the stop if you're in the area.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Orielle M.G."}, "130": {"review": "Friendly, bustling...no wonder...Great food...the homemade noodles are 😋 delicious!", "time": "4 months ago", "rate": "Rated 5.0 out of 5,", "name": "mary fusco"}, "131": {"review": "I love my Thai the way I love my vodka.", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Joshua Paul Weckesser"}, "132": {"review": "Really mixed on this place as service was decent and ingredients were good quality. \n\nUnfortunately it's not authentic at all. I'm fine with \"American\" Thai food, but this place markets itself as authentic and very clearly states on the menu that the dishes are wok-cooked. They are not. Real stir fry requires large (100k+ btu) burners and the ingredients are seared very quickly giving that delicious seared on the outside, fresh on the inside flavour.\n\nThey don't have the burners and they don't use real woks. The result is pad thai, et al that is just not right.\n\nSo if you like American style Thai lacking any char, go for it. If you have want something remotely correct, go elsewhere.", "time": "5 months ago", "rate": "Rated 2.0 out of 5,", "name": "Brian R"}, "133": {"review": "Have ordered from them three times. It's always fast and fresh and delicious. I would recommend this to anyone who enjoys Thai food.", "time": "7 months ago", "rate": "Rated 4.0 out of 5,", "name": "Alma Garza"}, "134": {"review": "This is a small Thai Restaurant. We had to wait for 20 min. For a table but it was worth. We had the steamed beef dumplings, Fried Tofu and the Pad... Ew ;) it was delicious. If we ever come back to New York we will go there again.", "time": "8 months ago", "rate": "Rated 5.0 out of 5,", "name": "Andreas Wagner"}, "135": {"review": "This tiny place is amazing. Oh I wish I had this where I lived, I'd go once a week at least.  Spring roles and pad Thai were fantastic, best I've ever had. Very convenient system of texting you when your table is ready", "time": "9 months ago", "rate": "Rated 5.0 out of 5,", "name": "Donna Huffstater"}, "136": {"review": "Yes yes yes the best Thai food that I've ever tried. It is amazing totally recommended. By the way I used Yelp to find this restaurant we had to wait like 40 minutes but it is worth it. Pad Thai and pork dry noodles were amazing!!!!", "time": "10 months ago", "rate": "Rated 5.0 out of 5,", "name": "Devon Jacinth"}, "137": {"review": "Very authentic! Beautiful flavors and excellent service and atmosphere. I will be going again but with more people! Get there early because they get pack right from opening.", "time": "8 months ago", "rate": "Rated 5.0 out of 5,", "name": "Nathaniel Nemdharie"}, "138": {"review": "Very small space, I missed it at first when I walked by. Pad Thai and vegetable spring rolls were excellent. This place fills up quick so be prepared to wait or settle for a seat at the “bar”", "time": "5 months ago", "rate": "Rated 5.0 out of 5,", "name": "Jessica Robinson"}, "139": {"review": "Good service,good food but too crowded, fast service.This the best restaurant for Thai noodle .I love Thai ice tea.", "time": "5 months ago", "rate": "Rated 5.0 out of 5,", "name": "narischa rattana"}, "140": {"review": "Awesome authentic food. Really enjoyed the food", "time": "4 months ago", "rate": "Rated 5.0 out of 5,", "name": "Gokul A"}, "141": {"review": "We couldn't remember our last visit but Pure Thai Cookhouse is still the best, and it's even better when it's been awhile cause it makes you appreciate them even more. it's one of the few times we wished we lived in NY.", "time": "8 months ago", "rate": "Rated 4.0 out of 5,", "name": "Joan Alsop"}, "142": {"review": "In know every review wants to start with \"authentic\" but this really is. \nGreat Jungle curry along with staples like Pad Thai. The Thai iced tea cools nicely and the desert rice is yummy.", "time": "5 months ago", "rate": "Rated 5.0 out of 5,", "name": "Stephen Harman"}, "143": {"review": "We waited about 45 minutes for a table because it’s a small, busy place. But it was beyond worth it. The spring rolls were amazing with the plum sauce, the curry puffs were yummy, and the pad Thai was out of this world. To top it all off, the Thai iced tea😍 I will be dragging my bf back here from CT very soon to go again.", "time": "6 months ago", "rate": "Rated 5.0 out of 5,", "name": "Brianna Love"}, "144": {"review": "The food is amazing. It's kinda small but the food comes out quickly.", "time": "7 months ago", "rate": "Rated 5.0 out of 5,", "name": "Andrew Reiff"}, "145": {"review": "LOVE Phad Thai. My wife and I eat here frequently.", "time": "4 months ago", "rate": "Rated 5.0 out of 5,", "name": "John Ferullo"}, "146": {"review": "Amazing food and gorgeous ambiance. We got the crab and pork noodles which was a very flavorful and aesthetic dish. Would definitely come back.", "time": "9 months ago", "rate": "Rated 5.0 out of 5,", "name": "Cindy C"}, "147": {"review": "The food is great and the service is fast. Will definitely come back here again", "time": "7 months ago", "rate": "Rated 5.0 out of 5,", "name": "Alex Menarini"}, "148": {"review": "This was my first visit to NYC and I am a real foodie. Visited this place after reading positive reviews. The staff is very welcoming and pleasant. We had ordered Chicken Pad Thai. Did not like it as it was too oily. I would rate the staff as 10/10. The food for the price would be 5/10. Wouldn’t recommend.", "time": "a year ago", "rate": "Rated 2.0 out of 5,", "name": "Abdul Kadar Bookwala"}, "149": {"review": "Tasty Thai food and great prices.  Very friendly staff in a restaurant with nice atmosphere.  \n\nStaff are Thai so the food is indeed authentic, at least with the ingredients available locally.", "time": "8 months ago", "rate": "Rated 5.0 out of 5,", "name": "Heiko Gehrig"}, "150": {"review": "Best Thai in Hell’s Kitchen is not the whole island of Manhattan! It’s amazing food! Go try it! Make sure to wait because this place is great.", "time": "9 months ago", "rate": "Rated 5.0 out of 5,", "name": "Jonathan Decker"}, "151": {"review": "Best Thai food I have ever tasted.  Great service too.  Ordered a take out because I could not wait 40mins for a table - my choice.  Food is fresh, perfectly seasoned and so tasty.", "time": "11 months ago", "rate": "Rated 5.0 out of 5,", "name": "ayotola jagun"}, "152": {"review": "Always good food!", "time": "3 days ago", "rate": "Rated 4.0 out of 5,", "name": "Sanghamitra Sahoo"}, "153": {"review": "Suuuuuuuch a good find!\nWe stumbled upon this place by accident while trying to find a dinner place before sering the Book of Mormon, and I was ecstatic to have found it.\nI am the biggedt fan of thai food, and I've been obsessed since I went there in 2017, so I can actually say this place remains true to it's origins! From the flavor, the presentation and the locale itself.\nDefinitely should go there if you're around! Just beware you mught have to wait awhile as it's usually pretty busy!", "time": "6 months ago", "rate": "Rated 5.0 out of 5,", "name": "Sabrina Scholkowski"}, "154": {"review": "A very solid Chicken Pad Thai for takeout. Would definitely come back and dive deeper into the menu.", "time": "7 months ago", "rate": "Rated 5.0 out of 5,", "name": "Marshall Shaffer"}, "155": {"review": "One of the most authentic Thai food around. They greet you with simple \"สวัสดีค่ะ\" which ganrantee you at the door that they're authentic. They serve many foods that are common in Thailand but for some reason many Thai restaurants in the U.S don't serve. If you want a real taste from Thailand, this one is the closest you'll get. The place is small and very quaint compared to other Thai restaurant. But the style of the place reminded me of a vintage noodle shop in Thailand. If you are going to Thailand soon, test your taste buds here.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "noname22541"}, "156": {"review": "Noodle soup is so so ....but the Roit curry is super good!!!!!!! The price is ok~~I will come again ,,,try another things ..", "time": "4 months ago", "rate": "Rated 3.0 out of 5,", "name": "Latoya Hamblin"}, "157": {"review": "First time here..fast and friendly service! I had the pad Thai/spicy noodle lunch special. Tasty!", "time": "8 months ago", "rate": "Rated 4.0 out of 5,", "name": "Mary Alexander"}, "158": {"review": "Great Thai food, with some unique dishes. I would recommend the duck noodle soup, it has some great flavors l hadn’t tasted before! I would love to come back.", "time": "11 months ago", "rate": "Rated 5.0 out of 5,", "name": "David Kanter"}, "159": {"review": "Loved the food here so much I went twice last week! 😋 Most autehtic and the best Thai in NYC! X", "time": "8 months ago", "rate": "Rated 5.0 out of 5,", "name": "Peter Elton"}, "160": {"review": "Wait was about an hour for 4, which we expected.  We heard great reviews & probably just had high expectations. We ordered spring rolls,  that were tasty, but I've had store bought spring that taste exactly the same. I ordered the Pad Thai & My husband ordered the vegetable stir fry plate (forgot the name). His tasted bland and my plate was really sweet. Our friends also didn't like their plates. At the end the waitress was hovering over us when it was time to tip... which just made it awkward.", "time": "11 months ago", "rate": "Rated 1.0 out of 5,", "name": "Silvana de Jesus"}, "161": {"review": "Simply excellent ambiance and food!", "time": "2 months ago", "rate": "Rated 5.0 out of 5,", "name": "Jesse Elliott"}, "162": {"review": "Didn't expect the experience to  lack clarity of ingredients, i wanted a dish served with tiger shrimp and had to settle for chicken. The host that seated us assured that a dish could be made. The restaurant was small and crowed, would suggest trying a different thai restaurant.", "time": "10 months ago", "rate": "Rated 1.0 out of 5,", "name": "eugene frazier"}, "163": {"review": "Great food. Recommend cinnamon beef kebab. I like tech so I dig the touchscreen menus they have. Dinner with one of the coolest dates.", "time": "10 months ago", "rate": "Rated 5.0 out of 5,", "name": "P Enock"}, "164": {"review": "Good ambient and efficient service.  Food is good and the portion is satisfying.", "time": "7 months ago", "rate": "Rated 5.0 out of 5,", "name": "B W"}, "165": {"review": "Authentic Thai and so diff from all those generic Thai restaurants that litter NYC. There's always a long wait so just come by yourself and eat at the counter or takeout.", "time": "7 months ago", "rate": "Rated 4.0 out of 5,", "name": "Heejin Kim"}, "166": {"review": "One of the best place in new York to have authentic Thai food", "time": "4 months ago", "rate": "Rated 5.0 out of 5,", "name": "Vishal Malapati"}, "167": {"review": "Excellent food and customer service!", "time": "5 months ago", "rate": "Rated 5.0 out of 5,", "name": "Chris Herring"}, "168": {"review": "Amazing food. Everyone is friendly. It's a quick turn around as it gets super busy. Since it's very small inside there isn't a lot of space for bigger parties.", "time": "9 months ago", "rate": "Rated 5.0 out of 5,", "name": "TheSuperSanchez"}, "169": {"review": "Cozy little restaurant  with great food and lots of flavor. They play Thai rock music! So fun!", "time": "8 months ago", "rate": "Rated 5.0 out of 5,", "name": "Amberly Lynn"}, "170": {"review": "The food was great. The pad thai was too sweet for my taste, but I guess that's how it is supposed to be, at least in the US. The service was good.", "time": "7 months ago", "rate": "Rated 5.0 out of 5,", "name": "Juan P. R."}, "171": {"review": "Authentic Thai food at good prices!", "time": "4 months ago", "rate": "Rated 5.0 out of 5,", "name": "Karolina Dróżdż"}, "172": {"review": "Stumbled across this gem after seeing a show.  They were still running a 45 minute wait at 9:30pm.  It was worth it.  Get the Steam Buns and Pad See Ew.  Going to be dreaming about this meal for weeks.  \n\nWord to the wise...The place is only about 10’ wide and you will share space with strangers.", "time": "11 months ago", "rate": "Rated 5.0 out of 5,", "name": "Julie Dodd"}, "173": {"review": "Fantastic authentic Thai food. I could not have been happier. I got tofu vermacelli and it was spicy and flavorful. Service is quick. It's crowded but the atmosphere is nice and it doesn't feel cramped.", "time": "11 months ago", "rate": "Rated 5.0 out of 5,", "name": "Max Max"}, "174": {"review": "The restaurant stayed true to authentic Thai flavours! It's definitely worth the long wait in the queue. Ba Mi Moo Daeng (noodles topped with crab and chinese 5 spice-roasted pork) is not to be missed.", "time": "8 months ago", "rate": "Rated 5.0 out of 5,", "name": "Waswate Ayana"}, "175": {"review": "Delicious Thai food in NY. Was full in few minutes after opening in morning.", "time": "3 months ago", "rate": "Rated 5.0 out of 5,", "name": "Mukul Gupta"}, "176": {"review": "I love Thai cuisine, it is one of my favorites. After flying round to Bangkok and Phuket on Thai Airways and eat Thai food for almost two weeks I become a fanatic of this delicious Asian food.", "time": "8 months ago", "rate": "Rated 5.0 out of 5,", "name": "Zulma Faiad"}, "177": {"review": "Quaint location and the service and food were exceptional. Spring roll appetizer (5), Pad Thai, green curry daily special  and 2 beers were only $53.   Outstanding value for the amount and quantity as we couldn’t eat it all.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Jeff Montgomery"}, "178": {"review": "Great food, excellent service, decent prices.\nDishes are not big but definitely enough.", "time": "8 months ago", "rate": "Rated 5.0 out of 5,", "name": "Elad Koren"}, "179": {"review": "Excellent, delicious food, good service. As we arrived, we were asked to wait until all the group arrive too (which is understandable), however, when you we asked to sit and one of the our friendly join 20 minutes later, they told us that it's impossible, even if we are ordering for him (to save time). That cause us to choose between our table to our friend (that was already on his way). We didn't like this policy of them. That gives us bitter start.", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "Sapir Elmaliah"}, "180": {"review": "Great food ... Small space and a bit of a wait... But good service and great Thai food", "time": "9 months ago", "rate": "Rated 3.0 out of 5,", "name": "Michael Ragone"}, "181": {"review": "Awesome thai food. Can't go wrong with any dish. Made a wrong choice by saying we want spicy food. Oh the food was tasty but it was spicy. Medium hot should be preferred. Never knew thai peppers can be so tasty and hot.", "time": "11 months ago", "rate": "Rated 4.0 out of 5,", "name": "Donette Hayes"}, "182": {"review": "Good food and service", "time": "4 months ago", "rate": "Rated 5.0 out of 5,", "name": "Doug Washburn"}, "183": {"review": "Wowza, this place was phenomenal. Had some delicious chili pepper chicken. Service was prompt and everyone treated us lovely. Not sure what the other recent reviewer did do to receive the service they did, but I loved this place. We had a great experience here. Absolutely recommended.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Ryan M."}, "184": {"review": "Yes yes yes the best Thai food that I've ever tried. It is amazing totally recommended. By the way I used Yelp to find this restaurant we had to wait like 40 minutes but it is worth it. Pad Thai and pork dry noodles were amazing!!!!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Miguel Velasquez"}, "185": {"review": "Very good food. Red Thai curry was amazing! A bit expensive though.", "time": "8 months ago", "rate": "Rated 5.0 out of 5,", "name": "Anurag Sai"}, "186": {"review": "best thai in New york without a doubt", "time": "4 months ago", "rate": "Rated 5.0 out of 5,", "name": "John Livanos"}, "187": {"review": "Best Thai food in the city! The curry pasta pork/chicken, chicken puffs, most of the noodle dishes, and satay are excellent!", "time": "9 months ago", "rate": "Rated 5.0 out of 5,", "name": "Pranav Shanbhag"}, "188": {"review": "Specials are bomb and stir fries are delicious.", "time": "5 months ago", "rate": "Rated 5.0 out of 5,", "name": "Siddharth Sharma"}, "189": {"review": "Really tasty and also healthy food.", "time": "4 months ago", "rate": "Rated 4.0 out of 5,", "name": "George Meressa"}, "190": {"review": "I'd recommend you try noodle soup. It's sound and spicy and can be a great option. Need to book table in advance and waiting time can be 30 mins", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Anh Thu Do"}, "191": {"review": "Very fresh ingredients and very delicious food. \nThis restaurant is very original with Thai music all along your stay. \nWe really enjoyed and during our 4 days stay we were here twice. \nHomemade egg noodles is made fresh every day. \nIn both days we found a table even without reservation. If go for dinner maybe it would be a good idea to make a reservation though. \nFor me one of the best Thai restaurant ever!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Andrea Giorgi"}, "192": {"review": "Everything is very good!!", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Maya Harry Supoyo"}, "193": {"review": "its worth the wait. get the wings!", "time": "5 months ago", "rate": "Rated 5.0 out of 5,", "name": "Wayne Law"}, "194": {"review": "A bit cramped, but good food. Enjoyed the pumpkin dessert.", "time": "8 months ago", "rate": "Rated 4.0 out of 5,", "name": "Eric Soderstrom"}, "195": {"review": "The dish I had - crab and pork noodle - had a good flavor but was a bit too sweet for my liking.", "time": "9 months ago", "rate": "Rated 4.0 out of 5,", "name": "Phi Ha"}, "196": {"review": "Good food tiny space.", "time": "3 months ago", "rate": "Rated 4.0 out of 5,", "name": "John Faurbo"}, "197": {"review": "Small and cozy atmosphere inside, with fast and friendly service. This is a perfect spot to eat something warm and comforting on a rainy or cold day. \n\nWe ordered the Chicken Curry Puffs and beef buns to start and they were both delicious and filling. The Chicken Curry Puffs are something I would definitely order again! The crust was delicate and flaky and the filling was thick with a perfect amount of spicy curry flavor. \n\nEverything everyone ordered for main dishes looked amazing and tasted great. It all seemed very fresh and it was a perfect way to warm up from the weather.  I ordered the Pad Kee Moa with chicken and it had the perfect level of heat that I was hoping for. The dish is definitely not for those who dislike spice, but they can adjust spice levels when you order.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Dana Vogel"}, "198": {"review": "This tiny Thai restaurant has great Thai food! Liked papaya salad, pork bun and fried flat noodles, but since there are not many tables the wait was long.", "time": "10 months ago", "rate": "Rated 4.0 out of 5,", "name": "Koda Ko"}, "199": {"review": "Very small place but the food was very delicious. It's a little noisy (music playing loudly) but our food was prepared very quickly and was tasty.", "time": "8 months ago", "rate": "Rated 5.0 out of 5,", "name": "Michael Thomas"}, "200": {"review": "Definitely amongst the favorite Thai spots in Hell’s Kitchen. The noodles are super flagrant and tasty.  Recommend the beef noodle or the duck noodle. You can even choose the type of noodle you want. Appetizers recommended include baby back ribs, chicken wings, and papaya salad. Also enjoy a Thai iced tea, coconut juice, or traditional Thai beer (Chang)", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Dan Chiu"}, "201": {"review": "Food is delicious and restaurant has a great Thai atmosphere. Would go again :)", "time": "7 months ago", "rate": "Rated 5.0 out of 5,", "name": "Peter Pang"}, "202": {"review": "Our favorite Thai place in Manhattan. Every time we visit New York we eat here at least once if not twice. Such a great little place.", "time": "11 months ago", "rate": "Rated 5.0 out of 5,", "name": "Scott Starkweather"}, "203": {"review": "This place is a complete scam! Completely horrible service!! I'm extremely disappointed with my entire experience there! I came in with a party of three. We were all fasting since we came during the month of Ramadan and during this time of fasting we traditionally break our fast with dates and water. As we were waiting for the appropriate time to eat, I offered my friends ONE date to break the fast. The moment I took out my tiny bag of 3 dates our waitress told us that we couldn't bring outside food. She didn't say it politely, she was actually yelling at us! We all explained to her that it's the month of Ramadan and that's what we do. The waitress wouldn't give us a chance to speak. Mind you we ordered so much food for the three of us. But we put the one date away. We ordered 3 plates of pad Thai, 3 orders of spring rolls, 1 order of dumplings and 3 Thai iced teas. The entire time we were there, not only our waitress but every single waiter was eyeing us down to the point I was extremely uncomfortable eating my food. I was confronted about putting too much hot chili flakes on my food. The waitress told me that they make it themselves and asked if I really needed to use that much. Why are you watching me eat? When it came time to pay the bill we said that we would spit the check so the waitress left and came back with 3 separate checks with the same amount of money. When we did it on our phones the waitress added an extra $2 per check to the total amount so an extra $6 bucks plus we had to give a tip. When I asked for the original receipt she wouldn't give it to us!! Complete scam! I do not recommend this place to anyone unless you want to get discriminated against and scammed!", "time": "a year ago", "rate": "Rated 1.0 out of 5,", "name": "rima salem"}, "204": {"review": "Delicious authentic Thai food with a cozy atmosphere. It can be a little claustrophobic at peak, but is worth it for the food!", "time": "10 months ago", "rate": "Rated 5.0 out of 5,", "name": "Nick Miceli"}, "205": {"review": "Tiny restaurant and cheap with good Thai options. They only lack of options for dessert. Service was pretty fast.", "time": "10 months ago", "rate": "Rated 4.0 out of 5,", "name": "Carlos Villavieja"}, "206": {"review": "I was taken here while traveling with a co-worker who eats Thai every time I'm with him. He's taken his family here 3 times. I don't spend enough time in NYC to know if it's the best in the area, but I can say that it was really excellent.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Jeff Maddocks"}, "207": {"review": "Posted this on yelp as well: I came here yesterday during lunch and ordered the Spicy Vegetable Pad Kee Mao for takeout. The food came out in 5 minutes despite the restaurant being crowded, which was nice. The food was okay but if you're going there to order that, you're better off going somewhere else. There are other Thai places on 9th Ave that could make that dish better in my opinion.\n\nThe reason why I'm giving them one star is not because of the food but because one of the hostesses was really rude. I originally tried to order the Shrimp Pad Kee Mao. I asked the hostess if it was possible for them to take the shell off the shrimp. This is something I ask every time I order this dish, and I eat Pad Kee Mao every time I go to a Thai restaurant. She responded in a very rude and condescending way \"No, you can do that yourself. We can't do that here. We're too busy to do that here, you can do that yourself.\" In my opinion, her response could have stopped at \"no.\" This response and the way she said it was very rude and unnecessary. Again, I've asked this question at multiple restaurants before, some busier than them. Some have said \"yes\" and others have said \"no\" but none have been as rude as this woman. \n\nI didn't respond to her comment but my friend and I continued to order because we walked pretty far to get to the restaurant and we were hungry. Because the mediocre food and rude hostess, this is not a place I will ever visit again. Hope you have a better experience.", "time": "8 months ago", "rate": "Rated 1.0 out of 5,", "name": "Cheryl Liburd"}, "208": {"review": "Love the food and the place! Very delicious food & fast & nice service!", "time": "8 months ago", "rate": "Rated 5.0 out of 5,", "name": "Christian Olivier Merz"}, "209": {"review": "This place was amazing!!! The food was delicious 😋It is a very small restaurant so make sure to get there knowing that. You can leave your phone number and go get a drink. Great service and cute atmosphere. Very tight though but worth the wait and crowded area! So good. I definitely recommend this place😁", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Camille Rose"}, "210": {"review": "Love this place. Delicious authentic food in an intimate fun setting. A nyc fav.", "time": "10 months ago", "rate": "Rated 5.0 out of 5,", "name": "Andrew Means"}, "211": {"review": "Worth the wait. Once you're seated, service is fast and food is fantastic.", "time": "10 months ago", "rate": "Rated 5.0 out of 5,", "name": "Jayson Goldman"}, "212": {"review": "This was yummy. Being a proper Thai restaurant they have loads of gluten free options. Everyone was so kind and the entire staff seems to take care of everyone. Fresh food and ingredients. We'll be back", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Avi Smith-Rapaport"}, "213": {"review": "Ordered the Beef noodles and Thai iced tea. No doubt the best thai noodles in NYC - must try! Came here at 4pm for lunch, and the restaurant is almost full. (Wow)\nWould definitely come back for dinner!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Sammi Wong"}, "214": {"review": "Line outside the door waiting for the restaurant to open for lunch. I ordered the seafood salad and the green curry. Both were fantastic!", "time": "10 months ago", "rate": "Rated 5.0 out of 5,", "name": "Adam"}, "215": {"review": "Delicious food, one of the best Pad Thai I ever had. We had variety of dishes and they were all excellent. Very small place and wait time could be an issue when busy. There is no Wi-Fi. Excellent service. Prices are very decent.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "N Laurencic"}, "216": {"review": "Wow, cannot be missed, food and staff are exquisite, only small restaurant and had to wait 30 mins but hey that was worth the wait.", "time": "10 months ago", "rate": "Rated 5.0 out of 5,", "name": "Brian Miller"}, "217": {"review": "I love this place. Their pad thai is delicious. There’s often a wait, but it’s understandable - the place is tiny. Their delivery service works well too, but food is obviously always better at the restaurant. Giving 4 stars only because I noticed they recently got a B rating - seems like they need to work on cleaning issues! Disregarding this, I highly recommend this place.", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Silvia Sebben"}, "218": {"review": "One of the best Thais in the city - super delicious and we have never been disappointed", "time": "10 months ago", "rate": "Rated 5.0 out of 5,", "name": "Stefan Dobler"}, "219": {"review": "Awesome Pad See Ew - maybe the best I've ever had (order with medium spice)! Spring rolls and chicken wings were great! So many things I'd like to try on the menu. We hope to try it again soon!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "don maxwell"}, "220": {"review": "One of the best Thai restaurants in the city. Can’t go wrong! Worth the wait! Really love the ratchaburi crab + pork dry noodles!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Soohan Han"}, "221": {"review": "A hidden gem. Well maybe not that hidden since it is on several top 10s. Still it will not disappoint assuming you get there early enough to get a table. The crowd is also very friendly, our neighbours even let me try their pad Thai.\nThe dishes are authentic and amazing. The prices also won't set you back on your rental payment. Highly recommended.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Antonio Fortes"}, "222": {"review": "This place it is simply awesome,  I love it, every time that I go to NY, I go to eat there, the food is so delicious", "time": "9 months ago", "rate": "Rated 5.0 out of 5,", "name": "nelly rubii"}, "223": {"review": "If you have no time to go to Thailand, then come here and try one of the best traditional Thai food!! Not only is food as awesome as in Thailand, but the service is also nice and friendly!! I strongly recommend beef salad and the \"Ractchaburi noodles”\n.\n.\nUpdate: The service is just so friendly with their big smile. It’s aways a happy time to come here :)", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Nicha Sukittiyanon"}, "224": {"review": "This place is phenomenal! Both my husband and I loved our dishes. The service was quick too! Great authentic Thai food!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Rebecca Lucero"}, "225": {"review": "Soooooo gooood! Try this place! No reservations allowed so went in and gave phone number for text when table was ready...about 35 mins. Communal seating in some locations. Fast service. Food was phenomenal - try the curry puffs for sure.", "time": "10 months ago", "rate": "Rated 5.0 out of 5,", "name": "Jasmine Brewer"}, "226": {"review": "It's a small place in hell's kitchen so I usually wait at least 20 minutes to be seated but it's all worth it. The food is delicious and so fresh. I love their noodles so much! If you are around times square, theatre district and crave for Thai food, I definitely recommend!", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Min Park"}, "227": {"review": "Amazing authentic thai food. Very spicy so evaluate your comfort level before you attempt!", "time": "11 months ago", "rate": "Rated 5.0 out of 5,", "name": "Dee Patel"}, "228": {"review": "Amazing food great value, came here after Chicago at the Ambassador", "time": "10 months ago", "rate": "Rated 5.0 out of 5,", "name": "Ellie C"}, "229": {"review": "Delcious thai iced tea", "time": "6 months ago", "rate": "Rated 5.0 out of 5,", "name": "gianella guiLLEN"}, "230": {"review": "Good Thai food obviously made with fresh products. Quite a small place, but when I went there it was crammed! Pre-ordered the food by phone, it was ready in a quarter of an hour. The staff was efficient and helpful. They have a specialty of home made noodle that are well worth it.", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Eric Broneer"}, "231": {"review": "Good location near Broadway. Good for spicy food. Visited based on the high rating review. Very crowded place, small table & bar. They give stool for sitting. Do not take reservations. Rude hostess,  & service. Staff has attitude.", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "Pinakin Mistry"}, "232": {"review": "Small dining room, but they do takeout.  The tofu here is the best I've ever had.  They must make it differently, because the texture is less slippery and a bit spongey. \n\nAs for spiciness, the \"medium\" is what most restaurants call \"extra spicy.\"  Approach with caution and plenty of fluids", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Allison Saito"}, "233": {"review": "I ordered the duck noodle soup, and it was delicious! The soup was nicely flavored, but I like a little heat to my food and added a few spoonfuls of the chili powder on the table. Beware: that stuff is spicy! Still enjoyed the noodles, the soup, the duck, and the veggies. A nice decent amount of protein left me happily full. The space itself is small and cozy so expect a wait if you come at peak times.", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "David La"}, "234": {"review": "I found this to be a great lunch spot. Service is very friendly", "time": "8 months ago", "rate": "Rated 5.0 out of 5,", "name": "Ziad Iskandar"}, "235": {"review": "Get the lunch specials, they are a better deal and just as tasty.  I got their pad thai with calamari to go.  Calamari and pad thai?  That's pretty unusual.  The food was definitely tasty and ordering online was super easy, took less than 10 minutes for order to be ready for pick up.  The only thing is: too much disposable one-time use plastic.  They even put a slice of lime in it's own plastic cup container.  All the trash generated from this one meal made me feel pretty guilty.", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Lin Gan"}, "236": {"review": "Always have to stop by here every time I come to nyc ,this place is really good Thai noodle.", "time": "10 months ago", "rate": "Rated 4.0 out of 5,", "name": "summer jene"}, "237": {"review": "One of the best Thai restaurants in the city.", "time": "5 months ago", "rate": "Rated 5.0 out of 5,", "name": "Yukiyo Otsuka"}, "238": {"review": "I got a tom-yam-kung noodle, papaya salad and pat-thai noodle. Those were really good!\nGood portion, super busy, cool staffs.\nI’ll go try another one soon.", "time": "11 months ago", "rate": "Rated 5.0 out of 5,", "name": "Eugena Won"}, "239": {"review": "Satisfyingly authentic, Pure Thai lives up to its name. Flavors and spices are absolutely perfect, and they're completely willing to turn up the heat!", "time": "10 months ago", "rate": "Rated 5.0 out of 5,", "name": "Arun Kochhar"}, "240": {"review": "Delicious, food was prepared excellent.  Only downside was the size of the restaurant", "time": "9 months ago", "rate": "Rated 5.0 out of 5,", "name": "Lisa McDermott"}, "241": {"review": "Great location. Nice staff. Tasty breakfast.", "time": "11 months ago", "rate": "Rated 5.0 out of 5,", "name": "Charles Hickey"}, "242": {"review": "Given the confined space and the sheer amount of people they pump through this place. The food is very solid. Honestly, authentic as it can be for being in NY. Is it the best, remains to been seen... But if you are looking for a quick Thai fix. This will do it for you....", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "MJL"}, "243": {"review": "Oh my god, f’n delicious! Will be back!", "time": "7 months ago", "rate": "Rated 4.0 out of 5,", "name": "Birna Elínardóttir"}, "244": {"review": "My favorite Thai restaurant in NYC!! I just wished it was bigger. This is not a good place to bring a large group and be prepared to wait 45-60 minutes. But the food is super tasty so regardless, I keep coming back.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Bianca Ng"}, "245": {"review": "A very cute small Thai restaurant on the border of Times Square.  If you’re craving noodles, come here instead of Ippudo.  \n\nI ordered the Krabi Noodle soup.  My favorite part of the dish was actually the rice noodle.  It was perfectly cooked, just the right texture. I’m not a fan of the fish ball, though the thinly sliced fish cake was pretty good.  The soup also come with 2/3 big shrimps and some calamari pieces.", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "mydiemho"}, "246": {"review": "Horrible service the wait was ridiculously long  110 minutes and ended up with no tables... Highly recommend the staff to improve their communication and be considerate of customer's time. What is the point of going to eat out to get frustrated with poor customer service... We waited for 2 hours because they kept saying another 15 MN ... of course it is very common in New York restaurant scene to end up in this situation but it is all about how the restaurant adresses it. Here it was a joke.... and they did not even seemed bothered", "time": "a year ago", "rate": "Rated 1.0 out of 5,", "name": "sandra vedadi"}, "247": {"review": "Their dry noodle with charsu and crab meet is my favorite. Food comes fast. They are always very flexible with customer’s special requests which is a huge plus.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Minglu Li"}, "248": {"review": "Excellent food, super tasty! \nThe environment is great, but be prepared to wait for a spot.", "time": "11 months ago", "rate": "Rated 5.0 out of 5,", "name": "Vitoria Calil"}, "249": {"review": "This restaurant serves excellent Thai food. We visited the place two times during our NYC trip and we have never been disappointed. The staff was friendly and very fast. It feels like they have about the same number of employees as there are guests in the restaurant. But everything is organized perfectly and very efficiently. Our food was served after 2 minutes and it was very fresh and hot. The place is quite small and it was always crowded. However, people don't stay long in the restaurant so you don't have to wait long to be seated. The restroom was clean and so was the kitchen (you can have a look inside the kitchen while you are in the line for the restroom). We paid $14 for fried rice with chicken and about the same amount for a stir-fried wok dish with shrimps. Portions had normal to big size. All in all, I would recommend to visit the place.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "A. Hoffmann"}, "250": {"review": "Every time I’m in the city, Pure is a must stop! Food and service and impeccable. Can be busy at times but food is worth the wait! Chicken pad Thai and Ratchuburri pork and crab is to die for and as well as the ribs! Don’t forget your Thai iced teas as well!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Andy Mendoza"}, "251": {"review": "Best thai place in the neighborhood. Always packed so expect to wait in line. \nPoor AC so it can get really hot inside.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Ray Yang"}, "252": {"review": "Very fast service, delicious food, good prices and portions. They have most of the classical Thai dishes, but I was missing Panang curry. The decor and tables are simple, but comfi. Definitely not a classy place. Seating is very limited, since this is a genuine hole in the wall. They also appear to have a very popular delivery service as judged by the bike delivery folks constantly zipping through the restaurant. The only dislike is that there is a constant bombardment of Thai pop at a pretty high volume. It is still possible to have a conversation without yelling. The music seems to resonate very well with the younger crowd this restaurant attracts.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Thomas Kusch"}, "253": {"review": "Genuine Thai cuisine. Excellent food. Busy small premises.", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Andre Constantin"}, "254": {"review": "Spicy Thai food! Usually a wait to get a table.", "time": "8 months ago", "rate": "Rated 4.0 out of 5,", "name": "Dusty Hill"}, "255": {"review": "I will absolutely use this company ever again beacause my experience was fabulous  and I recommend them at all. Thank You!!", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "Kyle Malfoy"}, "256": {"review": "Excellent food. We 5 of us went there for lunch.  The service was quick too.  It's a small place and we ended up sitting at the bar.  I will go back again.  Very reasonably priced and portions were big too.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Nathan Paki"}, "257": {"review": "I almost cried as soon as I had a bite of Pad Thai. It was awesome, amazing and speechless. I’m not a noodle person, so when I have even good noodles, I usually can’t finish one serving on my own. However, this was literally the first time I finished my noodle dish by myself. The combination of ingredients was amazing. Definitely worth visiting again. There was a waiting line but I only waited 10mins since I went there by myself.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Dani Choi"}, "258": {"review": "Wow! A must-try! Some of the best Thai food I've ever had. Their delivery is insanely quick, too.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Drew Davis"}, "259": {"review": "Very convenient, easy online ordering for delivery. Delicious food was delivered accurate, fast, fresh & hot!! Great delivery experience with this restaurant!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Kellie"}, "260": {"review": "The restaurant is tiny and you’re  sitting right on top of other people. We had dumplings and pad Thai. Dumplings were super soft and fell apart. My husband liked his chicken pad Thai, however my shrimp pad Thai wasn’t all good. Go to Up Thai if you ever on Upper East side. They have much better dumplings and pad Thai.", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "Inna Z"}, "261": {"review": "Not a long wait. Friendly servers. The food was great quality with some spice to it - not Thai spicy though - very much tolerable. Good came out to the table at a reasonable amount of time from when we ordered. The Thailand coffee was great! Enjoyed Pure Thai Cookhouse - would return. ", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Joshua Augusto"}, "262": {"review": "Great pad thai and spring rolls! Good portion. Cozy location. They have thai beer (Singha). Good service, but I’m still wondering if the gratuity is indeed ‘suggested’", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "th V"}, "263": {"review": "Very small and crowded place, very popular and a little too hot inside. The dumplings are to die for. The main dish I ordered was not that exciting, but in all fairness, I wasn't really in the mood for thai, so it could have just be me :)", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "bianca iordan"}, "264": {"review": "Amazing Thai restaurant !!!!!!!!!! We came in on a sunday afternoon and were told the wait would be 45 mins. The host was able to get us in less than 30 mins. The interior was unique. The set up gave you the street food feeling experience. Food time was reasonable compared to how busy they were. Food was amazing also. I would recommend the ratchaburi noodles and sukhothai noodle soup. And the service was excellent.", "time": "11 months ago", "rate": "Rated 5.0 out of 5,", "name": "Thu Nguyen"}, "265": {"review": "Great food", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Amber Murray"}, "266": {"review": "Food was simple and yet fantastic to taste.  Apetizer (sea food salad) was just delicious.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Arijit chattopadhyay"}, "267": {"review": "I hope your customers are lot! But it would be more then more..I am a web designer! I do Google, Bing, Yandex Engine Optimization! I give a guarantee for you will be in first page on google at your city with your web site! You can see my phone on image! First job for trust! Pay later!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Mustafa Alper Temelkaya"}, "268": {"review": "Unique flavors, always interesting specials. The Thai pop music is fun too. The staff is very friendly as well.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "tom barratt"}, "269": {"review": "Amazing food , authentic and never misses to impress. Place is small so wait time is long.", "time": "11 months ago", "rate": "Rated 4.0 out of 5,", "name": "T Qayyum"}, "270": {"review": "Cozy, high traffic spot with authentic Thai food.", "time": "10 months ago", "rate": "Rated 4.0 out of 5,", "name": "Rhonda Mona"}, "271": {"review": "The best Thai in new York.  I hate the wait but in t is truly worth it.", "time": "10 months ago", "rate": "Rated 5.0 out of 5,", "name": "Steven Silver"}, "272": {"review": "Great food. Very busy in the afternoon but worth the wait.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Kenice"}, "273": {"review": "Hidden gem in Hell’s Kitchen. It’s one of the best thaï restaurant I’ve ever been. It’s cute, small, authentic and the staff is so nice ! \nFood is great and not expensive at all. Great atmosphere for a late diner or a date. \n\nFood : *****\nAtmosphere : ****\nService : *****\nPrice : **\n\n- : no reservations, always a line-up\n+ : very good prices, perfect for a late diner", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Viriane Pes"}, "274": {"review": "In an area full of respectable Thai food, this place stands out both for quality and creativity. Really like the music they play also.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Albert Freeman"}, "275": {"review": "Loved this place! Big portions of really good food. My plate was pretty spicy. Everything was priced well. I would recommend it.", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Maranda Nielson"}, "276": {"review": "Food here tastes like real Thai food and their service is fast.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Servando So Yong Silva Sohn"}, "277": {"review": "Pretty average Thai restaurant", "time": "4 days ago", "rate": "Rated 3.0 out of 5,", "name": "Mandeep Dhanoa"}, "278": {"review": "There’s a very good reason why this place is so highly rated. Once I️ sat to order I️ felt instantly transported to another country, totally didn’t feel like nyc(thank God)The service is AMAZING, and the food??? Good lord, it was incredible!!!! I️ want to return, in fact I️ will return. This place has earned my business and a stellar review!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Ingrid Nunez"}, "279": {"review": "Pure Thai was good so we decided to take a walk and we weren't disappointed! It is pretty small so if you want to sit in then you may have to wait a while, but luckily it was fairly quiet at the time we went. We then ordered a takeaway the next day and it was just as delicious! Try the coconut milk as well, it's really tasty!", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Jack Azure"}, "280": {"review": "Very good Thai food & great service.", "time": "10 months ago", "rate": "Rated 5.0 out of 5,", "name": "Yogev Sembira"}, "281": {"review": "Delicious food, courteous staff. Small restaurant with big flavors and quality food.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Alex Conner"}, "282": {"review": "Amazing food, small authentic location. Faultless", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Eric Mills"}, "283": {"review": "It's really small, but really, really good.  Very authentic with GREAT service.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Terry Rivers"}, "284": {"review": "One of my favorite Thai places in NYC, and this is one of the top Thai restaurants in Hell’s Kitchen. Their seafood noodles and their duck soup noodles are both very good. They also make fantastic pad thai, and the appetizer ribs are a must try. The wait is almost always more than one hour however, so I would recommend paying a visit to this place early for lunch or early/late for dinner.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Youer Shao"}, "285": {"review": "Good small cozy place to eat.\nI liked music here.\n\nAmbience : 3\nFood : 5\nValue for money : 4\nService : 4\n\nNeed more options for vegetarians", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "prashant Nidgunde"}, "286": {"review": "Authentic Thai. Atmosphere like streets of Bangkok", "time": "8 months ago", "rate": "Rated 5.0 out of 5,", "name": "Zach Thomas"}, "287": {"review": "Best Northern Thai Cuisine EVER!!!", "time": "4 months ago", "rate": "Rated 5.0 out of 5,", "name": "sri sanan"}, "288": {"review": "Love coming here and it has amazing, tasty food ! Got there a half hour before opening\nAnd there was a line before it even opened. The entire place filled up within 5 mins of opening. The mango sticky rice is amazing.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Mary Ashmore"}, "289": {"review": "Extra ordinary Thai restaurant in extra ordinary city! The interior decor is very nice and unique, and the dishes served are hearty and delicious. The wait line (I heard) could be quite long, so you might want to call them in advance. Also, the place is very nice and cute, but pretty small, so might not be an ideal location to meet for a larger group of people.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Won C."}, "290": {"review": "Had a lovely pad Thai and spring rolls! The ambiance and music are super authentic, the flavors were spot on, and service was fast!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Alex Aronovich"}, "291": {"review": "Served me fast, filled me up for less than $20 (all included), might be my new go-to thai place", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Ben Lerner"}, "292": {"review": "Bad place, the food was terrible", "time": "5 months ago", "rate": "Rated 1.0 out of 5,", "name": "Tania Pereira"}, "293": {"review": "Good Thai kitchen. Simple decor", "time": "11 months ago", "rate": "Rated 4.0 out of 5,", "name": "John McLaren"}, "294": {"review": "Great atmosphere, great food, and great service! It does feel like you're eat Thai Street food. Food comes out so hot. You know they cook that stuff fresh!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Randy Singh"}, "295": {"review": "One of my favorite Thai spots in NYC.", "time": "8 months ago", "rate": "Rated 5.0 out of 5,", "name": "Robert Jantz"}, "296": {"review": "Been here a few times and it is always busy. Be prepared to wait if you come at prime time. They do not take reservations. Everything we've ordered we've been happy with. All the food is very tasty and fresh-tasting. Ambiance is a little cramped but overall really nice.", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "John Butterfield"}, "297": {"review": "Pad thai excellent food and fresh \nGood music \nStaff friendly and helpful. \n😋😋😋      delicious 😋", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Araba d"}, "298": {"review": "Good food but the wait was exceptionally long (45 min). The chicken was lightly seasoned most of the flavoring came from the sauce for dipping. The vegetable dumplings were good but it has a lot of peanuts in it!", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "Chandra Ade-Browne"}, "299": {"review": "Friendly service,  tasty food and reasonable pricing", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "H.-P. Simon"}, "300": {"review": "Tasty Thai fare within walking distance to Broadway theaters. Always affordable, and a nice casual spot. It is rather cozy inside, but plenty of hooks for coats.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Kathryn Hagen"}, "301": {"review": "Best Thai food ever. Really really delicious. The restaurant is small so you may have to wait and/or sit with strangers but it is so worth it. Their papaya salad and turmeric beef are my personal favorites!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Gregory J"}, "302": {"review": "Of all the Thai restaurants that I have been to in New York City, Boston, and Washington D.C., this restaurant provided me with the food that reminded me the most of Thailand. I had the beef noodle soup (which was similar to the canal beef noodle soup in Bangkok) and the raw crab spicy green papaya salad. The spicy-ness intensity is clearly not as extreme as Thailand, but for two hours I ate listening to Thai pop songs, I really felt as if I might be sitting in Thailand again. The restaurant also offers a nice pumpkin sticky rice that comes in a large bamboo leaf. Expect a wait.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Lena Wu"}, "303": {"review": "Was recommended a dish by my server: fried chicken over rice with hot and sweet sauce. It was pretty good.\nTheir chives pancakes were great! Good value for money! ", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Sambhavi Vempati"}, "304": {"review": "Good Thai food for westerners but not for thai people", "time": "a year ago", "rate": "Rated 2.0 out of 5,", "name": "Pacharadanai Colmart"}, "305": {"review": "Amazing food.", "time": "4 months ago", "rate": "Rated 5.0 out of 5,", "name": "Aria Chiodo"}, "306": {"review": "Lovely cosy atmosphere, delicious noodles - make sure you get the homemade ones with pork and crab. Truly yum!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Alexander Dousie"}, "307": {"review": "If you are looking for authentic Thai food you need to visit this place. It's a small cute restaurant, it always has a waiting, but the food is Definitely worth the wait. Loved it", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Pooja Bandekar"}, "308": {"review": " This is a hidden gem. It's always busy, they don't take reservations but everyone always waits the 45 minutes or so to get seated. The restaurant itself is pretty much a hall way, everyone is crammed together inside this little place. The food is amazing! Get the vegetable dumplings and you won't be disappointed!", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Ahmed El-Mesiri"}, "309": {"review": "Very good thaï good , excellent pad Thaï , not to expensive. Very good place", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "raphael de neeff"}, "310": {"review": "They dont have tomyam soup but they have the best noodle, chicken wings, satay, and chicken/pork basil🙌  ", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "bv Santy"}, "311": {"review": "My favorite Thai place, always come for their chicken wings, pad ki mao. This is a very small place so wait is pretty bad, always had to wait like over 30 mins.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Chuchu Zhan"}, "312": {"review": "Delicious food, very friendly personnel, would go there again! Thank you!", "time": "11 months ago", "rate": "Rated 5.0 out of 5,", "name": "Marcel Geltman"}, "313": {"review": "Excellent, tasty food, and great service.", "time": "11 months ago", "rate": "Rated 5.0 out of 5,", "name": "Randolph Hoppe"}, "314": {"review": "Awesome SF foodie spot! I highly recommend the fresh oysters, the best I've had in the city! There's a great patio (that has heat lamps because this is SF after all) that you can hang out on and take your time enjoying the amazing experience! There's a great low-key bar in the back with limited seating, but usually turns over pretty quickly. The food is always excellent as is the service. Make reservations just incase.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "lin lee"}, "315": {"review": "Do not go here. I was there and though the food was not that bad, it was not athentic Thai and I know you must. Adapt to the local culture so I accept the food and say it was ok but when they brought the bill they did not gave you much of a choice of what to tip...the  amounts predetermined for you. And they were all above ten percent... certainly not fair and not legal.", "time": "a year ago", "rate": "Rated 1.0 out of 5,", "name": "Chian-Tilung Abraham"}, "316": {"review": "Pretty food.", "time": "4 months ago", "rate": "Rated 5.0 out of 5,", "name": "Boyang Zhang"}, "317": {"review": "Mild = very spicy, food was decent, great service", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "Akshay Awasthi"}, "318": {"review": "Really tasty almost-authentic Thai - it's authentic in style but softened for the new world wankers. Great friendly service. Authentic Asian beer! I love the beef salad - get it spicy cos it's really not that spicy.", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Rowan Pritchard"}, "319": {"review": "So wonderful! Always!", "time": "6 months ago", "rate": "Rated 5.0 out of 5,", "name": "Gil Mitchell"}, "320": {"review": "Great food, friendly staff and amazing atmosphere! Definitely recommend this place. Thanks!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Yaroslav Pogrebnyak"}, "321": {"review": "Very good Thai food.", "time": "6 months ago", "rate": "Rated 5.0 out of 5,", "name": "Chanyaporn Khaoroptham"}, "322": {"review": "Total rip off", "time": "a month ago", "rate": "Rated 1.0 out of 5,", "name": "Harkirat Singh"}, "323": {"review": "Fantastic Thai food, definitely ranked among the better Thai restaurants I've been to. Catered well to my tastes, and offers good prices despite it's fantastic location.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Jacob Lundy"}, "324": {"review": "Super tasty!", "time": "3 months ago", "rate": "Rated 5.0 out of 5,", "name": "Danny Boudrot"}, "325": {"review": "My favorite Thai restaurant in NYC. Great food, great price, great staff. Perfect proximity to the theater district for dinner before a broadway show. Very efficient at handling wait time. Never have to wait more than 30 minutes to get a table on a Friday/Saturday night", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Peter Gibbs"}, "326": {"review": "If you're in New York City, you can get the true feel of a Thailand cookhouse without having to leave 9th Avenue. Stepping into Pure Thai brings images of the crowded streets of Bangkok, while the smell of the home cooked food and friendly staff make you feel more welcome than a normal New York restaurant. We were seated right away by a friendly waitress who took our drinks as soon as we sat down. The Pure Thai Iced Tea with Jasmine and Mint is unbelievable. When ordering a starter, you can't beat the baby back ribs that fell right off the bone. While there are dozens of unique Thai dishes on the menu, as well as daily specials, the standard Pad Thai (with chicken and extra peanut sauce) was the best I've had in the city. With a price at around $25 per person, it is on the cheaper end of a Midtown restaurant. I would recommend Pure Thai for a first date, or even a pre-theatre meal. I will certainly be back.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Torrey Tolikver"}, "327": {"review": "The food was super fresh and Pad Thai was no where to be found. Highly recommend.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Laura Parnizari"}, "328": {"review": "Pure Thai is by far the best Thai food in NYC. Creative, authentic, and downright delicious, Pure Thai Cookhouse delivers an explosion of exotic Southeast Asian flavor with phenomenal customer service. \n\nWhether ordering delivery or dining, I am always satisfied with me experience. The restaurant atmosphere is characterized by authentic Thai decor and music coupled with hard-working, friendly waitstaff. \n\nOrder anything on the menu. You will not be disappointed.", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Kurt Hildebrandt"}, "329": {"review": "Always packed, food always delicious. This is a favorite thai place in Manhattan", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Kareem Alston"}, "330": {"review": "This was the best Thai food I've ever had. Even with a group of 6, service was incredibly exceptional. They went out of their way to get food out fast, clear plates, refill drinks, and all around just delivery an awesome experience.\n\nIt was so tight inside, that it actually felt like we were all inside a small boat, on the water in Thailand itself. The food, and noodles, are off the hook, and the price was an absolute bargain for the quality. Crazy good!", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Spencer Boerup"}, "331": {"review": "Best Thai food! They have pretty interesting dishes like vermicelli noodles with curry and vegetables. Dishes are easily substituted, like vegetables instead of pork, so it's a good place for vegetarians.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Charlie Petty"}, "332": {"review": "Exactly what I was looking for. Wanted a unique, non-toursty, delicious southeast Asian spot. This place did not disappoint. \"Dry\"rice noodles with duck, saki (from a can, Highly recommend) and service were all great. I was there on a Thursday  (slightly busy) and by myself so I can't attest to the wait. Will return for sure.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Joseph Patton"}, "333": {"review": "Good tasting food. But portion is a bit too small. \n\nThe Thai tea was great. Chicken satay was good too but only 4 pieces for 8 bucks. The Pure Thai noodle was delicious but I wish there was more noodle in it. Fried rice was a bit lighter (less salty) but portion was just nice for this one. ", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Justin Lin"}, "334": {"review": "I had the jungle chicken curry it was amazing the tofu was pretty good roo", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Chris Winger"}, "335": {"review": "Mm best Thai food! They have pretty interesting dishes like vermicelli noodles with curry and vegetables. Dishes are easily substituted, like vegetables instead of pork, so it's a good place for vegetarians.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Michelle Miron"}, "336": {"review": "Small place, good food", "time": "10 months ago", "rate": "Rated 5.0 out of 5,", "name": "James Cowan"}, "337": {"review": "Yummy: pea shoots with garlic oyster sauce and minced pork (not on menu) BUT crispy duck was too crispy (dry and tough to chew) for me. Had to go early bird ;)", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "byulaa yoo"}, "338": {"review": "Delicious, different, great atmosphere, never been to Thailand, but sure seems like the real thing.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Lucia Perfetti Clark"}, "339": {"review": "De. Lish. Us.  Holy Basil Chicken?  I miss it soo much. I would move back to NYC just for that!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Crisp Carlin"}, "340": {"review": "Damn good Thai food. Had the pad see Ew and it was great, though I thought it was a tad bit dry, but I'm also being too picky probably. However, it was $14 with beef. Portions are pretty big too! Highly recommend it!", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Alishah Jamal"}, "341": {"review": "Amazing!", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Krista Hallecy"}, "342": {"review": "I like this place for tasty Thai food in Hell's kitchen. They make very flavorful soups. Today, I had the Pork Noodle soup with flat wide rice noodles. It came with lots of crispy pork rinds on top and slices of roast pork. I love the flavor bursts from the dried shrimp and the peanuts. The soup was just a little sweet for me. I never had a bad dish here.", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Jackie Gordon Singing Chef"}, "343": {"review": "Really wonderful curry puffs. I'm undone. Soft, flaky and just ever-so-tasty. \nThe actual duck noodle soup was good, not great. The broth was a little too sweet and didn't have the depth of flavor I was expecting, though the noodles were good.\nThe ratchaburi crab, similarly, didn't have the complexity I was looking for. It was a light, spicy, crab-deficient dish. Hoping to find better noodles, too, in the future.", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "R Wu"}, "344": {"review": "[sung to the tune 100% Pure Love by Crystal Waters]\n\nIt's 12 past midnight, don't close your eyes\nYour soup is half alive, and I'll be by your side\nI've come to eat my share, add spice if you dare\nJust be aware, that you'll have to share\n\nI want your crab, I want it tonight\nI'm taking your noodles, so don't you fight\nI'll be your answer, I'll be your wish\nYou'll be my fantasy, my favorite dish\n\nFrom the back to the middle and around again\nI'm gonna eat there til the end\n100% Pure Thai\n\nFrom the back to the middle and around again\nI'm gonna eat there til the end\n100% Pure Thai", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Chris Maliwat"}, "345": {"review": "Very small and long wait but delicious food. The soup noodles and dumplings were good. Staff is friendly but expect to be bumped into multiple times while eating.", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "Naz M."}, "346": {"review": "Tiny building, but great food and good prices.", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Tristan Anderson"}, "347": {"review": "The best thai food I had in a while. Place is always packed although we were seated last. We waited 1/2 hour for our table at 10:30 pm. The food came 5 minutes after we ordered, and it was authentically delicious. Staff is very friendly too", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Bill Sayagh"}, "348": {"review": "You've got to try the Mango Rice dessert!! The Thai Iced Tea was unique and delicious too. Friendly staff, quick service, incredible Wok and Pad Thai dishes. Amazing experience", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Melissa Rohwer"}, "349": {"review": "We got there at the beginning of the dinner rush. We put our name on a waiting list and we told that we would be sent a text when our table was ready. This allowed us to go and get a drink at another bar and explore the area a bit before. Once we took our seat service was quick and the food was delicious. I had the rachimbura crab and dry pork noodles and my husband had pad Thai. Both were excellent. The only negative was that there was only one single-stall bathroom which while spacious and clean, did cause a fairly lengthy wait. This may be a common place thing for restaurants in New York... I haven't been to enough to be able to say.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Virginia Fraser"}, "350": {"review": "The most amazinh Thai Food! The smell of the soup is stuck in my mind.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Ju Ferraz"}, "351": {"review": "Super yummy but not blow-your-mind good like I was expecting based on others reviews. Very \"cozy\".", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Carly Jordan"}, "352": {"review": "Very very tasty and authentic Thai food. Warning: the food is very spicy", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Calum McKerlie"}, "353": {"review": "Simple , affordable and tasty", "time": "9 months ago", "rate": "Rated 5.0 out of 5,", "name": "Aleksey Telyshev"}, "354": {"review": "Great lunch specials!", "time": "7 months ago", "rate": "Rated 5.0 out of 5,", "name": "Carlos Negron"}, "355": {"review": "It was solid.", "time": "4 weeks ago", "rate": "Rated 5.0 out of 5,", "name": "Reuben Natal"}, "356": {"review": "Tiny shop but food is great", "time": "9 months ago", "rate": "Rated 4.0 out of 5,", "name": "Raul Diamante"}, "357": {"review": "We two arrived about 9pm. Pure Thai is a typical NYC restaurant which would fit in a 60-foot x 12-foot trailer: cramped. But the place was full with a couple parties in front us. 15 minutes later  we were seated, having used the time to look at the menu. We were seated at a table with some other guests, but they were quite friendly. We selected two appetizers and two different dinners. All the food was absolutely delicious, spicy and plenty of flavor. The service was flawless, quick, friendly and attentive. \n Some of the other reviews here have criticized the service or the food - I can't help but wonder if they are reviewing the correct restaurant or bogus, because our experience was that Pure Thai was the most enjoyable meal of our trip to NYC and possibly the best Thai we've eaten anywhere. The prices seemed fairly reasonable, the food was great and the people quite friendly. I'll return there again, given the chance, on my next trip to NYC for sure.", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Elf Wyatt"}, "358": {"review": "Was good. Not great.  One entree came out before appetizers and then my entree was Luke warm.  Flavors were also good, not great.  It’s worth visiting, but not a destination.", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "R Vincik"}, "359": {"review": "The food was very good at a great price; very friendly atmosphere. I highly recommend tge dumplings.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "pecado cinematográfico"}, "360": {"review": "The best Thai in NYC. Everthying I ate was amazing, authentic pad thai. Plus they have Singha beer", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Jessica Zarkin Notni"}, "361": {"review": "Flavorful dishes and upbeat, attentive staff. A must visit.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Kelly Lickfield"}, "362": {"review": "Very small and tight, but oh soooo delicious", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Terry Rivers"}, "363": {"review": "Love Pure Thai one of my top Thai that I ever tried during vacation!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Chinh David Nguyen"}, "364": {"review": "Lots to wait. Food is decent. I don’t think it’s authentic but good food.", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Lisa Kim"}, "365": {"review": "After waiting 45 minutes on a Sunday night, we sat down and ordered everything that seemed vegetarian on the menu only to find out that only one thing, the steamed vegetable dumplings, were actually completely vegetarian. Everything else was cooked with oyster sauce. I'd say it's definitely not vegetarian friendly.\n\nP.S. The dumplings were delicious!", "time": "2 years ago", "rate": "Rated 3.0 out of 5,", "name": "Andrew Kofink"}, "366": {"review": " Usually a 20m wait. Best Pad Thai I ever had (That's a staple you can judge all Thai places!) Food is authentic and so is the ambiance! ", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Anj Lupan"}, "367": {"review": "I love this place. Great Thai food, though you often need to wait for a table.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Ross Cluver"}, "368": {"review": "No wonder this is a high rated Thai restaurant! The jungle curry friend rice is the BEST Thai dishes that I have ever eaten! If I ever go to New York again, I will definitely go to this restaurant! I will definitely recommend this place to everyone who likes Thai food or spicy food. I would love to try their other dishes as well next time :D", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Evanes Sze"}, "369": {"review": "Food really delicious!", "time": "7 months ago", "rate": "Rated 5.0 out of 5,", "name": "Sheila Leal"}, "370": {"review": "Very small place and always busy but worth the wait. Their house roasted pork was great, their pad see ew had the perfect balance, and the service was excellent.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Xavier O"}, "371": {"review": "Ordered the shrimp pad Thai with extra shrimp, spice level spicy.  It was excellent.  I'll have to order it at least one more time before I leave New York.  Some of the best I've ever tasted, except the dried shrimp they include in the dish.  Next time I'll just have them exclude it.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "BinksBurrell"}, "372": {"review": "Nice restaurant with very good meals.", "time": "11 months ago", "rate": "Rated 5.0 out of 5,", "name": "Alexandre Kieffer"}, "373": {"review": "Fantastic food at a great value. There is always a wait, but we'll worth it.  The atmosphere is very well conceived.  Don't forget to wash it all down with some sake! You can't go wrong here ", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Mitchell Bayne"}, "374": {"review": "The best Thai noodles in NYC , 5 stars for this place", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Panchita Paphaneuaphan"}, "375": {"review": "Cool small place with atmopshere. Food and staff was great", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Vince Szebasztián"}, "376": {"review": "Amazing Thai food coconut soup was really good", "time": "11 months ago", "rate": "Rated 4.0 out of 5,", "name": "vivek vijayan"}, "377": {"review": "Good place and food. Need to improve food rating from B though.  Pad Thai is a little sweet for me hence 3 stars", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "Frat Iqbal"}, "378": {"review": "omg so delicious... Best pad thai hands down.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Jessica Jung"}, "379": {"review": "So good", "time": "4 months ago", "rate": "Rated 5.0 out of 5,", "name": "Deanne Bradshaw"}, "380": {"review": "Simply my favorite Thai restaurant in that part of town (and there are many). The food is authentic. The problem is that it's so busy it's really difficult to get a table, normally the wait is such that we try end up going somewhere else nearby, unfortunately. I'm so happy when we can get a table there, as the food is quite good and spicy. Also, not too pricey. (The one thing I find a bit difficult is the low seating on these little metal chairs, it's hard on my back.)", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Martin Blais"}, "381": {"review": "We were warned about long wait times so we walked in, made a reservation and were texted when it was available (45-60 mins) which was a great service.\n\nThe food was amazing! We ordered chicken Pad Thai and wet hand-made made noodles with crab and pork. The place is small but the service was quick and attentive. Be warned you'll be sitting close to other patrons, if this bothers you.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Cynthia C"}, "382": {"review": "Couldn't even eat there. I went here with some friends and when we arrived, there was no line or hostess so we sat ourselves down at the seats right by the entrance (no worker mentioned anything to us). When the hostess comes to tell us that the seats were reserved, she was quite rude to us explaining how we couldn't just sit down. I'm sorry, but with no sign saying \"wait to be seated\" or a hostess to greet us or even a podium, I don't really think it was much of a stretch to assume that we could seat ourselves. The wait time ended up being well over an hour, so we just left. I don't really think it's worth coming back another day because of the service (or lack thereof).", "time": "3 years ago", "rate": "Rated 2.0 out of 5,", "name": "Jade Maak"}, "383": {"review": "One of our tour guides recommended this place and we were glad that we took his advice.  Upgrade to the hand made noodles while you there.  Service was excellent and the food was great!", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Steve Tarpley"}, "384": {"review": "Very very good Thai food! Get in early to beat the rush!", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Eddie Liao"}, "385": {"review": "Food was great.  The vegetable dumplings were a real treat.  Small place but very quaint.  Worth a visit", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Jan Ackerman"}, "386": {"review": "Amazing food but they lack options for beverages. The Thai coffee and tea were too sweet and they couldn't make it less sweet. Didn't particularly like the Singha beer either", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Yogesh Kauntia"}, "387": {"review": "Had a table right away, even as a group of 5. Food was amazing. Definitely would go again", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Emma Khoury"}, "388": {"review": "Great place for drunken noodles and the wok basil chicken and turmeric beef are really good. They have a daily rotation of appetizer and mains specials.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Ammar Khalid"}, "389": {"review": "Highly recommend their Thai iced coffee and phad Thai. They don't take reservations and are quite popular so be prepared to wait especially on busy nights. They have some indoor waiting space.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Krushna Ranaware"}, "390": {"review": "Some of the best Thai in all of NYC", "time": "8 months ago", "rate": "Rated 5.0 out of 5,", "name": "Stephen Gray"}, "391": {"review": "Great tasting authentic thai food. Yum yum would recommend. Had duck noodles and paf seew for dinner. Super good!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Wynd"}, "392": {"review": "Amazing food and a cozy atmosphere", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Braden Arnold"}, "393": {"review": "Delicious", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Agustin Testa"}, "394": {"review": "Good thai food. Usually stick to the Pad Thai, but my friends really love the Pad See Ew (I think that's how you spell that)", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Andrew Timosca"}, "395": {"review": "I'd give 6 stars if I could.", "time": "11 months ago", "rate": "Rated 5.0 out of 5,", "name": "Tiffany Spaulding"}, "396": {"review": "food great. line long but worth it. love the spice!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Robert Weisenfeld"}, "397": {"review": "My favourite Thai place in the city! I grew up in Malaysia and travelled to Thailand often, trust me when I say the food here is as authentic as you'll ever get in NYC. The place itself is not very big, and there is ALWAYS a wait, unless you come at some random hour like 3pm. I love all their noodle dishes and make sure you look at the board for their specials!", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Jo-Anne Loh"}, "398": {"review": "Great food! If you're into Thai cuisine, you should definitely check it out. Hard to seat though, long lines :( hence a 4 star", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Laura Garcia"}, "399": {"review": "One of the best places to eat good food and great service", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "שרון דוידוב"}, "400": {"review": "Decent food. Below average service. They argued with us when we did not pay for regular tip. Wouldn't go again.", "time": "2 years ago", "rate": "Rated 3.0 out of 5,", "name": "Mani Mahal"}, "401": {"review": "Delicious fried rice and noodles, love the curry dumplings sooo much.  And also recommended the pumpkin desert, although the rice is a little bit too sweet.", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "阿丝Serena"}, "402": {"review": "It is not easy to find a great reason to go eat in Hells Kitchen. That said, this may be the second I have ever found! Very simple and yet a cut above.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Max Brawer"}, "403": {"review": "Great thai", "time": "7 months ago", "rate": "Rated 5.0 out of 5,", "name": "Albert Lee"}, "404": {"review": "Really attentive and great staff, food was amazing and reasonably priced.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Diana Masters"}, "405": {"review": "Fantastic food in a cozy setting. Waiters were very attentive, which helped make the table not feel so cramped.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Chauncey Lee"}, "406": {"review": "Great place, feels like you're in small shack in thailand. Food was great and good service. We had lunch here and tried the calamari and chicken.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Ivo Dukic"}, "407": {"review": "Say nothing just eat. One of the best Thai food to eat in Manhattan. Loved it", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "BB Tripathi"}, "408": {"review": "Great food! It fills up fast and they won't seat you until your party is all there--so plan accordingly.  Super casual.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Karen Rinehart"}, "409": {"review": "Aaaaaamazing. I got a chicken basil wok dish and it was out of this world. Friendly staff. Really cool encirclement.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Hunter Nottingham"}, "410": {"review": "Great place, affordable, amazing food. Come out your name on the list. The small wait is worth it. If you're looking for a good place to eat without killing your budget this is worth the visit.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Brooke Green"}, "411": {"review": "Good place", "time": "4 months ago", "rate": "Rated 5.0 out of 5,", "name": "WOGDOG MC OFFICIAL"}, "412": {"review": "A literal hole in the wall that's easy to miss if you're not looking carefully. I came in right before closing and they had no problems accommodating me.  I had the pad see ew and the satay.  Both were outstanding.  Great dinner place and after theater dining.", "time": "4 years ago", "rate": "Rated 4.0 out of 5,", "name": "John Houser"}, "413": {"review": "You got to go here. One of my best Thai places in the city.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Ernest Kruah"}, "414": {"review": "Came here to tried their pad Thai  and a bit disappointed. It taste much more sweeter than the pad Thai I usually have, and I have to put so much spicy sauce in it to cover the sweetness. But I like their environment a lot, all the decoration and vibe...Don't think I'm coming back after this", "time": "2 years ago", "rate": "Rated 3.0 out of 5,", "name": "Yiming Yang"}, "415": {"review": "Cute little place with good food , quick service , and authentic music .", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Julia Zorko"}, "416": {"review": "Good food and good service.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Colton Needles"}, "417": {"review": "This place is amazing.had to be right at 12 noon otherwise you will miss the stop.if you are here by 12.05 get ready to wait for atleast 30 min.super popular restaurant around area and the food was amazing.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Thushara Dassanayake"}, "418": {"review": "I love Thai food. It was acceptable, but not really good.", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "Natasha Novitskaia"}, "419": {"review": "I love it here. The Pad Kee Moa never disappoints. Vegetable dumplings and the beef buns are great to order as well. Expect a wait...always. The place is small and cozy. Oh, and get some Funaguchi sake in a can!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Joey Jordano"}, "420": {"review": "The food was excellent. The seating area was small, but we didn't have a wait. The food came quickly and was reasonably priced for downtown NYC. The staff was also very friendly and attentive. ", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Shelly Beard"}, "421": {"review": "Well worth the wait!  The best Thai food that I have ever had.  It's a tight squeeze, but the service is great!   The meal was great quality at a fair price.  ", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Julie Falther"}, "422": {"review": "Exceptional food in a very narrow space. My husbands’s instinct was to leave; so glad we stayed.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Diane Withiam"}, "423": {"review": "Creative, tasty food! Had the curry puffs and the basil minced chicken. Both were very tasty! Careful: the place is tiny, so if you're not by yourself, expect a wait.", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Julio Gerchman"}, "424": {"review": "I am still craving the noodles I had from this place. I eat a lot of Thai food: this was the very best. I wish I lived here, I would eat here every day.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Lisa Banks"}, "425": {"review": "Closet of a restaurant situated in a neighborhood with a few solid Asian food options. Loved the steamed beef buns and the spicy pork noodle soup. Would happily stop by again. Be prepared for a wait!", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Florian Koenigsberger"}, "426": {"review": "Best Thai food in New York City. Recommend Pad Kee Mao and beef salad but EVERY SINGLE DISH is delicious.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Chris Jayme"}, "427": {"review": "The wait time is pretty long here but it is well worth the wait. One of the best Thai place in the area with decent price. I always have to get their curry chicken puff! They are not crazy oily like the make it in other places, the stuffing is amazing, and the dipping sauce they give you completes it all!", "time": "4 years ago", "rate": "Rated 5.0 out of 5,", "name": "Young Cho"}, "428": {"review": "Waiter was very nice and the food tasted amazing. The sticky rice served with pumpkin was amazing.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Jacqueline Arisumi"}, "429": {"review": "The food here is delicious! I ordered the vegetable dumplings and pad see ewe with beef and I completely cleaned my plate. This is definitely the best Thai food that they offer in the area. The service is friendly and quick, too. It's become my go-to Thai place.", "time": "7 years ago", "rate": "Rated 5.0 out of 5,", "name": "Jaclyn Golda-Luk"}, "430": {"review": "This food was soooo good! Would go out of our way to go back. It was busy,but the people were friendly. Food was reasonably priced. I don't think you can go wrong with anything on the menu. Totally check it out, great lunch spot!", "time": "4 years ago", "rate": "Rated 4.0 out of 5,", "name": "Amanda Lavertu"}, "431": {"review": "Excellent!!! Small place but excelent food and service!!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Flora Aviram"}, "432": {"review": "Cool interior, I wasn't impressed by the food though :/", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Kyle Stewart"}, "433": {"review": "This is my favorite Thai restaurant in Hell's Kitchen out of the many that are there.  The dishes are actually spicy and pretty authentic.  My favorite dishes are the Ratchaburi crab and pork dry noodles and the papaya salad with salted blue crab.  For the dry noodles, add the pork crackling! It will be worth it.  The place is small so I couldn't bring big groups there.", "time": "4 years ago", "rate": "Rated 5.0 out of 5,", "name": "Julie Xiao"}, "434": {"review": "Authentic,  delicious, and spicy,  just the way Thai food should be.  Went here while in NYC for business and was blown away.  Very crowded for dinner (for good reason). We had a party of 4 and had a 20 minute wait but boy was it worth it. Don't miss the beef Bao buns!", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Dave Kyle"}, "435": {"review": "Great food. Really brings me back to traveling in Thailand - authentic.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Karen Ee"}, "436": {"review": "Excellent place. Thai food here is very genuine and the spot is nice! Recommended!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Alex F. Lazo"}, "437": {"review": "Very tasty food. Authentic flavours that pack a Thai punch!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Alex"}, "438": {"review": "Wanting to go here on a Friday evening for Dinner, but as expected, the place is full and the wait is 1 hour+. So did a take away instead and it was quite good, the food was prepared within 15 minutes and was very very tasty. Not exceptional but really authentic", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Kathryn Rogers"}, "439": {"review": "I love Thai food and the spicy shrimp is great", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Luna Sandovar"}, "440": {"review": "The dry crab noodles are one of my favorite noodles to eat. Everyone I know who’ve tried it...loves it.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Angie Nguyen"}, "441": {"review": "Worth waiting for it, amazing Thai food in Manhattan. Service and atmosphere are both great as well, will come back for sure !", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Clément Bourgeois"}, "442": {"review": "Best thai in Nyc", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Riccardo Desidero'"}, "443": {"review": "Get there early.   We had a 2:00 show so got in line for the 12pm opening.  We'll decorated for such a small place. Seats are like stools, no backs.  We had the dumplings, papaya salad and wok chili tumeric with beef.  Everything was flavorful and delicious.  Service was courtiers and pretty quick.  We did get out by 1pm so plenty of time to spare but would not have made it if we missed first seating.  Would definately go back again.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Darlene Garrison"}, "444": {"review": "Authentic Thai in a tiny place. We tried 4 dishes and all were great. The wait on Friday night was long though, call ahead.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Vlad Sobol"}, "445": {"review": "Really good food, great ambiance", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Dimitri Milinevskyi"}, "446": {"review": "The food was very tasty and tastes authentic. The restaurant is very cozy. If coming in a group larger than 4 be prepared to wait awhile.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Audrey Wong"}, "447": {"review": "I love noodles and Pure has a good collection of authentic noodles. It's probably the size of a real cookhouse in Thailand so the wait could be a bit for dinner but the spicy seafood soup is delicious. It's also cool to watch them cook up the noodle dishes right near the front of the restaurant.", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Rex Pham"}, "448": {"review": "If you want to experience authentic Thai, this is the place to be. Almost all dishes were good. I especially liked the dumplings. It gets really crowded in the evening, and expect to wait for a couple hours if you do not have reservations. ", "time": "4 years ago", "rate": "Rated 5.0 out of 5,", "name": "Raymond Kim"}, "449": {"review": "Very small place with awesome thai food. Everything is super tasty and they have some dishes different than the typical thai restaurant. Service is good too. The only thing that didn't like (and is just a minor thing) is having to eat in a stool (they just have one table with actual chairs). Other than that is a really great choice.", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Antonio Yague"}, "450": {"review": "Very small place,,BUT, the food was OUTSTANDING!! My Brother was visiting, he's lived in Korea for many years and has been to Thailand,,, and he actually LOVED THIS PLACE!! We're DEFINITELY going back! ", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Theresa"}, "451": {"review": "Good, and great price!", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "Carmina Diggs"}, "452": {"review": "Ka Pao Kai was a little bit strong taste but everything was delicious!!!\nI can’t wait to go again:)", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Mary"}, "453": {"review": "Had a good time here. Warning though - the wait for a table might be over an hour on a weekday after work. Because this place does not take reservations you cannot avoid the wait, which can be annoying. I did enjoy the food, however.", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Anda Totoreanu"}, "454": {"review": "Food good, Quality control not good.  Ordered numerous times takeout from this place. TODAY, June 30, my rice contained an \"extra\".  A triangle piece of paper towel, maybe the corner if the rice bag, I don't know what this is. HOW do you not notice when pouring rice into the rice cooker?  HOW do you not notice when cooking, I don't know. Nasty.", "time": "2 years ago", "rate": "Rated 2.0 out of 5,", "name": "Robert K. Chin"}, "455": {"review": "No soap in bathroom?????  Sign says employees must wash hands really????? Not impressed with food or quality. I have had much better. Wonder who is writing the reviews?", "time": "2 years ago", "rate": "Rated 1.0 out of 5,", "name": "Sparkers Smith"}, "456": {"review": "One of my favorite Thai places in the city, consistently good and always delicious!  They can make it spicy and their specials are usually excellent. ", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Vishal Merani"}, "457": {"review": "Definitely one of my favorite spots but the poor sitting room situation is mega-annoying.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Daniel L"}, "458": {"review": "We were walking by the streets of NY and saw this place. It was quite busy, waited for a little bit and was not disappointed. Food was awesome, definitely a place to visit if you are around NY", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "cabadin karl"}, "459": {"review": "One of best Thai in NYC...", "time": "10 months ago", "rate": "Rated 5.0 out of 5,", "name": "Adrien Briand"}, "460": {"review": "Food was good and flavorful. They don't sweeten their foods that many other Thai restaurants do. The reason I gave it 3 stars is because my wife is vegetarian and doesn't even eat fish which means no fish sauce. She wanted the papaya salad and they stated they add the sauce afterwards but she asked them not to include that part but they wouldn't oblige. They never explained why they couldn't do it but just refused. ", "time": "4 years ago", "rate": "Rated 3.0 out of 5,", "name": "Sanjay Dave"}, "461": {"review": "Went with family and we all enjoyed the food. Was my mothers first time eating Thai and the staff were very friendly to steer her with a recommendation. I had Pad Thai Shrimp and everyone agreed it was the best plate. For Appetizer we had dumplings and they were great. ", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Juan C"}, "462": {"review": "Well-priced, lightning-quick service, and fresh ingredients.  Always worth the typical wait time. Probably the best Thai I've had in NYC.  Food could be spicier.  ", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Tom Montgomery"}, "463": {"review": "One of my favorite Thai places.  The Thai tea is perfect.  Noodles scrumptious and the specials are always a delight.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Ada"}, "464": {"review": "My favorite Thai place in the city. Quick food, good portions, friendly staff.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Edward Lee"}, "465": {"review": "Unbelievable Thai food. If I could eat here everyday I would. This is eating at its best. Almost a primal experience.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "John Tessieri"}, "466": {"review": "Amazing, very authentic Thai food and the best Thai iced tea!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Meredith Macdonald"}, "467": {"review": "Tasty and delicious food with a very adequate price. To visit again!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Ana Azevedo"}, "468": {"review": "Good Thai food and dessert (pumpkin custard). Advertised BYOB on one of the lists on Google maps but was not the case so awkwardly had beers with us that we could not drink. ", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Seth Nelson"}, "469": {"review": "Excellent", "time": "2 months ago", "rate": "Rated 5.0 out of 5,", "name": "Corey Masisak"}, "470": {"review": "This place is absolutely delicious, and it offers a number of dishes you would not find at your average Thai restaurant in NYC.  There isn't a dish I've had that wasn't fantastic.  Be sure to check the specials before you order as they often have entrees that are very different from what is regularly featured.  Be warned that when they ask if you want your food \"spicy,\" they mean it.", "time": "6 years ago", "rate": "Rated 5.0 out of 5,", "name": "Badr Albanna"}, "471": {"review": "Really good food. Almost always crowded since its really small. Most times, I put my name and then get a drink at a bar close by. Would not suggest getting there super hungry", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "ipsita kumar"}, "472": {"review": "Authentic Thai in a neighborhood full of ok but not fantastic Thai places. Lots of fish sauce, smell isn't for everyone but damn it tastes good and is used liberally like that in the food I had when traveling in Thailand. Green papaya salad is awesome, packed a punch. *Don't order \"spicy\" unless you really want to be blown away.", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Kevin Meenan"}, "473": {"review": "Very very tiny restaurant. Hardly any room to sit. But excellent food!", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Beck JJ"}, "474": {"review": "Not as good as it use to be the menu has changed", "time": "9 months ago", "rate": "Rated 5.0 out of 5,", "name": "Karen Bernardino"}, "475": {"review": "Really great service and wonderful environment. Nice food portions and excellent flavors and taste. You will be glad you came.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Elizabeth Humphries"}, "476": {"review": "Authentic!", "time": "2 weeks ago", "rate": "Rated 5.0 out of 5,", "name": "Vikram Pasupathy"}, "477": {"review": "We had to wait for like an hour but it was worth it. Fresh thai food and good daily specials.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Alberto Mayorga Dominguez"}, "478": {"review": "The food is good, but dont know if it lives up to the hype. The wait times are very long unless you can go before the rush hits.", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Annie Cho"}, "479": {"review": "I loved this place! \n\nGot the curry puffs to start and they were really good. \n\nI got the Sukhothai Pork Noodles Soup which was awesome!\n\nService was excellent, I had a couple of the Thai beers which were great as well.\n\nEverything looked so good here, I was tempted to get more but we were so full by the time we were done.\n\nIt is a very small place though so you will probably have to wait. They take your name and number and call you when your table is ready. We just went to the bar next door, so it worked out well for us.", "time": "5 years ago", "rate": "Rated 5.0 out of 5,", "name": "Malinda LaBar"}, "480": {"review": "Often a queue to get a table but worth the wait for the food", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Jonny Dow"}, "481": {"review": "I have eaten in Pure Thai many times! It is by far the best Thai restaurant in the mid town area. Don't be put off by the wait for a table as the food is well worth it! The only bit of advice I would give is that this is not a restaurant where you can have a leisurely meal and you can sometimes feel a little rushed but all in all a great restaurant and it is reasonably priced.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Z J"}, "482": {"review": "It was a pleasure :)", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Steve C."}, "483": {"review": "Their Pad Thai is fantastic and there are always fun specials so do ask for those! Always a short wait as it is so popular but they manage this well and we always find it well worth the wait.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Angelika Rauh"}, "484": {"review": "Small place but the food is excellent. I had the carb and pork dry noodle.", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "sam li"}, "485": {"review": "Food was really fresh and tasty and very spicy (as ordered) vibe was fun and hip", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Kelsie Davies"}, "486": {"review": "Had sukhothai egg noodle & thai milk tea 👍   so good I finished everything! Very polite and friendly staffs. Will definitely come back here next time i'm in nyc", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "piyanun pornphonwat"}, "487": {"review": "Great food poor service. Always ask for change when you pay with cash.", "time": "a year ago", "rate": "Rated 1.0 out of 5,", "name": "tub63010"}, "488": {"review": "One of the most popular thai places currently in Hell's Kitchen. A small restaurant with tight seating and usually a wait. The food itself was pretty good but didn't live up to the expectations from other reviews. The seafood pad thai was above average but not great.", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Chris Miao"}, "489": {"review": "Disorganised and rude staff.", "time": "9 months ago", "rate": "Rated 1.0 out of 5,", "name": "Louise Boyle"}, "490": {"review": "Truly amazing Thai food... The special was wonderful", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Tom Bell"}, "491": {"review": "Tight space, long wait..BUT..the food quality was definitely worth it.  Would recommend going here if you make a reservation.  If you want a quick bite you might want to go during \"off peak\" hours.", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Dencil Smith"}, "492": {"review": "Super fast service, fresh food, uncomfortable seats but worth the pain for the great food. A little on the pricey side for what it is also.", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Julie Arora"}, "493": {"review": "It’s a cool little place, cosy seating and a small but excellent menu.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Justin Mckie"}, "494": {"review": "Authentic Thai Cuisine with authentic Thai experience. Definitely recommend!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Pat V"}, "495": {"review": "Amazing place food was incredible. Highly recommend.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Laura Mason"}, "496": {"review": "awesome spot for thai. my favorite in the city.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Ambry Kinnel"}, "497": {"review": "Great food. Great price. Will definitely eat here again. ", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Mohsin Saber"}, "498": {"review": "The wait can be a bit long, but well worth it. The food is superb, very authentic. Beware, beware, beware, the spice levels of the food are serious, this place does not hold back on the spice.  This is not your run of the mill type of heat.", "time": "6 years ago", "rate": "Rated 5.0 out of 5,", "name": "K Jay"}, "499": {"review": "An awesome spot with great food. There's a catch though: prepare to wait at least 30 min to seat. But, without a doubt, it's worth the wait.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Nuno Lapa"}, "500": {"review": "DELICIOUS! My friend and I walked here after a performance at Lincoln Center and it was a GREAT find!! The pad see ewe was delicious. And the Thai Iced Tea? I don't think I've had it better! My friend had the shrimp pad thai which was also super delicious! It's a smaller place and they seat you with other people at bigger tables which is actually kind of cool. But the ambiance is great and the staff is super nice, definitely coming back here again!", "time": "7 years ago", "rate": "Rated 5.0 out of 5,", "name": "Tanya Barrios"}, "501": {"review": "Small place but nice food!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Fangyuan Cao"}, "502": {"review": "Wow! Really impressed with this little thai restaurant. We came on a Sunday night at 8pm and it was packed!! The wait was 1.5hrs, so we decided to get it to go and eat at home. Not a bad idea! (The food only took 15min to prepare).\n\nThe pork and egg crab noodle was a really nice dish to start with especially if you pour in the sauce it comes with so it gives it that little sour taste. Really opens up your appetite. \n\nThe curry puffs were surprisingly yummy! I was expecting it to be super dry and since its take out for the puff part to not be very good anymore. But the puff was holding up really well! Very fluffy and not dry at all. \n\nThe crab fried rice was amazing! (We ended up having some left over and I heated it up in the microwave the next morning and still tasted superb). I'd recommend adding some chili flakes they give you and some lemon if you like it slightly sour. \n\nThe chicken wings were also good but not mind blowing so next time I would skip this one and try something else. \n\nAffordable and authentic thai.", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Rohenne Lee"}, "503": {"review": "Great little hide out and the food was so tasty. Really speedy service and were very attentive! Highly recommend ", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Mariana Mancellos"}, "504": {"review": "Amazing spicy food! Friendly service and nice atmosphere!", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Nikos Krodiras"}, "505": {"review": "Some of the best thai food available, the Nakorn-Patom Duck Noodles Soup was especially notable. The space is tight, but the service is good.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Martin Decker"}, "506": {"review": "Authentic and delicious meal. The service was great and the staff is very attentive! We will definitely visit again!", "time": "4 years ago", "rate": "Rated 5.0 out of 5,", "name": "Marivelle Baumgarten"}, "507": {"review": "VERY GOOD FOOD A LITTLE BIT PRICEY BUT FOOD AND SERVICE IS GREAT", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Morris Goldberg"}, "508": {"review": "Excellent food. Long waits.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Adam Haviland"}, "509": {"review": "This is the best Thai food I have had in NYC! Quick and comfortable service", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Steve Bronder"}, "510": {"review": "Nice restaurant and good thail good as if were in Bangkok. Booking is mandatory", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Olivier DUPONT"}, "511": {"review": "Very nice place, really friendly and helpful staff and most of all delicious food. A visit in Pure Thai Cookhouse has strengthen my belief that thai cousine is the best in the world!", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Katarzyna Świątkiewicz"}, "512": {"review": "Coming back from watching a broadway show, we came across this place and decided to give it a try. It was delicious! We got pad see ew and green papaya salad. Very good, and waiters were very attentive. The place is super tiny and a bit crowded, but it had a very lively atmosphere, so I didn't mind it.", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Nathan Chan"}, "513": {"review": "Favorite Thai spot in the city. Ratchaburi Crab & Pork Dry Noodles\nare my main squeeze.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Adrian Mojica"}, "514": {"review": "Awesome Thai place in Hells Kitchen. Food is nice and spicy like real Thai food unlike RoomService or other so called \"Thai\" restaurants I've tried in the area. Only downside is that it's a tiny place and is usually packed. ", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Stephen DeGuglielmo"}, "515": {"review": "Good food. I liked the experience. Wait time was a little long but otherwise good.", "time": "2 years ago", "rate": "Rated 3.0 out of 5,", "name": "Mirah Wilson"}, "516": {"review": "Great Thai food. Small hole in the place but very good food. The Staffs are friendly and the price is just right.", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Felix"}, "517": {"review": "This place has a smaller menu than most of the other thai places in the area... and that's a good thing!\n\nFood:\nFavorite is the Ratchaburi Crab & Pork Dry Noodle. It's not spicy at all, but it packs a ton of flavor! They have a few other dishes, but just order this and you won't regret it.\nThey also have a board with daily specials, this time they had some shrimp/chicken dumplings, pretty good.\n\nService:\nThe wait can be long, but they will take your phone number and give you a call. You can also choose to wait on the bench inside, but keep in mind it's a tight space. The servers are very attentive and quick.", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Hansel B."}, "518": {"review": "Just arrived in NY & already got Burger.\nLooking for spicy stuff now & Pure Thai is the REAL thing ... tried severally plates and simply awesome !!!!", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Manu Prete"}, "519": {"review": "Really authentic good food! Also the takeaway is good", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Maarten - Alexander Jongepier"}, "520": {"review": "Ok food,  poor atmosphere, really bad music choices.", "time": "a year ago", "rate": "Rated 2.0 out of 5,", "name": "Ceris"}, "521": {"review": "Great food, nice staff, authentic", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Christian Schütz"}, "522": {"review": "This little Thai joint is one of the best Thai's in the city!  If only they had more seats - there's always a wait.  Beware, when they say spicy, they're not kidding!", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Al Cohen"}, "523": {"review": "Wow!!!! What a great Thai spot that I wish I would have found this awesome place  months ago.  I was at Herald Square and craving some good Thai food.  Thai food happens to be my favorite type of food.  I hopped on Yelp and read the reviews of several nearby Thai restaurants and the reviews from this spot grabbed me.  \n\nVisited this spot around 2pm on a weekday and it wasn't too busy.  I was seated immediately by a very welcoming staff.  I loved the decor of the space all the way down to the bathroom.  They have bar seating along the wall for parties of one.  I ordered the Wok Basil with Shrimp.  I order Thai Spicy or Thai Hot.  I guess that is the hottest level of spice.  The dished arrived pretty fast and I want to say under 10 minutes.  Immediately first bit I was in love.  It was bursting full of flavor.  I will admit I love spicy food and I love it REALLY REALLY hot.  But I think I might have over step my boundaries.  It was a little more hot than what I thought it would.  So what I recommend get it medium or mild and ask for extra sauce that way you can add a little heat as you go.  Reason I mention this is because there ARE NO RETURNS ON THE FOOD and they will let you know of this as well. \n\n They also sell wine and beer at this location as well.  Great restaurant and a new favorite for Thai food when I am in this area.", "time": "4 years ago", "rate": "Rated 5.0 out of 5,", "name": "Dominek Tubbs"}, "524": {"review": "Best Thai food I've had! Fast service and friendly staff... Only downside is the amount of space for dining, it's really cramped. I would certainly recommend to anyone though.", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Kyle Moore"}, "525": {"review": "So delicious! Went for lunch, quickly seated and food arrived quickly. All items were fantastic, had the pad king kai and my friend had the tumeric beef. Really impressive taste, will definitely be back multiple times!", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Ajul Shah"}, "526": {"review": "A bit pricey", "time": "6 months ago", "rate": "Rated 4.0 out of 5,", "name": "Linh Đoan"}, "527": {"review": "Cozy atmosphere, big dishes for a decent price, and really delicious versions of Thai street food. Long waits, just be aware of that.", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Kimberly Worsham"}, "528": {"review": "Authentic atmosphere but food was so so. And they get tips on tax as well,  not just on the food itself.", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "Amy Poyung Jung"}, "529": {"review": "Among the many many Thai restaurants dotting this stretch of 9th ave, Pure Thai stands out!  When you walk in there's usually a line, so its best to prepare for a short wait.  The Thai food here is pretty authentic, and trades quality for massive portions, which I prefer.  I recommend the Som Tom salad with the crab! and one of their noodle soups, which very much remind me of the stalls I visited in Bangkok. If you have room try the sticky rice dessert, while I'm not usually a fan, theirs is pretty awesome.", "time": "7 years ago", "rate": "Rated 5.0 out of 5,", "name": "Fausto Palazzetti"}, "530": {"review": "Tasty noodles. Good texture. Thai iced tea isn't too sweet. ", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Karim D"}, "531": {"review": "Strongly recommend to visit there at opening time so that you avoid the long waiting. There are reasons why many people line up.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Hoisoo Cho"}, "532": {"review": "Great place! Limited seats available and it's popular, so don't mind waiting. Food is excellent.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Pieter Sijmons"}, "533": {"review": "There Pad Thai is sooooo good!", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Betty Ho"}, "534": {"review": "Almost authentic Thai style noodles. A large menu for such a small space. Be prepare to wait at least 20 mins. Prices a bit high for the type of fare, but there is really no other competition in Manhattan selling this type of food.", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Tim Tsai"}, "535": {"review": "Very weird music mix in a small place. All of the food was good and served quickly.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Shannon Kauderer"}, "536": {"review": "Nice food, slightly packed thou", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Lisa Cheng"}, "537": {"review": "amazing thai", "time": "10 months ago", "rate": "Rated 5.0 out of 5,", "name": "Jeremy Garcia"}, "538": {"review": "Awesome authenticThai food! Pad see ew  is always a go-to", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Catherine Wen"}, "539": {"review": "My mouth waters when I think of this place. But it's just too cramped. The tables are tiny and there's never enough room for all the plates. And trust me you'll want to order everything on the menu. Look at the specials board - you can't go wrong ordering from there. Best Thai in Manhattan, imo.", "time": "6 years ago", "rate": "Rated 5.0 out of 5,", "name": "Rachelle Young"}, "540": {"review": "Very trendy and small Place, full of people, great atmosphere, I was waiting for 1 person table 1 hour to find out that the food is very basic to my opinion, papaya salad we great. ", "time": "2 years ago", "rate": "Rated 3.0 out of 5,", "name": "Ido M"}, "541": {"review": "We love the good here, have to stop here everytime we are in NYC !", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Sirinuch Nichols"}, "542": {"review": "Great Thai food and reasonably priced", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Dougie Willins"}, "543": {"review": "Good food. Service was pretty fast. I liked vegetarian dumplings, and fried rice.", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Sarab Lamba"}, "544": {"review": "Outstanding Thai food and good value.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Mahmud Jamal"}, "545": {"review": "Food was fantastic. Atmosphere is great and staff are friendly. ", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Ken Perera"}, "546": {"review": "Like their noodle soup", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Thomas Chan"}, "547": {"review": "Food is overall very good, but the style is clearly altered to appeal to the American palate. You won't get any famous Thai spiciness here unless you ask, or it's explicitly marked on the menu. Very flexible about substitutions.", "time": "6 years ago", "rate": "Rated 3.0 out of 5,", "name": "Elan Kugelmass"}, "548": {"review": "I had a craving for Thai food and this place really hit the spot! I came for dinner and waited for 45 minutes. I tried the curry puffs, pad thai, and pumpkin sticky rice. The puffs were amazing! They were soft and so delicious. I was only going to have one, but I couldn't help it and ate two. They are pretty sizable. The pad thai was just as good as you would imagine. The pumpkin sticky rice dessert was a real treat! If you like pumpkin flavored things, definitely try this out! It was delicious!", "time": "4 years ago", "rate": "Rated 4.0 out of 5,", "name": "That L"}, "549": {"review": "Stumbled upon Pure Thai after seeing the insane crowd at the Ramen place around the corner. Pure Thai did not disappoint and was arguably the best Thai food I've ever had. The food was packed with flavor and the perfect amount of spice (I'm a believer in Thai food being a whole body experience, complete with beads of sweat). Their selection of Thai beers was appreciated, allowing me to order both of my favorites - Singha and Chang. Since leaving NYC, I think back on that meal and wish there was a Pure Thai close to home. ", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "John M"}, "550": {"review": "Did takeout. Dumpling and papaya salad were good. The rest was so so.", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "Xinmei Cai"}, "551": {"review": "Best thai", "time": "10 months ago", "rate": "Rated 5.0 out of 5,", "name": "Brandon Tambling"}, "552": {"review": "The best Pad Thai I have ever had. A little gem. Long wait times at peak hours. ", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Kiran reddy"}, "553": {"review": "Best Thai food I've ever had. Their pad thai and chicken curry puffs are amazing. The prices are very reasonable, like other thai places.\n\nThe wait time is usually long, so if you're on a hurry, order online ($20 min).", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Diego Cavalcanti"}, "554": {"review": "Went to this restaurant for the first time and will not go back again! Disappointing! Gave 1 star because I wanted to leave a comment, otherwise, this restaurant doesn't deserve a star at all.\nAwful food with very limited selection. Only 1 choice of dessert. Not authentic thai food. Portion of main couses were small and tasted worse than fast food. It was so awful that we didn't finish the main courses despite our hunger. \nWas extremely shocked when the waitress came back to inform us that our tips were insufficient as they charged 18% minimum. It was written on the bill that 18% tips for a  party of 5 and above but there were only 4 of us.\nService was not great and they didn't deserve even a 10% tips from us. Eventually we topped up the tips to 18%. My 3 friends and I unanimously agreed that we will not go back to this restaurant ever again!", "time": "3 years ago", "rate": "Rated 1.0 out of 5,", "name": "Felicia Ong"}, "555": {"review": "Food was good. Didn't like that they say someone else at our table though.", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Edward Valencia"}, "556": {"review": "Best Thai in Hell's kitchen. Authentic, fun atmosphere, and worth the wait.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Jonathan Wood"}, "557": {"review": "Best thai food in whole New York. I would recommend to reserve a table.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Marco"}, "558": {"review": "Consider me unimpressed.\n\nAfter a 30 minute wait and being literally crammed into bar seating, my friend and I ordered two Pad See Ews with beef as part of our annual New Year's Day meal. We were both disappointed. I did not like broccoli...the stems were too thick. There was too much sauce and the flavor was just off. I have had much better Thai throughout the city..I would go to Ruay Thai over here any day of the week.", "time": "4 years ago", "rate": "Rated 2.0 out of 5,", "name": "Nikki Adelman"}, "559": {"review": "Found this place on Zomato and decided to check it out while on a daytrip to NYC.  This was the best Thai food I've had (ordered Chicken Pad Thai).  Portion was very generous and prices were cheaper than I am accustomed to paying in Connecticut.  Wait was about 35 minutes as the hostess had told us.  Once we were inside, we received very attentive and polite service.", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Greg Kirby"}, "560": {"review": "Ratchaburi Crab and Pork Dry Noodles is totally the way to go. The homemade egg noodles is where it's at. It has a nice texture and it works well in the dish. \n\nI also had the Sukhothai Pork Noodles which packs a whole lot of flavor in the broth. It's spicy and tangy and has a certain depth to it that's beyond your typical Tom Yum soup. \n\nLove it!", "time": "6 years ago", "rate": "Rated 4.0 out of 5,", "name": "Regina Chan"}, "561": {"review": "Very busy we got takeaway so quality was not as good a hyped up to be. Decent meal", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Roy Lambert"}, "562": {"review": "We truly did not mind the location we found it very quaint, HOWEVER, we DID mind the pad thai. Flavor was not good and the smell just hit our noses aaallll wrong.  Wanted something different to eat that night BUT that did not make the grade.  We ended up ordering another dish for my poor husband and we enjoyed the rest of the food.", "time": "3 years ago", "rate": "Rated 3.0 out of 5,", "name": "FC Dee"}, "563": {"review": "Horribly rude and pretentious.  They're a tiny cramped place in a busy part of Manhattan.  They rush people in and out.  We were in a hurry, and my girlfriend was there ready to be seated and order for us so that the food would arrive around the time I did so we could eat and go.  They wouldn't seat her.", "time": "3 years ago", "rate": "Rated 1.0 out of 5,", "name": "Clayburn Griffin"}, "564": {"review": "Good tahi eatery. The noodles are quite good. The service is fast but the place is usually packed at peak hours.", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Jamie Matthews"}, "565": {"review": "This place is amazing. Service is quick and sweet, amazing place for perfect food!", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Ella Erwin"}, "566": {"review": "My boyfriend and I visited this place randomly, there was a thirty minute wait but we are so glad we did. The food was savory and delicious, though the place is small this is the most delicious authentic Thai I've had in New York. Definitely will be back soon to try more dishes. ", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Sarah Fris"}, "567": {"review": "If you are looking for some tasty Thai cuisine that is not like your typical thai restaurant.  Stop by and try the noodles, I took the advice from the staff and had the \"Ratchaburi Crab & Pork Dry Noodles\" you can opt for the broth on the side.  You will not be disappointed.", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Christopher Bacayon"}, "568": {"review": "Just delicious!", "time": "9 months ago", "rate": "Rated 5.0 out of 5,", "name": "Lavinia Wagner"}, "569": {"review": "\"When will 9th avenue be renamed \"\"Little Thailand\"\"? Regardless, Pure separates itself from the others by having a unique menu (yes, I'm saying that about a Thai restaurant) that has noodles in almost every way and spice level imaginable. Very tasty, and incredibly attentive service make return visits easy, though it can be cramped, and chairs would be better than stools. \"", "time": "7 years ago", "rate": "Rated 4.0 out of 5,", "name": "Andy Hollander"}, "570": {"review": "Excellent service, food , staff , atmosphere ETC", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "alex chino"}, "571": {"review": "Excellent  authentic Thai food in a quirky whole in the wall type restaurant. Limited seating, though excellent service. \nIf you love Thai food, you should give Pure Thai a shot.", "time": "5 years ago", "rate": "Rated 5.0 out of 5,", "name": "Mandeep Gill"}, "572": {"review": "Great food and great price. The service is really good and fast.", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Frank Pimentel"}, "573": {"review": "Service was a bit slow but the food was tasty.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "alex oberoy"}, "574": {"review": "Great food, small place", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Elizabeth C"}, "575": {"review": "I came with a friend and was totally impressed by this place.\n\nAmazing Thai food at affordable price. Buzzy and lively environment, quick service.\n\nWhat else do you need?", "time": "5 years ago", "rate": "Rated 5.0 out of 5,", "name": "Jing Tang"}, "576": {"review": "Is there any way to give 0 star???\n\nOutrageous is my first and only impression to the way how this seemingly popular restaurant treated its customers. From the right beginning when we walked into this restaurant, the atmosphere didn't feel right. We were seen as 'invisible' by the staff there even though several tables were already cleaned up and ready to serve. The waitress skipped us anyway, and started serving the person who arrived after us. Hey, come on, are you blind???\n\nWe had to ask for being seated. However, you know what, we were even not allowed to choose where to seat. Funny, right?!\n\nDuring the entire stay, we were treated as 'invisible'. No staff served us water, or, even made an apology for not being attentative. We were just treated like third-class citizens. \n\nFinally, we raised our voice to get the attention from everyone who was dining there. This time the staff there was no longer DEAF and BLIND. But again, they just don't care about customers. Their attitude just really made people sick and pissed off!\n\nWe didn't dine there at all, and left with disappointment!!!\n\nSo, we cannot speak for the food quality there. But, if you want to have 'invisible' experience, we will definitely recommend this restaurant!!!", "time": "4 years ago", "rate": "Rated 1.0 out of 5,", "name": "MIKE R"}, "577": {"review": "Authentic Thai street food in an efficient locale with prompt service. #trendy", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "C. Alex Osteen"}, "578": {"review": "Great food, atmosphere is very lively. The place is pretty tiny though and you can expect some wait time during the weekends.", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "M K"}, "579": {"review": "Awesome experience & food for central NYC. So cheap as well! ", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Thomas Hill"}, "580": {"review": "Amazing Thai place. Pad see ew, curry and mango sticky rice highly recommended.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Isaac Katz"}, "581": {"review": "Delicious food but crowded inside the restaurant. I recommend ordering to go!", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Helen Ye"}, "582": {"review": "Quick and friendly service and the food is amazing. Highly recommended!", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "James Cartwright"}, "583": {"review": "Pure Thai's menu differs from the ubiquitous standard Thai restaurant menu in a good way. Truly delicious every time I've been. Please open one on the east side!", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Aaron Jeffries"}, "584": {"review": "The prizes are a little bit over average. The waitress wasn't happy with the tip and started to discuss in front of the other guests. Not acceptable.", "time": "4 years ago", "rate": "Rated 1.0 out of 5,", "name": "Markus Kantauer"}, "585": {"review": "Omg the food!!!! Yummmmmmm! And great value for money! I would come back anytime! ", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Amrita O'Sullivan"}, "586": {"review": "The service was awful! We waited more than an hour and they gave away our table to another party that had arrived after us. They didn't even give us a call; it was only by pure luck that we checked in when we did. The food wasn't anything special and kind of overpriced for the portion size and quality. I would not come back.", "time": "4 years ago", "rate": "Rated 1.0 out of 5,", "name": "Maryann Yin"}, "587": {"review": "Authentic Thai Foods!!", "time": "8 months ago", "rate": "Rated 5.0 out of 5,", "name": "Hyun Ah Song"}, "588": {"review": "My wife and I ordered the Beef Buns for an appetizer with Pad Thai and Pad See Ew for our entrées. Everything was absolutely delicious, including the teas we ordered. The staff was friendly and the atmosphere was lively. Loved it! ", "time": "4 years ago", "rate": "Rated 5.0 out of 5,", "name": "Denis Burr"}, "589": {"review": "A solid Thai spot in Hell's Kitchen, Pure Thai can get packed pretty easily and there's a reason why there are often lines out the door. The variety of food here is surprisingly solid across the board; the noodles, rice dishes, somtums, and soups are all delicious and served right out of the kitchen. Although seating is a little awkward with the brightly colored, metallic stools, it's worth a few moments of discomfort for the food.", "time": "5 years ago", "rate": "Rated 4.0 out of 5,", "name": "Lori Luo"}, "590": {"review": "Great thai food. It is simply delicious. I and my friends really loved the dishes. We had to wait a bit but the food made the waiting worth the time. The price is ok, after all this is NYC. Portions are decent. The food comes out quite quickly. Personally, loved all the dishes. Friends said it was ok. Overall, everyone was satisfied.", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "pureum kim"}, "591": {"review": "Very rude customer service the wait staff is very impolite, very small restaurant .when we were halfway through our meal , they kept rushing us to pay our check . They did not even say excuse me they stretched their whole body in your face without even saying excuse me and start clearing the table. They seemed in a hurry or a rush to get us out of there  to get the next set of people in. We felt like animals getting ready to be slaughtered.", "time": "2 years ago", "rate": "Rated 2.0 out of 5,", "name": "MAUREEN BELISLE-LEONG"}, "592": {"review": "Small space.  Expect long waits but the food is totally worth it. ", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Sue Lee"}, "593": {"review": "The best thai food in Hell's Kitchen. And that's saying a lot. Good delivery too. ", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Mitch Roth"}, "594": {"review": "Their tofu is some of the best I've ever had. Really nice and flavourful dishes.", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Lamya Ezzeldin"}, "595": {"review": "Top notch. Get ready for next level spicy if you order a soup", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Yoni Kavakeb"}, "596": {"review": "There are a TON of Thai restaurants on this strip of Ninth avenue and this noodle shop is hands down the best. While the others are dishing out typical options like tom yum soup and pad kee mao -this joint is doing more interesting takes on traditional fare. The dry noodles with pork and crab  are excellent. The narrow room can get crowded - it's best when you're in the mood for solo dining - there's usually a single stool available at the counter. ", "time": "7 years ago", "rate": "Rated 4.0 out of 5,", "name": "James Mulcahy"}, "597": {"review": "Pad Me Bo-Lan was great!! Always a wait. Get the Thai iced tea too! ", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Guha Arunkumar"}, "598": {"review": "Great tofu noodles for the price.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Abiram N"}, "599": {"review": "I am a picky person when it comes to thai. this food is authentic and delicious and high quality for inexpensive price. Finally found a good thai place!!", "time": "4 years ago", "rate": "Rated 5.0 out of 5,", "name": "Ijeoma Nwaogu"}, "600": {"review": "Super authentic Thai food that is absolutely delicious, but doesn't hold back on the spice. Seriously, I made the mistake once of assuming that it was your garden variety bland Thai place and ordered the extra spicy and was tearing up with every bite. But having said that, they do their basics well: the pad se ew was probably the best rendition I've had in midtown and they also offer other dishes on their menu that isn't listed in your average Thai place. The place is tiny but cute, and great if you ever need a dose of Thai pop music in your life. It's my go-to place whenever friends come to town, and I almost don't want to post this because then I'd have to share this place with more people.", "time": "6 years ago", "rate": "Rated 4.0 out of 5,", "name": "Penny Zhu"}, "601": {"review": "Authentic. Tasty. Go get it!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Roger James"}, "602": {"review": "Very authentic Thai food.  \n\nHad the pad prig khing.  Ordered spicy and loved it", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Ken Miller"}, "603": {"review": "Good prices and great food. True thai flavours and the best duck noodle soup in hells kitchen.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Hugo Palomares"}, "604": {"review": "Food is excellent!! BUT the wait is unbelievably long and the information about it is nor clear neither accurate, on several occasions. A pity that's the service is so disappointing.", "time": "4 years ago", "rate": "Rated 3.0 out of 5,", "name": "Julie Lagauzere"}, "605": {"review": "One of my favorite thai", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "j lee"}, "606": {"review": "I had a wonderful experience, food and service were excellent.i would recommend this  place to the entire world. We had a party of 6 and only waited 10 mins but i overheard the waiter telling a party of 2 that the waiting time was almost and hour for them.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "dionisio diaz"}, "607": {"review": "Good service but foods are too sweet", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "solo sign"}, "608": {"review": "Best Thai food in NYC!! The ratchaburi dry noodles with pork and crab is to die for and so is the Thai Iced tea 😊👍", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Girish Ramdas"}, "609": {"review": "Good food, restaurant very narrow so all tables are close together, Food very good and reasonably priced for NY", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "John Maughan"}, "610": {"review": "Small premises but food is authentic. Good ambience.", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Grace Lee"}, "611": {"review": "Awesome food. Don't forget to ask what is the special of the day, you might get surprised!", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Hector Oseguera"}, "612": {"review": "Come here for awesome, authentic Thai food! I highly recommend the Ratchaburi crab thai noodles. They are simple yet tasty. Prices are also reasonable, but expect a wait.", "time": "6 years ago", "rate": "Rated 4.0 out of 5,", "name": "Lisa Cao"}, "613": {"review": "The best Thai kitchen in New York", "time": "11 months ago", "rate": "Rated 5.0 out of 5,", "name": "ישראל יניב"}, "614": {"review": "Beef really amazingly delicious!!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Jie-Wei Wu"}, "615": {"review": "Very small, so you'll have to wait if you go here.  Food was good, service was good.  I'd go to it again but it wasn't anything special to me.", "time": "6 years ago", "rate": "Rated 4.0 out of 5,", "name": "Chris Marino"}, "616": {"review": "Place to be. Cannot guarantee that you can get in. Open for lunch at 12:00 and full by 12:05. But if you are the lucky one, it is worth it. ", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Sujarit Chermsirivatana"}, "617": {"review": "Delicious duck noodles soup \nStaffs are friendly", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Leisurely Grass"}, "618": {"review": "Great food!", "time": "11 months ago", "rate": "Rated 5.0 out of 5,", "name": "Hai Bechar"}, "619": {"review": "Very nicely done dishes, properly seasoned and gloppy like at most Thai places. To bad the vegetarian options are quite limited.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Gregor J. Rothfuss"}, "620": {"review": "I would come here just for the thai iced team. I stumbled upon this place while I was waiting for Totto ramen for too long and I just walked down the street to eat something.  This place is cozy and personal, and if I'm in the area, I'd definitely go again. After being robbed from noodles, I decided to get some noodle soup dishes. Not bad at all... I was rather pleased of the quality and this place exceeded my expectations", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Clemens Wan"}, "621": {"review": "Amazing Thai food I'm a hole in the wall style restaurant. We told them we had a show to see in an hour and our food was brought out to us within 10 minutes of ordering. ", "time": "4 years ago", "rate": "Rated 5.0 out of 5,", "name": "Teddy Soares"}, "622": {"review": "Good real thai food, nice ambient and friendly staff. My recomondation", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Silvan S."}, "623": {"review": "Very cozy place :) very street food style! One of the better Thai places in New York! ", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Susie Su"}, "624": {"review": "I'm not well knowledge in Thai street food. \n\nMy gf's Pad See Ew was heavy on the sauce. I got the fresh pulled noodles with pork. \n\nSeating is small and limited. \n\nBathroom has a sliding door. I want for my bathroom. \n\nI'd come back for those noodles again and the hipster vibe.", "time": "5 years ago", "rate": "Rated 4.0 out of 5,", "name": "Christian Lau"}, "625": {"review": "A hole-in-the-wall, reasonably priced place with mouth-watering food. There's usually a wait time, but they do agree on taking your orders before hand, while you're waiting,  so that the food arrives right after you're seated.   Probably depends on the Matire d', but worth a try as it saves time.\n\n Their 'Fried Rice With Lump Crab Meat' is to die for! Jungle curry fried rice, although slightly spicy is amazing too.  Thai ice tea is another favorite.  One of the best I've had in town. 'Wok Chilli Turmeric with Chicken' is good too.  My most favourite thai restaurant in town!", "time": "4 years ago", "rate": "Rated 5.0 out of 5,", "name": "Rashmi Joishi"}, "626": {"review": "wait was not too long, atmosphere and decor is urban environmental chic. service is quick, friendly and efficient and the food is scrumptious!", "time": "5 years ago", "rate": "Rated 5.0 out of 5,", "name": "Ms Sparkles"}, "627": {"review": "Disappointing.  Couldn't finish the chicken satay, chicken was rubbery.  Main course was better - sauce had good flavor, shrimp was okay.  ", "time": "2 years ago", "rate": "Rated 2.0 out of 5,", "name": "Grayson Witcher"}, "628": {"review": "Best Pad Thai I've ever had in my life hands down.", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Jaime D"}, "629": {"review": "Love this place! Hate to wait in line for a table (can get up to 30 min wait!!), but the food is worth it. Prices are O.K and the service is quick.", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Yael Rimon"}, "630": {"review": "Not your traditional Thai place. The menu is great and the specials never disappoint. Well worth the long waits at times.", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Randy Diaz"}, "631": {"review": "Was very busy and food was just OK IMO. Service was great, unusual for a Thai place, lol", "time": "3 years ago", "rate": "Rated 3.0 out of 5,", "name": "Robert K"}, "632": {"review": "Nice place, very good Thai food. Try the noodles ", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "GianPaolo Blasone"}, "633": {"review": "Recently came with my girlfriend (who is Thai), and we really enjoyed the three dishes we got: Nakorn Pathom Duck (we replaced rice noodles with egg noodles), Sukhothai Pork Noodle, Ratchaburi Noodle with Crab and roast pork. My girlfriend guaranteed me that it is extremely close to what she would have at home! I also really liked the Thai Iced Tea, possibly the best I've had in the city thus far.", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Nicola Benatti"}, "634": {"review": "Noodle soup is tastier than the dry noodles. Chicken curry puffs are good too", "time": "7 years ago", "rate": "Rated 4.0 out of 5,", "name": "Andrew Levine"}, "635": {"review": "Don't expect to lean back on your chair or have a good place for your coat. Awesome peanut sauce and dumplings", "time": "6 years ago", "rate": "Rated 4.0 out of 5,", "name": "Jenna Leder"}, "636": {"review": "The quality and authenticity of the food here really sets it apart from the many other Thai venues on 9th avenue. Come here for the noodle soups and also get the Thai iced tea or iced coffee here: the crushed ice that it's served with here really keeps the consistency of the drink (instead of having a watered down drink at the end when using regular ice).", "time": "7 years ago", "rate": "Rated 4.0 out of 5,", "name": "Emily Chu"}, "637": {"review": "Everything we ordered was unreasonably spicy. My fish ball soup was almost inedible. Still laughing about it. Service was good.. very friendly..", "time": "3 years ago", "rate": "Rated 3.0 out of 5,", "name": "Jared Wick"}, "638": {"review": "Excellent wok. Surprising pumpkin custard", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Bernat Pérez de Val"}, "639": {"review": "Great food, service and everything else. ", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Tim Fink"}, "640": {"review": "Small, cozy spot, very attentive polite service... Ordered Beef Buns (Fine), Wok Chili Pepper with Chicken (Good), Nakorn-Patom Duck Noodles Soup (Very Good). ", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Jack Bloom"}, "641": {"review": "Good Thai food option at very decent prices. Loved the spice level adjustments to suit my extra heat loving taste buds. ", "time": "5 years ago", "rate": "Rated 5.0 out of 5,", "name": "Rahul Narvekar"}, "642": {"review": "I highly recommend this place, for its delicious food, for the decent  price and big serving.", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Ke Z"}, "643": {"review": "Authentic Thai soup bowls! Very interesting flavors. Different from other Americanized Thai restaurants.", "time": "8 years ago", "rate": "Rated 4.0 out of 5,", "name": "Paul Cheong"}, "644": {"review": "The soups are pretty close to what I had in Thailand. The food is excellent. ", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Chris Reilly"}, "645": {"review": "I've never been to a thai place in NYC that has a menu like this.  Having gone to Thailand for a food trip, it seems like 1/3 of the menu has dishes from Northern Thailand (educated guess).  I'd say it's pretty authentic as they use real Thai ingredients instead of substitutes like kaffir lime leaves, lots of tamarind and even Thai eggplants (small green round eggplants the size of a lemon).\n\nEverything was cooked very well and had distinct clean flavors.  We got the spring rolls, fresh rolls (these were interesting and yummy, try them!), curry paste with pork, and the ratchaburi noodles (totally mispelling...) with pork and crab.  The noodles were simple and light.  The pork was tender.  I got the noodles dish because it was recommended on yelp so often but I don't think I would get it again as I want something with a little more flavor.\n\nI took my friends leftover curry paste with pork today, and wow, it's spicy but I believe she added extra spice.  It is a very flavorful, authentic Thai dish.\n\nPrices are good too.  With two appetizers (7-10 each), two meals (12 each), a bottle of wine, tax and 20% tip, the bill was about $80 for two people.\n\nI would definitely recommend it if you want a different, authentic type of Thai place.", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Sarah Kim ig lusttilldawn"}, "646": {"review": "Miss rice noodle sooooooo much. Now had one of the best in nyc. Iced Thai tea would be better if not sweet like now. ", "time": "4 years ago", "rate": "Rated 5.0 out of 5,", "name": "Lillian J"}, "647": {"review": "Quality Thai dishes that are step above many of the other Thai offerings in Hell's Kitchen. The Papaya Salad is fantastic, but the highlight was the dessert special Yam Custard.", "time": "7 years ago", "rate": "Rated 5.0 out of 5,", "name": "Mike Winston"}, "648": {"review": "Darn good Thai food! Had the papaya salad (hot and delish) noodles which were like ramen noodles (they're hand made). Highly recommended. ", "time": "4 years ago", "rate": "Rated 5.0 out of 5,", "name": "Jeff Sieben"}, "649": {"review": "The best Thai food I have ever had with non-NY pricetag.", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Seunghyun Kim"}, "650": {"review": "It's a little out of the way for pre-theater dining, but if you have enough time, it's worth the trek.The dry noodles with pork and crab are stellar - an absolute must. Since the space is fairly narrow and small, to avoid a wait, try going at lunch. ", "time": "6 years ago", "rate": "Rated 4.0 out of 5,", "name": "Jacqueline Wasilczyk"}, "651": {"review": "It's quite small but serves great noodles and has a good lunch special", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Abdul Salam"}, "652": {"review": "The atmosphere and the great noodle soup always bring me as close to BKK that I've found this side of the world. Love it!", "time": "7 years ago", "rate": "Rated 5.0 out of 5,", "name": "Thomas Wysocki"}, "653": {"review": "Super tasty Thai food.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Andy Harbottle"}, "654": {"review": "Incredibly small and busy, but it's worth the wait for some of the best Thai I've ever had.", "time": "6 years ago", "rate": "Rated 4.0 out of 5,", "name": "Mark Bennett"}, "655": {"review": "Small place but Thai food over here will remind of you being somewhere else", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "rahul gupta"}, "656": {"review": "Gtreaaat food and nice service there! Strongly recommend the baby back ribs;)", "time": "4 years ago", "rate": "Rated 5.0 out of 5,", "name": "Zijing Wu"}, "657": {"review": "Great food, great service! Small place, not good for groups ", "time": "4 years ago", "rate": "Rated 5.0 out of 5,", "name": "Tyler Thurston"}, "658": {"review": "They were able to get us in quickly, and the noodles were amazing.", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Tony Walt"}, "659": {"review": "Amazing food!! The place is cozy but the design is nice. ", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Xin Zhang"}, "660": {"review": "Small space but great food ", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Yun Xie"}, "661": {"review": "Got the Pad-se-ew. Was decent, nothing amazing. Good quick food though.", "time": "4 years ago", "rate": "Rated 3.0 out of 5,", "name": "Mani Castillo"}, "662": {"review": "Tasteful and attentive. Will come back.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Teddy Kyung"}, "663": {"review": "Seemingly authentic and cozy Thai food", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Anthony Muljadi"}, "664": {"review": "Great food if you are used to strong Thai cooking flavors", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Girish Lakade"}, "665": {"review": "Not vegetarian friendly. Menu has just a few things without fish sauce or meat, and they're not very exciting. I got the Pad Mee Bo-Lan With Vegetables, which was just bad -- the other three at the table all agreed that it was too.", "time": "2 years ago", "rate": "Rated 3.0 out of 5,", "name": "Bradley Coleman August"}, "666": {"review": "If you hold yourself and wait 10 min to get a table or seat at the bar you will inmerse in a real thai experience. The pad thai is awesome and the correct size. The spring rolls are a great apt. We loved that we can change the meat or vegetables options. The have tai beers and the people here is super friendly, in tune with the happy tai music.", "time": "4 years ago", "rate": "Rated 5.0 out of 5,", "name": "Jesi Mac Leod"}, "667": {"review": "Charming. Love the Thai music! Be careful of ordering SPICY. Opt fo rmedium. Best vegetarian dumplings!", "time": "6 years ago", "rate": "Rated 5.0 out of 5,", "name": "David Ninh"}, "668": {"review": "Pretty average Thai eatery", "time": "9 months ago", "rate": "Rated 3.0 out of 5,", "name": "Rahul Ratnagiri"}, "669": {"review": "Cramped seating and long waits. The food was fine and the prices fair, but nothing I hadn't had at other Thai restaurants before. A good choice if you can get in quickly, but not worth any inconvenience.", "time": "4 years ago", "rate": "Rated 3.0 out of 5,", "name": "Javier Kohen"}, "670": {"review": "Excellent!", "time": "8 months ago", "rate": "Rated 5.0 out of 5,", "name": "Ms. K"}, "671": {"review": "Super small space but the food is top notch", "time": "6 years ago", "rate": "Rated 4.0 out of 5,", "name": "Steven Lemeshow"}, "672": {"review": " I've been meaning to hit up Pure Thai Cookhouse for quite some time now. Luckily a few friends of mine were up for a authentic Thai experience. Inside looks as what they like to call a \"shophouse\". With wood paneling, industrial decor and a modern flair... this place is right up my alley. It's also built with a vertically oriented layout. How they fit so much seating in such little space? I'll never know.\n\nWe arrived at about 6pm on a Friday and were lucky enough to get the last seat right in the front. They brought us a nice sized carafe of water and kept our glasses full. And I now know why. I ended up ordering the Wok Basil with Chicken. Now I see that you can customize your spice level and I've never eaten there before... I'll settle on medium**. That way I can gauge for next time whether to amp it up or not. All I can say is, wow. The ground chicken and string beans were a killer. I think that chili garlic puree and holy basil sauce did a number on me. The only thing to tame the heat was that jasmine rice. Don't get me wrong, it was delicious and I'd order it again. But no 3 stars for me. I'll stick to a happy 2. \n\nWe also ordered:\n-The Chicken Curry Puffs: super flaky/crispy with a moist center. (With sweet potato, onion and a cucumber relish.)\n\n-Steamed Veggie Dumplings:My favorite app. From the looks of it, I had no idea how it was going to taste as well as texture-wise. The peanut flavor was strong which I enjoyed. Pillow-y and flavorful bites.\n\nI received a fairly amount of hype for PTC and was happily surprised to see that it's completely justified and warranted here. Service was great and we didn't feel rushed despite the incoming crowds. I appreciated the atmosphere that transported me across the world and the bold flavors that took my taste buds there as well.", "time": "4 years ago", "rate": "Rated 5.0 out of 5,", "name": "Katie Harman"}, "673": {"review": "New fav thai place in the city, hands down.  They don't sell the typical thai \"americanized\" food.  The restaurant has a nice authentic vibe where the staff say their greetings in Thai as you enter.  I came right before the dinner rush, on a rainy Wednesday it was still pretty crowded.  The restaurant is small, so I wouldn't recommend you bringing a huge group of people here.  There is a seating area along the aisle as you enter, but you will definitely bump into some people as you go in and out.  \n\nAs you wait, there are tempting thai treats along the walls and in the front -- so you can snack as you wait.  My wait wasn't that long, so I was just looking around.\n\nThere are seats along the wall as a bar, so if you want to sit face-to-face maybe you should not come as a party of 3 or you'll probably be seated there.  If you're sitting along the bar, there will be hooks below for your things and more hooks along the opposite wall.\n\nThere are specials along the walls on a chalkboard too.  The staff were quick to respond because they want you there in and then quickly out so they can sit next parties.\n\nI had the duck soup noodle and it was delicious.  The duck had enough fat and meat to taste and I wanted to drink the entire soup because of it's not too salty, but definitely refreshing taste.  The noodles weren't soggy and just had the amount of bite to them.  It wasn't too filling and it wasn't too light -- portioned just right I felt like I ate a healthy meal. I absolutely loved their hot sauce they added on the side and dumped the entire thing in the bowl.  Yum.\n\nNext time I come I will definitely try their beautiful thai iced tea!", "time": "4 years ago", "rate": "Rated 4.0 out of 5,", "name": "Pinky Chan"}, "674": {"review": "Great Thai food.  You can't loose! ", "time": "2 years ago", "rate": "Rated 3.0 out of 5,", "name": "Althea Woolcock"}, "675": {"review": "Friendly atmosphere with good lunch menu.", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Nam Nguyen"}, "676": {"review": "Super tasty and portions are not ridiculous so you can focus on the flavor.", "time": "6 years ago", "rate": "Rated 4.0 out of 5,", "name": "Patrick Wynn"}, "677": {"review": "Probably one of the best Thai Kitchens in the city and definitely the best Thai food in midtown.", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Marc Lucas"}, "678": {"review": "Great food!  Almost as good as i make at home. ", "time": "4 years ago", "rate": "Rated 4.0 out of 5,", "name": "Ryan Blakeslee"}, "679": {"review": "Great authentic Thai food in Manhattan.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Morgan Lai"}, "680": {"review": "Amazing! Life Changing! Extravagante! The Best Service I have ever had and I can say I've had really good service before! I had the chicken curry puffs for an appetizer. Then the Wok Chilli Pepper with Tulmeric for a main entrée. All my food came within about less than 15 minutes and it was pretty crowded. The food was great and I even snuck in a few chicken puffs into my bag. I ordered the mango rice cakes for desert and that was honestly the icing on the cake. ", "time": "4 years ago", "rate": "Rated 5.0 out of 5,", "name": "Eni Awowale"}, "681": {"review": "The best Thai restaurant in the city.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "JP Bernardo"}, "682": {"review": "Excellent flavors not your typical dumb down thai food.", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Philip Trageser"}, "683": {"review": "I tried the ratchaburi pork and crab noodles, krabi seafood noodle soup, and sukhothai. They were all very bold in terms of flavor. I liked the sweetness of the ratchaburi noodles. The spicy vinegary flavor of the krabi soup did not seem to mesh with the medley of seafoods cohesively. The sukhothai was an excellent dish with a good amount of sour and salty. The portions are small, but the restaurant has a lively vibe and is big on flavor.", "time": "4 years ago", "rate": "Rated 5.0 out of 5,", "name": "Bob Lou"}, "684": {"review": "Great, flavorful food. Quite distinct from the generic Hell's Kitchen Thai joint.", "time": "6 years ago", "rate": "Rated 5.0 out of 5,", "name": "Alan Pierson"}, "685": {"review": "I felt the service lacks little of human interaction. The staffs need to explain their menu to tourist.", "time": "2 years ago", "rate": "Rated 3.0 out of 5,", "name": "Konark Kambli"}, "686": {"review": "Great food,  The only drawback is it's very small so there is always a wait during lunch time and dinner time.", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "larry kaplan"}, "687": {"review": "Long lines. Loud. But the most amazing Pad Thai i ever had in my life! ", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "DMITRIY SAVCHUK"}, "688": {"review": "Very good soup and noodle... Great service!", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Jack Wang"}, "689": {"review": "Please try their spicy beef salad and pad kee mao its deliciously spicy!", "time": "6 years ago", "rate": "Rated 4.0 out of 5,", "name": "Robert Jian"}, "690": {"review": "Very affordable Thai food! With great taste. ", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Nick Jarvis"}, "691": {"review": "Always crowded but worth the wait for the best thai food in the city", "time": "6 years ago", "rate": "Rated 4.0 out of 5,", "name": "Richard Pober"}, "692": {"review": "great food- had the basil pork and it was very good as well as the thai iced tea", "time": "6 years ago", "rate": "Rated 5.0 out of 5,", "name": "Sam Johnson"}, "693": {"review": "Great food and service. Must!", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Raquel Oliveira"}, "694": {"review": "Delicious authentic Thai food. Good place for vegetarians.", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Prachy Mohan"}, "695": {"review": "Amazing food!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Andrew Sapinski"}, "696": {"review": "Fantastic food at amazing prices. ", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Victor Zhang"}, "697": {"review": "Best Thai Place in New York. You can tell by all the Thai and Asian people eating there. ", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Michael Nguyen"}, "698": {"review": "Excellent, one of the more authentic thai places I've been to in the city.", "time": "8 years ago", "rate": "Rated 5.0 out of 5,", "name": "Adam Koch"}, "699": {"review": "Aiyyeeeeeeee aiyeeee ahhhh! Pure Thai is really spicy! My goodness I hope you have a Thai Iced tea on hand to cool you down. The water makes it worse. I know this, I'm just not big on Thai iced tea. With that said, the spice level definitely says Pure Thai is legit and the same way they do it in Bangkok. Super spicy. It's an acquired taste but oh so good. It's one for the masochists. The basil beef is excellent but the celebrity dish seems to be the Ratchaburi crab noodles. Everyone gets it and loves it.", "time": "7 years ago", "rate": "Rated 4.0 out of 5,", "name": "Rachel Antonio"}, "700": {"review": "The Papaya salad with soft shell crab was awesome!", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Sharon Zimmerman"}, "701": {"review": "Try the Pad See Ew if you go, it's amazing!", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Avinash Salgam"}, "702": {"review": "Very average in terms of actual thai food. It's actually a fast food joint with bistro prices. Sitting is very tight and uncomfortable. Service is good.", "time": "3 years ago", "rate": "Rated 3.0 out of 5,", "name": "Koby Ofek"}, "703": {"review": "Overall, giving this place 3 stars because out of 3 dishes, only 1 succeeded. For 2 people, we waited for about 45 minutes.  We ordered the chicken curry puffs, beef salad, and pad see ew.\n\nWe sat at the bar and surprisingly service was somewhat decent.  The food took awhile to get to us though.\n\nThe chicken curry puffs came out first and biting into it, flavors were bland, not much curry kick, and the flour seemed under cooked.  I think previous reviewers liked the softness of it and it not being overly fried but I think it's actually under cooked.  Dish was very underwhelming.  Something that I didn't expect for thai food. \n\nThe beef salad was much much better.  The meat was about medium rare which was good.  I don't like it when the beef is like jerky, that's just terrible.  I'm glad that they did not screw up such a simple dish.  It's usually the simple dishes that are really hard to do right.  All the components of the salad worked together but I wish there was mangoes in it.  The apples were sweet enough.  My only complaint is the little white \"rocks\" seasoning, I forgot what it's called but it gives texture to the dish.  However, it got stuck in my teeth and it felt like chewing on sand.  I think they should replace it with peanuts.  It's a good dish, but it needs refinement.\n\nLastly, the pad see ew.  Noodles were excellent, dish was too sweet for me and the meat was like jerky.  I think if they didn't cook the meat that long and just made it medium rare, this would have been a better well rounded dish.  I think they cooked the meat separately, then again when the noodles were being cooked.  \n\nOne surprising thing was they every now and then they would refill our glasses with water even though we were sitting at the bar.  I was happy with that.\n\nOverall, this place really lacked flavor in the dishes that we had.  Something I don't expect from a thai place.  I expect bold strong flavors.  I've never been to thailand but I doubt their authentic dishes were bland in flavor.  I also have a suspicion that the noodles here on average is not their strong suit.  I think their wok or rice dishes would be better.  I will try that if I come here again.\n\nI would recommend The Sea in Brooklyn over this place any day.", "time": "6 years ago", "rate": "Rated 3.0 out of 5,", "name": "Leo O"}, "704": {"review": "Perfect Thai restaurant, small but with amazing dishes! ", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "flavien AMA"}, "705": {"review": "Not enough stuff on the menu. No duck. No nothing. I've been to many thai restaurants up in massachusetts where I live. Much more options on the menu.", "time": "3 years ago", "rate": "Rated 3.0 out of 5,", "name": "Michael Mcdowell"}, "706": {"review": "Pure Thai is a jewel in the rough of Hell's Kitchen's hyper streets of commuter mediocrity.  One can expect freshly rolled noodles, authentic Thai flavors, good times and long lines.", "time": "7 years ago", "rate": "Rated 3.0 out of 5,", "name": "Barbara Weisman"}, "707": {"review": "Simple presentation, but good flavors.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Jack Palevich"}, "708": {"review": "Good food, fast service", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Ashish Gupta"}, "709": {"review": "This was a terrible waiting experience. First, they told us that we are not on the waiting list after waiting for 40min, then they put us on the list with the promise we would come next, then they still did not care ... we waited more than 60 minutes on top. Never again!", "time": "2 years ago", "rate": "Rated 1.0 out of 5,", "name": "Michael Max Buehler"}, "710": {"review": "Great you must come here!!!", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "김서연"}, "711": {"review": "Had better Thai food", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "David Mciau"}, "712": {"review": "Delicious!", "time": "11 months ago", "rate": "Rated 5.0 out of 5,", "name": "Aya 33325"}, "713": {"review": "Just would like to  say if vegetarian  most of the  dishes have fish and oyster sauce except  the  vegetable  dumplings . Hence was disappointed  as we waited for  an hour to then be told it wasn't  suitable  for  us .", "time": "2 years ago", "rate": "Rated 1.0 out of 5,", "name": "Dev Rajyaguru"}, "714": {"review": "The best Thai. Period", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Derek"}, "715": {"review": "Well done. It can get really crowded but worth the wait.", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Sompob Prasertkun"}, "716": {"review": "Absolutely delicious and worth the wait!", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Sharla Hoffman"}, "717": {"review": "Amazing food and no pretense!", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Andrew Yancovitz"}, "718": {"review": "It's usually crowded but the food is worth the wait.", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Kem Alimole"}, "719": {"review": "The only real Thai restaurant in NYC", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Dion Cini"}, "720": {"review": "Amazing Thai food and cheap ", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Yuval Natanzon"}, "721": {"review": "Very tasty, friendly,  lively n happy place!", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Profmiss Sanchez"}, "722": {"review": "Really delicious Thai food. Just a little cramped and usually a long wait.", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Raviraj Gulrajani"}, "723": {"review": "Great place to get some fresh Thai food ", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "emmanuel herrera"}, "724": {"review": "This place is tiny, but the food is a cut above the neighborhood's other Thai offerings.Creative options. be prepared to share your table. ", "time": "6 years ago", "rate": "Rated 4.0 out of 5,", "name": "Bree Fowler"}, "725": {"review": "Great food and service!", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "André Borgen"}, "726": {"review": "Yum!!", "time": "2 months ago", "rate": "Rated 5.0 out of 5,", "name": "Jay D."}, "727": {"review": "Great food but hard to get a table", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Rakesh S Patel"}, "728": {"review": "Superb food ,  very clean, great service. ", "time": "4 years ago", "rate": "Rated 5.0 out of 5,", "name": "Mike M"}, "729": {"review": "Great thai food but I'm only giving it there stairs because after a 1-hour wait, we were seated in a table right next to the door which meant that we spent the whole dinner time suffering from the cold radiating from the nearby window and from each time someone entered the store.", "time": "3 years ago", "rate": "Rated 3.0 out of 5,", "name": "Fadi Wissa"}, "730": {"review": "There are no noodles in NYC like Pure Thai noodles.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Darren Mack"}, "731": {"review": "Awesome flavor", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Andre Asmara"}, "732": {"review": "Best Thai in the city! Enjoy !", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Lance Liu"}, "733": {"review": "damn good thai cookin", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Dev Patel"}, "734": {"review": "exellent!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "citizen kiu"}, "735": {"review": "Crowded. Have to wait at least half an hour every time. But the food is fine.", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Winnie Pan"}, "736": {"review": "Long wait. Small tables and small chairs. Crowded. ", "time": "2 years ago", "rate": "Rated 3.0 out of 5,", "name": "Mike P"}, "737": {"review": "Tough to get a table as its small,\nNo Tom Yum but worth the rest. Authentic Fair... ", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Preet Singh"}, "738": {"review": "Great, simple inexpensive, fast and cozy atmosphere. Friendly waitstaff", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Jonathan Raiman"}, "739": {"review": "Thai Ice Tea & Thai Ice Coffee", "time": "8 months ago", "rate": "Rated 5.0 out of 5,", "name": "Kenny Chen"}, "740": {"review": "Best Thai restaurant in Hell's Kitchen.", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "John Sanchez"}, "741": {"review": "Excellent thai food", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Ashish Gupta"}, "742": {"review": "Normal Thai food with good service", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Lennon Kwok"}, "743": {"review": "The best Thai restaurant in Manhattan hands down!", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "John Prince"}, "744": {"review": "Love the food. Space is tiny.", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Kris Lee"}, "745": {"review": "The food here never disappoints. The wait to be seated can get crazy at dinner but honestly, it's worth it. If you can pop in for lunch, do so. ", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Lisa Marie Zapata"}, "746": {"review": "Tasty Phoenix and friendly ", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Karim S. Ghoneim"}, "747": {"review": "Great value for money! Good food!", "time": "5 years ago", "rate": "Rated 4.0 out of 5,", "name": "Robin Hoogeveen"}, "748": {"review": "Best thai food in nyc", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Amanda Kennedy"}, "749": {"review": "Amazing!!!! Delicious food and kind service ~~", "time": "4 years ago", "rate": "Rated 5.0 out of 5,", "name": "Hyuna Kwon"}, "750": {"review": "Generally always a bit of wait, but so worth it.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Andrew C Moon"}, "751": {"review": "Super Tasty Thai Food !", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Claudia Mufler"}, "752": {"review": "Great restaurant", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Scott Webber"}, "753": {"review": "Fantastic. Best thai I ever had.", "time": "5 years ago", "rate": "Rated 5.0 out of 5,", "name": "Ana Carolina Monguilod"}, "754": {"review": "Too sweet, but overall is good", "time": "4 years ago", "rate": "Rated 4.0 out of 5,", "name": "陳柏嘉"}, "755": {"review": "Favorite Thai food in the city!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "MG Carty"}, "756": {"review": "Authentic Thai food in a very interesting setting ", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Fariha Muazzam"}, "757": {"review": "Good authentic Thai food that is reasonability price.  The down side is space is a bit tight.", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "lorddroon simpson"}, "758": {"review": "Absolutely delicious.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "James Devens"}, "759": {"review": "Best Thai place in hells kitchen.", "time": "5 years ago", "rate": "Rated 5.0 out of 5,", "name": "Diego R. Joubert"}, "760": {"review": "Very good and unique ", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Angelica Reza"}, "761": {"review": "Authentic flavors and quality", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Stephanie Tong"}, "762": {"review": "A must visit!!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Beth Howell"}, "763": {"review": "Great buzz, delightful food!", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Vlad Manyukhin"}, "764": {"review": "Good thai", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "elizabeth C"}, "765": {"review": "Great", "time": "10 months ago", "rate": "Rated 5.0 out of 5,", "name": "ASHLIN BPG Marketing Inc."}, "766": {"review": "Horrible and dirty place!! Saw cockroach in my plate - never again!!!!", "time": "3 years ago", "rate": "Rated 1.0 out of 5,", "name": "Eleanora Kostinsky"}, "767": {"review": "Too awesome!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Gabriel Patrick"}, "768": {"review": "Favorite Thai food in Manhattan!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Justin Sebastian"}, "769": {"review": "One of the best Thai restaurants in Manhattan. ", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Laurent Grimal"}, "770": {"review": "Excellent spot for authentic Thai.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Anthony Hanrahan"}, "771": {"review": "cheap thai restaurant.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Yujoon Jang"}, "772": {"review": "Best Thai food in NY!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Sneha Bhat"}, "773": {"review": "best thai restaurant in the area!", "time": "5 years ago", "rate": "Rated 4.0 out of 5,", "name": "JеromeASF"}, "774": {"review": "Good pad thai", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Al Mottram"}, "775": {"review": "Best Thai in Hell's Kitchen :)?", "time": "5 years ago", "rate": "Rated 5.0 out of 5,", "name": "Roeland Delrue"}, "776": {"review": "Awesome authentic Thai food.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Samir Kadoo"}, "777": {"review": "Amazing", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Caleb Clark"}, "778": {"review": "l love thai food", "time": "4 years ago", "rate": "Rated 4.0 out of 5,", "name": "Tiquio Barragan"}, "779": {"review": "Just goood food ", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Steve Schneider"}, "780": {"review": "A lesson in authenticity. ", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "kevin melchione"}, "781": {"review": "Great food", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Mark"}, "782": {"review": "Love this place", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "lillian martinez"}, "783": {"review": "Ok Thai. Pam's is better.", "time": "5 years ago", "rate": "Rated 3.0 out of 5,", "name": "Daniel Nguyen"}, "784": {"review": "Unique Thai and very tasty ", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Jacqueline Adam"}, "785": {"review": "Honestly amazing! ", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Junior Javier Burgos"}, "786": {"review": "Absolutely amazing!", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Anuka Dhakal"}, "787": {"review": "I love love their noodles!", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "0 0"}, "788": {"review": "Authentic and tasty noodles", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Jasper Yan"}, "789": {"review": "Great Thai", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Ian Trunk"}, "790": {"review": "Brilliant taste, anytime again!", "time": "4 years ago", "rate": "Rated 5.0 out of 5,", "name": "Tobias Pospischil"}, "791": {"review": "my favorite Thai restaurant in NYC", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Josh Graham"}, "792": {"review": "Yum", "time": "7 months ago", "rate": "Rated 4.0 out of 5,", "name": "Sedale Ziegler"}, "793": {"review": "Very fresh and tasteful.", "time": "5 years ago", "rate": "Rated 5.0 out of 5,", "name": "Malte Will"}, "794": {"review": "Excellent Pad Thai!", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Matt Werner"}, "795": {"review": "Pretty darn good. :)", "time": "4 years ago", "rate": "Rated 4.0 out of 5,", "name": "Jesse Rude"}, "796": {"review": "Amazing flavours, delicious", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Joshua Ellner"}, "797": {"review": "My favorite spot ", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Jon Laneri"}, "798": {"review": "Delicious pad Thai !", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Caroline Hardy"}, "799": {"review": "Worth the wait!", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Mike Scarna"}, "800": {"review": "Innovative and spicy! ", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Erica Broadwell"}, "801": {"review": "Great food", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Josh Kaplan"}, "802": {"review": "Probably in the top 5 ", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Gabriel Wakim"}, "803": {"review": "Excellent place ", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Vivek Rao"}, "804": {"review": "Get the ribs. Really. Just go. Get the ribs.", "time": "6 years ago", "rate": "Rated 5.0 out of 5,", "name": "Sarah Wainio"}, "805": {"review": "sweet and sour", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Jingyi Fan"}, "806": {"review": "Really authentic Thai food", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Lenny Li"}, "807": {"review": "Food was okay.", "time": "a year ago", "rate": "Rated 3.0 out of 5,", "name": "Darshan Shetty"}, "808": {"review": "Nice noodles place ", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Arthit Suriyawongkul"}, "809": {"review": "Authentic Thai food.", "time": "8 years ago", "rate": "Rated 5.0 out of 5,", "name": "David Flinner"}, "810": {"review": "Veggie dumplings and chicken samosas!!", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Ishwarya Venkatachalam"}, "811": {"review": "Great food!", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Ololade Rachel Oguntola"}, "812": {"review": "Fav Thai place in NYC ", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "James Foo"}, "813": {"review": "Best Thai in NYC!", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Predrag Cvetkovski"}, "814": {"review": "disappointed. not as good as the introduction", "time": "6 years ago", "rate": "Rated 3.0 out of 5,", "name": "Zhou Fang"}, "815": {"review": "Just ok. ", "time": "3 years ago", "rate": "Rated 2.0 out of 5,", "name": "A Zwolensky"}, "816": {"review": "yes yes", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Yuri Kashirin"}, "817": {"review": "authentic and delicious", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Dave Fan"}, "818": {"review": "Love this service ", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "salvatore 809"}, "819": {"review": "Quite good", "time": "2 years ago", "rate": "Rated 3.0 out of 5,", "name": "Cosimo Gambuti"}, "820": {"review": "Good food", "time": "4 years ago", "rate": "Rated 5.0 out of 5,", "name": "John Helmkamp"}, "821": {"review": "Best Thai in NY", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Pedro Daniel Palma dos Santos"}, "822": {"review": "Great! Absolutely!", "time": "6 years ago", "rate": "Rated 4.0 out of 5,", "name": "Val D"}, "823": {"review": "Ok", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Michael Castagna"}, "824": {"review": "Must try dumplings!", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "F Z"}, "825": {"review": "Was very busy", "time": "2 years ago", "rate": "Rated 3.0 out of 5,", "name": "Fernando Rios-Avila"}, "826": {"review": "Hidden gem", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Olivia Walker"}, "827": {"review": "SO GOOD!! ", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Chickenstick"}, "828": {"review": "Excellent food", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Shenglong Gao"}, "829": {"review": "Small portions", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Yassmein Jamil"}, "830": {"review": "Very authentic", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Shuai Wu"}, "831": {"review": "Delicious!", "time": "6 years ago", "rate": "Rated 5.0 out of 5,", "name": "Michael Gibbons"}, "832": {"review": "Delicious!! ", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Jo Lord"}, "833": {"review": "great", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Andrej Tóth"}, "834": {"review": "delicious!!!!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Michelin Kasm"}, "835": {"review": "X scavenger ", "time": "4 years ago", "rate": "Rated 2.0 out of 5,", "name": "Joel Ramirez"}, "836": {"review": "Overrated", "time": "6 years ago", "rate": "Rated 2.0 out of 5,", "name": "Christopher Lundquist"}, "837": {"review": "", "time": "3 years ago", "rate": "Rated 5.0 out of 5,", "name": "Nadav Yesod"}, "838": {"review": "Wonderful! Try the ribs!!!!!!!", "time": "4 years ago", "rate": "Rated 5.0 out of 5,", "name": "Antoine P"}, "839": {"review": "(Translated by Google) Damn tasty Thai. Very much homemade. Great service, very fair prices for New York standards.\n\nThere is always a lot going on - so make reservations or schedule waiting times.\n\nBut always a feast for me!\n\n(Original)\nVerdammt leckere Thai. Sehr viel selbstgemacht. Super Service, sehr faire Preise für New Yorker Verhältnisse.\n\nEs ist immer recht viel los - deshalb reservieren oder Wartezeiten mit einplanen.\n\nIst mir jedoch immer ein Fest!", "time": "a week ago", "rate": "Rated 5.0 out of 5,", "name": "Tobi R."}, "840": {"review": "(Translated by Google) Delicious food, cheerful, friendly staff, the price is quite high but also suitable for the center of newyork. A place to visit if anyone loves Thai things.\n\n(Original)\nĐồ ăn ngon, nhân viên vui vẻ, thân thiện, giá cả hơi cao nhưng cũng phù hợp vì ngay trung tâm newyork. Một địa điểm ghé nếu ai mê đồ Thái.", "time": "a month ago", "rate": "Rated 4.0 out of 5,", "name": "Nam Do"}, "841": {"review": "(Translated by Google) Very good thai food and very good service.\nIt is a small place and fills up quickly.\nThe price is pretty good for the food and service …More", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Mario Viña Otero"}, "842": {"review": "(Translated by Google) Best Pao Kee for life !!! Super friendly staff, warm place with a style of its own. Very clean place. I saw the staff washing their hands almost as much as in a hospital! The food is sensational! It is to try without hesitation. The place is not very big but it's worth waiting for a place to be vacated and the average price of a meal is in the US $ 16.\n\n(Original)\nMeilleur Pao kee à vie!!! Personnel super acceuillant, endroit chaleureux avec un style bien à lui. Place très propre. J'ai vu le personnel se laver les mains presqu'autant plus que dans un hôpital ! La nourriture est sensationnelle! C'est à essayer sans hésiter. L'endroit n'est pas très grand mais ça vaut la peine d'attendre qu'une place se libère et le prix moyen d'un repas est dans les 16$ américain.", "time": "4 weeks ago", "rate": "Rated 5.0 out of 5,", "name": "Ann-Lise Maheux"}, "843": {"review": "(Translated by Google) Excellent Thai cuisine ... attention however to the spicy and seasoned tofu ... smelling like castelmagno aged 48 months ... but the taste is not the same ...\n\n(Original)\nOttima cucina Thai... attenzione però al piccante e al tofu stagionato... dal odore sembra castelmagno invecchiato 48 mesi... ma il sapore non è lo stesso...", "time": "4 months ago", "rate": "Rated 4.0 out of 5,", "name": "Sandro Pierini"}, "844": {"review": "(Translated by Google) The food is very generous and delicious. Will come back again\n\n(Original)\n食物非常大方和美味。会再回来光顾的", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Kenneth Su"}, "845": {"review": "(Translated by Google) First of all, the internal space is too small. (So I had to wait a long time) Overall, it is not a neat or quiet atmosphere! It was not crowded and clean, but overall the taste was ok.\n\n(Original)\n우선 내부공간이 너무좁아서 그건 감안하고 가야함. (그래서 오래 기다려야하는 상황이었음) 전체적으로 깔끔하거나 조용한 분위기는 절대아님!!! 시끌벅적하고 깨끗하진 않았으나 맛은 전반적으로 다 괜찮았음", "time": "6 months ago", "rate": "Rated 4.0 out of 5,", "name": "Lina"}, "846": {"review": "(Translated by Google) Excellent and typical as if we were in Thailand!\n\n(Original)\nExcellent et typique comme si nous étions en Thaïlande !", "time": "3 weeks ago", "rate": "Rated 5.0 out of 5,", "name": "Thierry Palette"}, "847": {"review": "(Translated by Google) Very good restaurant, the team is lovely and the dishes as good as in Thailand!\n\n(Original)\nTrès bon restaurant, l'équipe est adorable et les plats aussi bons qu'en Thaïlande !", "time": "2 months ago", "rate": "Rated 5.0 out of 5,", "name": "Guinéelle Mvg"}, "848": {"review": "(Translated by Google) Excellent Thai restaurant, attentive and friendly with an exquisite cuisine at a very affordable price for what is usually the city. The place itself is cozy and the staff is very attentive, they give you details of any doubt about the food. And for the followers of Marvel, ideal opportunity to visit the Daredevil neighborhood, Hell's Kitchen.\n\n(Original)\nExcelente restaurante Thai, atentos y amables con una cocina exquisita a un precio muy asequible para lo que suele ser la ciudad. El propio local es acogedor y el personal es muy atento, te dan detalles de cualquier duda sobre la comida. Y para los seguidores de Marvel, oportunidad ideal para visitar el barrio de Daredevil,  Hell's Kitchen.", "time": "3 months ago", "rate": "Rated 5.0 out of 5,", "name": "Sergio Cubero"}, "849": {"review": "(Translated by Google) Hammer food. Authentic and actually quite cheap for NY, I can only recommend. 1st address for Thai food. Long queue in the evening! Best time 17.00 without waiting\n\n(Original)\nHammer Essen. Autentisch und eigentlich recht günstig für NY kann ich nur empfehlen. 1. Adresse für Thai Essen. Am abend lange schlange! Beste zeit 17.00 ohne Warten", "time": "5 months ago", "rate": "Rated 5.0 out of 5,", "name": "Andy Schocher"}, "850": {"review": "(Translated by Google) Amazing food. A real good surprise. Frame connected. Efficient and attentive service. Delicious food.\n\n(Original)\nAmazing food. Une vraie bonne surprise. Cadre branché. Service efficace et attentionné. Bouffe délicieuse.", "time": "7 months ago", "rate": "Rated 5.0 out of 5,", "name": "Niris Pappas"}, "851": {"review": "(Translated by Google) A small place, but good food and good atmosphere. The people are friendly and attentive and they tell you something about the dishes. You have to look for an early arrival, because there are always people waiting …More", "time": "10 months ago", "rate": "Rated 5.0 out of 5,", "name": "Ulises Mty"}, "852": {"review": "מעולה! צפוף כמו כל מסעדה תאילנדית אבל הטעם שווה את זה.", "time": "10 months ago", "rate": "Rated 5.0 out of 5,", "name": "Maor Chadorchi"}, "853": {"review": "(Translated by Google) Very authentic restaurant with excellent food. Definitely recommended. Maybe you should bring some time, because there is not much space and you might have to wait for a table.\n\n(Original)\nSehr authentisches Restaurant mit ausgezeichnetem Essen. Definitiv empfehlenswert. Ggf sollte man etwas Zeit mitbringen, da nicht viel Platz ist und man ggf. auf einen Tisch warten muss.", "time": "10 months ago", "rate": "Rated 5.0 out of 5,", "name": "Maximiliane Hemens"}, "854": {"review": "(Translated by Google) No interest\n\n(Original)\nNul aucun intérêt", "time": "6 months ago", "rate": "Rated 1.0 out of 5,", "name": "Romuald haimart"}, "855": {"review": "(Translated by Google) Great restaurant!\n\nI did not know Thai food and I'm conquered (I already found an address at home ^^).\n\nI recommend you to spend a nice time: fast service, typical atmosphere and especially very good food!\n\nI recommend\n\n(Original)\nSuper restaurant !\n\nJe ne connaissais pas la cuisine thaï et me voilà conquis (j'ai déjà trouvé une adresse chez moi ^^).\n\nJe vous recommandé pour passer un moment sympa : service rapide, ambiance typique et surtout très bonne cuisine !\n\nJe recommande", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Julien Rey"}, "856": {"review": "טעים! חוויה אותנטית, שירות טוב. מוזיקה מעט רועשת וישיבה צפופה. נהננו!", "time": "11 months ago", "rate": "Rated 5.0 out of 5,", "name": "amiram12345"}, "857": {"review": "(Translated by Google) Pad thai of 10.Good prices\n\n(Original)\nPad thai de 10.buenos precios", "time": "4 months ago", "rate": "Rated 4.0 out of 5,", "name": "Santi"}, "858": {"review": "(Translated by Google) Very good address, great atmosphere with a delicate feminine service. The meal was a treat. Go there without hesitation, book anyway.\n\n(Original)\nTrès bonne adresse, ambiance géniale avec un service féminin délicat. Le repas y a été de tout régal. Allez y sans hésiter, réservez tout de même.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Franck Muller"}, "859": {"review": "其實想評4.5分但是沒有\n總覺得要達到5分差了點感覺\n價格合適，味道不錯\n春卷新鮮好吃，炸得恰到好處\n圖一圖二都是菜單背面12刀的\n一個是牛肉炒粉，一個是花生炒麵\n牛肉一般，炒的粉入味\n花生炒麵有趣，第一次吃可以嘗試", "time": "11 months ago", "rate": "Rated 4.0 out of 5,", "name": "窻燃煙逝"}, "860": {"review": "(Translated by Google) Please enjoy pot Thai. The menu recommended by the staff was not very good. Sticky rice (steamed rice) and green papaya on the potato and additional menu are delicious and delicious.\n\n(Original)\n팟타이를 드세요. 직원이 추천한 메뉴는 별로였어요. 팟타이와 추가메뉴에 있는 sticky  rice (찐밥)와 쏨땀(green  papaya)을 시키면 무난하고 맛있습니다.", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "서예경"}, "861": {"review": "(Translated by Google) Good Thai, recently opened so perhaps still to be defined in detail, attention to spicy dishes …More", "time": "10 months ago", "rate": "Rated 5.0 out of 5,", "name": "riccardo rossi"}, "862": {"review": "(Translated by Google) Very good food, and reasonable prices. Small place.\n\n(Original)\nMuy buena comida, y precios razonables. Lugar pequeño.", "time": "10 months ago", "rate": "Rated 5.0 out of 5,", "name": "Juan Ignacio Alliende Crespo"}, "863": {"review": "(Translated by Google) I tried to come in that high reputation Thai cuisine in New York is a great taste of som tam. Tokyo in about the past three months, also delicious to by far be included in the shops of the top class of the local Phuket travel. Noodle of beef is not a big fan of first place in the beef-based soup with what came out I asked a noodle There juice recommended, it was also, but quite This also was good and try to eat did not ask. However, here is good Som Tam. I recommend if there is an opportunity to come in like a New York Som Tam.\n\n(Original)\nニューヨークで評判の高いタイ料理ということで来てみたがソムタムの味が素晴らしい。ここ3ヶ月くらいで東京、またプーケット旅行で現地のトップクラスのお店を含めてもダントツに美味い。ビーフのヌードルはオススメの汁ありヌードルと頼んだら出てきたもので牛肉ベースのスープでそもそもあまり好きなものではなく、頼むことも無かったが食べてみるとなかなかこれもよかった。ただし、ここはソムタムが上手い。ソムタム好きでニューヨークに来る機会があればオススメだ。", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Mitsu Himeno"}, "864": {"review": "(Translated by Google) Traditional Thai restaurant with elaborate and very appetizing dishes. Very good experience. And the price very reasonable. It is always full.\n\n(Original)\nRestaurante Thai tradicional con platos elaborados y muy apetitosos . Muy buena experiencia. Y el precio muy razonable . Siempre está lleno.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Web Del"}, "865": {"review": "Un pure régale  !", "time": "6 months ago", "rate": "Rated 5.0 out of 5,", "name": "aurelie ori"}, "866": {"review": "(Translated by Google) A delight! Restau super nice! Service at the top. Our canteen in New York!\n\n(Original)\nUn délice! Restau super sympa! Service au top. Notre cantine sur New York!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Gauthier Luc"}, "867": {"review": "(Translated by Google) Delicious dishes ! The place is small, always with a wait, but well worth it!\n\n(Original)\nPratos deliciosos ! O lugar é pequeno, sempre com uma espera, mas vale muito a pena!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Adriana Silva"}, "868": {"review": "(Translated by Google) In some troubles I passed\n\n(Original)\nEn algunos apuros pasé", "time": "2 weeks ago", "rate": "Rated 4.0 out of 5,", "name": "Nora Salas"}, "869": {"review": "Dans le quartier Hells Kitchen, Très bon thaï ! Dessert sticky rice coco excellent", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Benjamin Ledoux"}, "870": {"review": "muyýyyu rico comida tai que nunca había probado. buena relación precio calidad. los platos  super abundantes!!!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Melisa Avaca"}, "871": {"review": "(Translated by Google) Delicious\n\n(Original)\nDelicioso", "time": "3 months ago", "rate": "Rated 5.0 out of 5,", "name": "Gladys Rosales"}, "872": {"review": "(Translated by Google) I was looking for Google Rating 4, and at the entrance of the restaurant was the Old Concept.\nThe table is sticky, and the front door is slippery.\nIf you think of a refreshing pot Thai restaurant, it's a real Thai street restaurant concept.\n\nIf you want to drink beer, pick up the lid and wipe it with a napkin. I could not take a picture, but it was rust or red hot pepper paste.\nIf you drank without brushing;\n\nNo music, noisy and noisy. Soup is soup rice cake soup taste.\n\nThere is no table space like the picture. Four people are required to sit at the table.\n\nTo be honest, at this price, if you're in this kind of environment, you'll be at the $ 8 Combo Sada Hotel in a halal food truck.\n\n(Original)\n구글평 4 라고 해서 찾아갔는데 식당입구에서 올드가 컨셉인지. \n식탁은 끈적거리고 나온 앞접시는 미끄러움.\n깔끔한 팟타이 전문점을 생각하면 절대 안되고 진짜 태국 길거리 식당 컨셉인듯.\n\n맥주는 병채 마시려면 뚜껑 따고 냅킨으로 꼭 닦아마시길. 사진 찍진 못했는데 녹인지 고추장인지 뻘건게 뭍어 있었음.\n닦지 않고 마셨다면;\n\n음악 정신없고 시끄러워 Bar같은 느낌. Soup은 국물떡볶이 국물맛이예요.\n\n사진처럼 테이블간격이 아예 없어 테이블에 앉으려면 4명이 가야함. \n\n솔직히 이 가격에 이런 환경에서 서비스라면 할랄푸드트럭에서 8달러 짜리 Combo사다 호텔서 먹을껄.", "time": "a year ago", "rate": "Rated 1.0 out of 5,", "name": "kwangsub kim"}, "873": {"review": "ก๋วยเตี๊ยวอร่อย บริการดี", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Atichat Monthatip"}, "874": {"review": "Excelente comida\nVaya con tiempo y mente tranquila", "time": "10 months ago", "rate": "Rated 5.0 out of 5,", "name": "paulo andres jaramillo rueda"}, "875": {"review": "Ottima vera cucina tailandese,prezzi abbordabili", "time": "9 months ago", "rate": "Rated 5.0 out of 5,", "name": "Teresa Middea"}, "876": {"review": "Excellent, mais n'ont pas respecté le niveau de piquant demandé, c'était difficile à manger", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Anne Marie Barakat"}, "877": {"review": "(Translated by Google) Friday night visit, in the waiting position by at least 30-50 minutes, because of the small restaurant seats so crowded noisy atmosphere, food waited at least 15 minutes, and point the green papaya salad is very salty, seafood rice noodle soup with vegetables and pork in taste on, so the price is good, there is the occasional seat before considering another meal\n\n(Original)\n星期五的晚上拜訪，內用至少候位30分鐘至50分鐘，因為餐廳小所以座位擁擠氣氛吵雜，食物至少等了15分鐘，點了青木瓜沙拉非常的鹹，海鮮湯麵跟蔬菜豬肉飯味道中上，這樣的價錢是不錯的，偶爾經過有位子才考慮再用餐", "time": "2 years ago", "rate": "Rated 3.0 out of 5,", "name": "Ivy Cheng"}, "878": {"review": "(Translated by Google) Good little local tgai to eat on the run count $ 12 soup $ 9 on 4 dim sum, $ 14 a small Thai salad of spicy and deliciously fresh beef. Allow 15 minutes waiting because the address is deemed\n\n(Original)\nBon petit tgaï de quartier pour manger sur le pouce comptez 12$ la soupe 9$  les 4 dim sum, 14$ la petite salade thaï de bœuf épicée et délicieusement  fraîche.  Prévoir 15 mns d'attente car l'adresse est réputée", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Jeff Chofty"}, "879": {"review": "(Translated by Google) No wonder this is a highly rated Thai restaurant! Jungle curry is the best friend rice Thai food I've ever had! If I go to New York again, I will go to this restaurant! I would certainly recommend this place to like Thai food or spicy food person. I think next time try their other dishes:\n\n(Original)\n难怪这是一个高评级的泰国餐厅！ 丛林咖喱朋友米饭是我吃过的最好的泰国菜！ 如果我再次去纽约，我一定会去这家餐厅！ 我一定会推荐这个地方给喜欢泰国食物或辛辣食物的人。 我想下次尝试他们的其他菜：", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "xiao li"}, "880": {"review": "(Translated by Google) Highly recommended\n\n(Original)\nSehr empfehlenswert", "time": "11 months ago", "rate": "Rated 5.0 out of 5,", "name": "Roland Lamer"}, "881": {"review": "(Translated by Google) Great atmosphere but very large crowd. Should you reserve.\n\n(Original)\nTolle Atmosphäre jedoch sehr grosser Andrang. Sollte man reservieren.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Thomas Kessler"}, "882": {"review": "(Translated by Google) I missed eating something Thai and this place is a hit. Both in price, attention and quality. The Pad Thai very rich, as well as the Wok with cashew nuts. The dumplings that are also very rich, with that peanut point so characteristic of Thai food.\n\n(Original)\nEchaba de menos comer algo Thai y este sitio es un acierto. Tanto en precio, atención como en calidad. El Pad Thai muy rico, así como el Wok con cashew nuts. Los dumplings que tienen también muy ricos, con ese punto de cacahuete tan característico de la comida Thai.", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Sebastian Martinez"}, "883": {"review": "(Translated by Google) It's delicious, but the place is small.\n\n(Original)\n맛있긴한데 장소가 좁아요ㅠㅠ", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "황보승우"}, "884": {"review": "(Translated by Google) Really Thai food!\n\n(Original)\nEcht Thais eten!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Wesley Plugers"}, "885": {"review": "(Translated by Google) For me, one of the best Thai places in NY.\nAll the dishes I tasted were very good, not greasy and just sufficient quantity.\nNot much room inside, so avoid arrival at peak. You can order takeaway.\n\n(Original)\nPour moi, une des meilleures adresses Thaï de NY. \nTous les plats que j'ai goûté étaient vraiment très bons, pas gras et en quantité juste suffisante.\nPas beaucoup de place à l'intérieur, il faut donc éviter d'arrivée en heure de pointe. On peut commander à emporter.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Romain Miroux"}, "886": {"review": "(Translated by Google) Excellent Thai food, you have to go early to find place without waiting.\nPay attention to the dish of the day, it is usually very good! Beginners of the spicy beware, a medium level is quite hot for those of us who like and are accustomed to.\nEnjoy it.\n\n(Original)\nExcelente comida Thai, hay que ir temprano para encontrar lugar sin espera.\nPrestar atención al plato del día, suele ser muy bueno! Novatos del picante cuidado, un nivel medio es bastante hot para quienes nos gusta y estamos acostumbrados.\nQue lo disfruten. ", "time": "4 years ago", "rate": "Rated 5.0 out of 5,", "name": "Fernando Freire"}, "887": {"review": "(Translated by Google) Very small restaurant, authentic. The food was good.\n\n(Original)\nTrès petit restaurant, authentique. La nourriture était bonne.", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Gabriel Potvin"}, "888": {"review": "Excellents plats et un service aux petits oignons.", "time": "8 months ago", "rate": "Rated 5.0 out of 5,", "name": "Annabelle BIAIS"}, "889": {"review": "Está bueno y bien atendido.", "time": "9 months ago", "rate": "Rated 4.0 out of 5,", "name": "Gamo X"}, "890": {"review": "(Translated by Google) The place is simple and small, but the food is excellent. It's worth going and wait for a table. People are very thoughtful.\n\n(Original)\nO lugar é simples e pequeno, mas a comida é excelente. Vale a pena ir e esperar por uma mesa. As pessoas são bem atenciosas.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "aron piterman"}, "891": {"review": "(Translated by Google) Spices also very delicious but strong. The service is also good degree from New York, I visited the restaurant two days eopdapnida be the empty glass of water. Service was perfect. Friendly waiter / waitress. Great food. Nice portion of food for one person.\n\n(Original)\n향신료도 강하지 않고 아주 맛있습니다. 서비스도 제가 다녀본 뉴욕 식당중에서 가장 좋을정도 이고 물잔이 비워질 일이 없답니다. Service was perfect. Friendly waiter/waitress . Great food. Nice portion of food for one person .", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "배가고프다"}, "892": {"review": "(Translated by Google) Nice restaurant with the little Thai music that goes well. The food is good, nothing exceptional but just good. Good value for money. I recommend !\n\n(Original)\nResto sympa avec la petite musique thaï qui va bien. Les plats sont bons, rien d'exceptionnels mais simplement bons. Bon rapport qualité prix. Je recommande !", "time": "3 years ago", "rate": "Rated 4.0 out of 5,", "name": "Clemence Rmd"}, "893": {"review": "(Translated by Google) My favorite place New York. They have to eat there. Delicious and not expensive.\n\n(Original)\nMi lugar favorito de New York. Tienen que comer ahí. Delicioso y nada caro.", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "gabacow Hurt"}, "894": {"review": "(Translated by Google) Good food\n\n(Original)\nBuena comida", "time": "a year ago", "rate": "Rated 4.0 out of 5,", "name": "Armenta Maldonado"}, "895": {"review": "(Translated by Google) Not much taste, not much hygiene ...\n\n(Original)\n맛도 별로, 위생도 별로...", "time": "a year ago", "rate": "Rated 2.0 out of 5,", "name": "HJ L"}, "896": {"review": "(Translated by Google) A real Thai atmosphere in new york\n\n(Original)\nUne vraie ambiance thaïlandaise a new york ", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Fabien Lelouet"}, "897": {"review": "(Translated by Google) Soup Pa-Yao light beef noodles\nPai Thai is quite good\nRibs slightly sweet\n\n(Original)\nSoup Pa-Yao清淡点的牛肉面\nPai Thai很不错\nRibs略甜", "time": "4 years ago", "rate": "Rated 4.0 out of 5,", "name": "YM Xu"}, "898": {"review": "excelente comida. el lugar aunque pequeno es encantador. ", "time": "4 years ago", "rate": "Rated 5.0 out of 5,", "name": "Luis Miguel Serrano"}, "899": {"review": "(Translated by Google) Very tasty / delicious\n\n(Original)\nVery tasty/ sehr lecker ", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Max Kuck"}, "900": {"review": "Yuum!!!", "time": "a year ago", "rate": "Rated 5.0 out of 5,", "name": "Kathrine Thoen"}, "901": {"review": "(Translated by Google) Thai food is good to eat a little spicy\n\n(Original)\n泰国菜很好吃 就是有点辣", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "张筱濛"}, "902": {"review": "(Translated by Google) Good and fast\n\n(Original)\nBueno y rapidos", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "Míriam Sierra"}, "903": {"review": "just nomnomnonom :)", "time": "5 years ago", "rate": "Rated 5.0 out of 5,", "name": "Natalia Zurkowska"}, "904": {"review": "(Translated by Google) tough\n\n(Original)\nGrea", "time": "2 years ago", "rate": "Rated 4.0 out of 5,", "name": "Sumitra Potdar"}, "905": {"review": "(Translated by Google) Good, good!\n\n(Original)\n赞，不错！", "time": "2 years ago", "rate": "Rated 5.0 out of 5,", "name": "guangyu huang"}, "906": {"review": "", "time": "2 days ago", "rate": "Rated 5.0 out of 5,", "name": "S U"}, "907": {"review": "", "time": "4 days ago", "rate": "Rated 3.0 out of 5,", "name": "Ibrahim B"}, "908": {"review": "", "time": "a week ago", "rate": "Rated 4.0 out of 5,", "name": "Claire Kong"}, "909": {"review": "", "time": "a week ago", "rate": "Rated 5.0 out of 5,", "name": "George Clement"}, "910": {"review": "", "time": "a week ago", "rate": "Rated 5.0 out of 5,", "name": "Christopher Klimas"}, "911": {"review": "", "time": "a week ago", "rate": "Rated 5.0 out of 5,", "name": "Tk Tram"}, "912": {"review": "", "time": "2 weeks ago", "rate": "Rated 5.0 out of 5,", "name": "samyak sabat"}, "913": {"review": "", "time": "2 weeks ago", "rate": "Rated 5.0 out of 5,", "name": "Joseph Dries III"}, "914": {"review": "", "time": "2 weeks ago", "rate": "Rated 5.0 out of 5,", "name": "Chase Jones"}, "915": {"review": "", "time": "2 weeks ago", "rate": "Rated 5.0 out of 5,", "name": "Karina Lappot"}, "916": {"review": "", "time": "2 weeks ago", "rate": "Rated 4.0 out of 5,", "name": "Eby Vincent Mathew"}, "917": {"review": "", "time": "2 weeks ago", "rate": "Rated 3.0 out of 5,", "name": "Bilal Sayed"}, "918": {"review": "", "time": "2 weeks ago", "rate": "Rated 4.0 out of 5,", "name": "Lina Chan"}, "919": {"review": "", "time": "3 weeks ago", "rate": "Rated 4.0 out of 5,", "name": "Bobby Meraglia"}, "920": {"review": "", "time": "3 weeks ago", "rate": "Rated 5.0 out of 5,", "name": "Syeda Hassan"}, "921": {"review": "", "time": "3 weeks ago", "rate": "Rated 5.0 out of 5,", "name": "ESH VANTERPOOL"}, "922": {"review": "", "time": "4 weeks ago", "rate": "Rated 5.0 out of 5,", "name": "Joe Giammalvo"}, "923": {"review": "", "time": "4 weeks ago", "rate": "Rated 5.0 out of 5,", "name": "Edison Chaves"}, "924": {"review": "", "time": "4 weeks ago", "rate": "Rated 5.0 out of 5,", "name": "Gaurav Sareen"}, "925": {"review": "", "time": "4 weeks ago", "rate": "Rated 5.0 out of 5,", "name": "Lora Anda Lovinger"}, "926": {"review": "", "time": "4 weeks ago", "rate": "Rated 3.0 out of 5,", "name": "Lorna Courtney"}, "927": {"review": "", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "TM"}, "928": {"review": "", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Siva Srinivasan"}, "929": {"review": "", "time": "a month ago", "rate": "Rated 3.0 out of 5,", "name": "Borja de Altolaguirre"}, "930": {"review": "", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Andy Rice"}, "931": {"review": "", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Vy Nguyen"}, "932": {"review": "", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "James Hill"}, "933": {"review": "", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Raul Chavez"}, "934": {"review": "", "time": "a month ago", "rate": "Rated 3.0 out of 5,", "name": "Kartik Rawal"}, "935": {"review": "", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Lyshii saeau"}, "936": {"review": "", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Tanguy Bayard"}, "937": {"review": "", "time": "a month ago", "rate": "Rated 4.0 out of 5,", "name": "Krish Menon"}, "938": {"review": "", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Nikola Damjanovic"}, "939": {"review": "", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Andy Hendricks"}, "940": {"review": "", "time": "a month ago", "rate": "Rated 4.0 out of 5,", "name": "HY H"}, "941": {"review": "", "time": "a month ago", "rate": "Rated 4.0 out of 5,", "name": "Riteeka Gupta"}, "942": {"review": "", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "robert grillo"}, "943": {"review": "", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Troy Simmons"}, "944": {"review": "", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Lyncy Faith"}, "945": {"review": "", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "টিপু খান"}, "946": {"review": "", "time": "a month ago", "rate": "Rated 4.0 out of 5,", "name": "Hanh Trang"}, "947": {"review": "", "time": "a month ago", "rate": "Rated 4.0 out of 5,", "name": "Nicholas Judson"}, "948": {"review": "", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Odessa Harris"}, "949": {"review": "", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "KUMAR RANJAN"}, "950": {"review": "", "time": "a month ago", "rate": "Rated 4.0 out of 5,", "name": "LukEZ Everything"}, "951": {"review": "", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Vishal Merani"}, "952": {"review": "", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Renee Jackson-Smith"}, "953": {"review": "", "time": "a month ago", "rate": "Rated 5.0 out of 5,", "name": "Wanqi Wang"}, "954": {"review": "", "time": "2 months ago", "rate": "Rated 5.0 out of 5,", "name": "Win Su"}, "955": {"review": "", "time": "2 months ago", "rate": "Rated 4.0 out of 5,", "name": "rebecca tucker"}, "956": {"review": "", "time": "2 months ago", "rate": "Rated 5.0 out of 5,", "name": "Vince Conn"}, "957": {"review": "", "time": "2 months ago", "rate": "Rated 5.0 out of 5,", "name": "Lauren Hardie"}, "958": {"review": "", "time": "2 months ago", "rate": "Rated 4.0 out of 5,", "name": "Shirley Yang"}, "959": {"review": "", "time": "2 months ago", "rate": "Rated 5.0 out of 5,", "name": "Dixie Go"}, "960": {"review": "", "time": "2 months ago", "rate": "Rated 4.0 out of 5,", "name": "Vicky Wight"}, "961": {"review": "", "time": "2 months ago", "rate": "Rated 5.0 out of 5,", "name": "Our_Favorite_Friend_Tim"}, "962": {"review": "", "time": "2 months ago", "rate": "Rated 5.0 out of 5,", "name": "Evan DeCorte"}, "963": {"review": "", "time": "2 months ago", "rate": "Rated 5.0 out of 5,", "name": "amanda burns"}, "964": {"review": "", "time": "2 months ago", "rate": "Rated 5.0 out of 5,", "name": "Angela Isabel Chen"}, "965": {"review": "", "time": "2 months ago", "rate": "Rated 4.0 out of 5,", "name": "Kirk Levins"}, "966": {"review": "", "time": "2 months ago", "rate": "Rated 5.0 out of 5,", "name": "Kenneth"}, "967": {"review": "", "time": "2 months ago", "rate": "Rated 5.0 out of 5,", "name": "Caroline with love"}, "968": {"review": "", "time": "2 months ago", "rate": "Rated 5.0 out of 5,", "name": "ganesh ubale"}, "969": {"review": "", "time": "2 months ago", "rate": "Rated 2.0 out of 5,", "name": "Olivia Chan"}, "970": {"review": "", "time": "3 months ago", "rate": "Rated 5.0 out of 5,", "name": "Lillian Zhang"}, "971": {"review": "", "time": "3 months ago", "rate": "Rated 5.0 out of 5,", "name": "jeongwon Lee"}, "972": {"review": "", "time": "3 months ago", "rate": "Rated 5.0 out of 5,", "name": "Austin B"}, "973": {"review": "", "time": "3 months ago", "rate": "Rated 5.0 out of 5,", "name": "Ran Hao"}, "974": {"review": "", "time": "3 months ago", "rate": "Rated 5.0 out of 5,", "name": "Maisie Douglas"}, "975": {"review": "", "time": "3 months ago", "rate": "Rated 5.0 out of 5,", "name": "Janet Jin"}, "976": {"review": "", "time": "3 months ago", "rate": "Rated 4.0 out of 5,", "name": "Kenny Durell"}, "977": {"review": "", "time": "3 months ago", "rate": "Rated 4.0 out of 5,", "name": "hae-eun lee"}, "978": {"review": "", "time": "3 months ago", "rate": "Rated 5.0 out of 5,", "name": "Reem Aziz"}, "979": {"review": "", "time": "3 months ago", "rate": "Rated 5.0 out of 5,", "name": "Yu Lily"}, "980": {"review": "", "time": "3 months ago", "rate": "Rated 5.0 out of 5,", "name": "Mel Grant"}, "981": {"review": "", "time": "3 months ago", "rate": "Rated 5.0 out of 5,", "name": "Will Heath"}, "982": {"review": "", "time": "3 months ago", "rate": "Rated 4.0 out of 5,", "name": "Paulina Leyva"}, "983": {"review": "", "time": "3 months ago", "rate": "Rated 5.0 out of 5,", "name": "Ale Ginger"}, "984": {"review": "", "time": "3 months ago", "rate": "Rated 5.0 out of 5,", "name": "Kenny Antonio Mendoza Herrera"}, "985": {"review": "", "time": "3 months ago", "rate": "Rated 5.0 out of 5,", "name": "Hannah C"}, "986": {"review": "", "time": "4 months ago", "rate": "Rated 5.0 out of 5,", "name": "Palas Nuwal"}, "987": {"review": "", "time": "4 months ago", "rate": "Rated 5.0 out of 5,", "name": "Benjamin Cousino"}, "988": {"review": "", "time": "4 months ago", "rate": "Rated 3.0 out of 5,", "name": "Abhishek Chopra"}, "989": {"review": "", "time": "4 months ago", "rate": "Rated 5.0 out of 5,", "name": "Luca Gorini"}, "990": {"review": "", "time": "4 months ago", "rate": "Rated 4.0 out of 5,", "name": "Lan Zhuo"}, "991": {"review": "", "time": "4 months ago", "rate": "Rated 4.0 out of 5,", "name": "Lior Hirshhoren Lavie"}, "992": {"review": "", "time": "5 months ago", "rate": "Rated 5.0 out of 5,", "name": "Channy Park"}, "993": {"review": "", "time": "5 months ago", "rate": "Rated 4.0 out of 5,", "name": "Thomas Atkinson"}, "994": {"review": "", "time": "5 months ago", "rate": "Rated 5.0 out of 5,", "name": "Socrates Durães"}, "995": {"review": "", "time": "5 months ago", "rate": "Rated 5.0 out of 5,", "name": "Russ DeLaCruz"}, "996": {"review": "", "time": "5 months ago", "rate": "Rated 5.0 out of 5,", "name": "Alexandre Talbot"}, "997": {"review": "", "time": "5 months ago", "rate": "Rated 5.0 out of 5,", "name": "Mike Anderson"}, "998": {"review": "", "time": "5 months ago", "rate": "Rated 4.0 out of 5,", "name": "Itasha Pokharel"}, "999": {"review": "", "time": "5 months ago", "rate": "Rated 4.0 out of 5,", "name": "Pakorn M"}, "1000": {"review": "", "time": "5 months ago", "rate": "Rated 5.0 out of 5,", "name": "LibbyGrace"}}